/*
 Navicat MySQL Data Transfer

 Source Server         : 本地数据库
 Source Server Type    : MySQL
 Source Server Version : 50726
 Source Host           : 0.0.0.0:3306
 Source Schema         : 2020

 Target Server Type    : MySQL
 Target Server Version : 50726
 File Encoding         : 65001

 Date: 02/07/2021 14:38:36
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for dd_addres
-- ----------------------------
DROP TABLE IF EXISTS `dd_addres`;
CREATE TABLE `dd_addres` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `province` varchar(32) NOT NULL,
  `city` varchar(32) NOT NULL,
  `district` varchar(32) NOT NULL,
  `addres` varchar(32) NOT NULL,
  `name` varchar(32) NOT NULL,
  `phone` varchar(11) NOT NULL,
  `create_time` int(11) NOT NULL,
  `update_time` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `isDefault` tinyint(4) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 COMMENT='收货地址表';

-- ----------------------------
-- Records of dd_addres
-- ----------------------------
BEGIN;
INSERT INTO `dd_addres` VALUES (1, '广东', '广州市', '天河区', '天河路', '李先生', '13800138012', 1624521353, 1624521353, 34, 1);
INSERT INTO `dd_addres` VALUES (2, '广东', '深圳市', '南山区', '深南大道', '李先生', '13800138000', 1625006719, 1625006719, 46, 1);
INSERT INTO `dd_addres` VALUES (3, '北京市', '北京市', '东城区', '东城区', '123155', '13800138003', 1625037644, 1625037644, 25, 1);
COMMIT;

-- ----------------------------
-- Table structure for dd_ads
-- ----------------------------
DROP TABLE IF EXISTS `dd_ads`;
CREATE TABLE `dd_ads` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `type` int(11) NOT NULL COMMENT '0:启动广告\n1:banner广告\n2:职位广告',
  `title` varchar(45) DEFAULT NULL,
  `subtitle` varchar(45) DEFAULT NULL,
  `time` int(11) DEFAULT NULL,
  `image` varchar(1024) DEFAULT NULL,
  `url` varchar(45) DEFAULT NULL,
  `create_time` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=17 DEFAULT CHARSET=utf8 COMMENT='广告列表';

-- ----------------------------
-- Records of dd_ads
-- ----------------------------
BEGIN;
INSERT INTO `dd_ads` VALUES (8, 1, '123', 'Banner广告', NULL, '/uploads/images/3c/e3fb8ae0ecbb87deff3e603694a9bc.jpg', 'http://www.baidu.com', 1624474540);
INSERT INTO `dd_ads` VALUES (9, 1, '123123', 'Banner广告', NULL, '/uploads/images/26/3624736492f6f50b0b52508f4cc1fd.jpg', 'http://www.taobao.com', 1624474557);
INSERT INTO `dd_ads` VALUES (10, 1, '32123', 'Banner广告', NULL, '/uploads/images/6b/ba5a181aaf2241fa700c5233e630fc.jpg', 'http://www.jd.com', 1624474576);
INSERT INTO `dd_ads` VALUES (11, 2, '32123', '职位广告', NULL, '/uploads/images/6b/ba5a181aaf2241fa700c5233e630fc.jpg', 'https://www.tmall.com/', 1624474610);
INSERT INTO `dd_ads` VALUES (12, 2, '聚划算', '职位广告', NULL, '/uploads/images/3c/e3fb8ae0ecbb87deff3e603694a9bc.jpg', 'https://pages.tmall.com/', 1624474642);
INSERT INTO `dd_ads` VALUES (15, 0, '新广告', '启动广告', 6, '/uploads/images/2f/febb3932bfd991c141772f049b73ee.jpg', 'http://www.jd.com', 1625028897);
INSERT INTO `dd_ads` VALUES (16, 1, '无充蓝牙鼠标方案', 'Banner广告', NULL, '/uploads/images/fe/4f02eafe1d71b15fa239b93355dc09.jpg', 'http://www.taobao.com', 1625029027);
COMMIT;

-- ----------------------------
-- Table structure for dd_articles
-- ----------------------------
DROP TABLE IF EXISTS `dd_articles`;
CREATE TABLE `dd_articles` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `type` int(11) NOT NULL DEFAULT '0' COMMENT '1: 涨知识\n2:公告',
  `title` varchar(64) NOT NULL DEFAULT '' COMMENT '标题',
  `desn` varchar(5000) NOT NULL DEFAULT '0' COMMENT '描述',
  `dandan_cost` varchar(45) NOT NULL DEFAULT '0' COMMENT '蛋币',
  `much_money` varchar(45) NOT NULL DEFAULT '0' COMMENT '多少钱',
  `image` varchar(255) NOT NULL COMMENT '缩略图',
  `body` varchar(10000) NOT NULL COMMENT '主体内容',
  `visible` varchar(255) NOT NULL DEFAULT '0' COMMENT '谁可见',
  `pay_count` int(11) NOT NULL,
  `create_time` int(11) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=22 DEFAULT CHARSET=utf8 COMMENT='文章，涨知识';

-- ----------------------------
-- Records of dd_articles
-- ----------------------------
BEGIN;
INSERT INTO `dd_articles` VALUES (1, 1, '校草又在装高冷', '一段源于音乐的邂逅，一段源于网游的陪伴\n一段轻松、愉悦、浪漫的爱情故事\n一段青春、拼搏、励志的成长经历\n来看一个天才音乐少女和钢琴小王子的缠绵悱恻', '0', '0', '/uploads/images/76/c5f46573dc92eba40f87d7433df403.jpg', '金岭市，入冬以后非常的冷，就在圣诞节的前些天，还下起了今年的第一场雪。\n\n颜慕琪走在一所学校的围墙外面，道路两旁并排种满了梧桐，而就在不远处的一棵梧桐树下，她看见了自己的目标。\n\n“达飞！”颜慕琪打着招呼，一蹦一跳地就跑到了男生的身边。\n\n然而，看着陈达飞阴沉的脸，她心理立刻泛起了嘀咕，是不是篮球比赛又输了呢？\n\n不会吧！市内有哪所初中的篮球队，能打得过拥有陈达飞作为主力的球队呢！\n\n“达飞，你怎么啦？好像挺不开心的样子……今天的比赛结果怎么样？我们赢了吗？”慕琪笑着想要试图让这个男生开心一点。\n\n“我们赢了。”陈达飞面无表情，声音冰冷地说。\n\n“耶！太棒啦！”颜慕琪跳了起来，向空中伸着拳头，“达飞，恭喜你拿下全市初中生篮球锦标赛的冠军，这样明年夏天你就可以无憾地去升高中了。”\n\n颜慕琪吐了吐舌头，“可惜，我还有一年初中要读，不能和你一起升学。”\n\n“哼！”陈达飞忽然发出一声冷笑。\n\n颜慕琪和往常一样，大咧咧地拍了拍他的后背说：“怎么啦！拿个冠军就不得了啦，对我这老朋友都爱答不理的……你再这样我就不理你了哦！”\n\n“老朋友？”陈达飞咬着这三个字，“慕琪，在你心里，我究竟算得了什么？”\n\n颜慕琪一愣，她没想到陈达飞会问她这样的问题，自从她九岁那年，父母带着她从北京搬到了金岭市以来，由于两家挨的比较近，他们就经常在一起玩儿了，不知不觉已经过去五年了。\n\n五年的相处，陈达飞在她的心里究竟是什么呢？\n\n女孩儿的心有些悸动，青春期的少女怀着一颗懵懂的心看着眼前的男孩儿，他高大、强壮、有着一张棱角分明且透着刚毅的脸庞，这样的男生不知道被多少女生偷偷地暗恋着呢！\n\n颜慕琪觉得自己的脸颊有些发烧，但看着男孩儿“臭屁”地板着一张脸，又颇有些不服气地说：“你在我心里啊！可能……大概……貌似……是兄长的样子吧！”\n\n兄长？这话她自己都觉得违心，她早就很清楚陈达飞在自己的心里，可不止是她说的“兄长”那么简单。\n\n“兄长！”陈达飞一副恨不得吃了她的表情，“好，就算是兄长好了……你这个妹妹当得可真好啊！”\n\n颜慕琪的笑容僵住了，她如何听不出对方话里嘲讽的意味，这可是他们在一起五年里，从来没有过的事情。\n\n在她和陈达飞的相处中，陈达飞永远都是让着她、护着她、宠着她，几时如今天这般对她冷言冷语了。\n\n陈达飞深吸口气，似乎是在平复着心情，然后瞪着她一字一字地说：“你…为什么…要帮吴娜娜烤那个蛋糕？”\n\n吴娜娜？蛋糕？\n\n没错，今天中午吴娜娜突然找到她，请她帮忙烤一个蛋糕，说是要拿这个蛋糕去跟一个男生表白……\n\n颜慕琪心里忽然感到一丝的不妙，有些结巴地说：“娜娜……娜娜说，她要跟一个男生表白，请我帮……帮忙烤一个蛋糕……”\n\n“我就问你为什么要帮她烤？”陈达飞粗暴地打断了她的话。\n\n慕琪的内心慌了，眼神迷乱地飘忽着，“娜娜……娜娜是我唯一的闺蜜，她找我帮忙，我怎么会拒绝她呢。”\n\n陈达飞咆哮道：“那你就没有问过她，她要去表白的男生到底是谁？”\n\n颜慕琪摇摇头，她不可思议地指着面前的男生，瞪圆了双眼说：“不会……是你吧！”\n\n陈达飞紧紧地攥着拳头，指甲恨不得都嵌进了肉里，他心里的委屈和愤怒又有谁清楚呢？\n\n当他从篮球场上抱着奖杯走下来，看见吴娜娜捧了一个蛋糕向他走来，他一眼就认出了这个蛋糕的寓意，以及这个蛋糕是出自何人的手笔。\n\n他记得，就在今年年初的那个寒假里……\n\n颜慕琪在一本美食杂志上看到一个非常漂亮的蛋糕设计图，当时就拉着陈达飞看了，还信誓旦旦地说：“以后我要是有喜欢的男生了，就做一个这样的蛋糕送他，算是表白了。”\n\n陈达飞当时不屑一顾地说：“这么难看，而且又是你烤的，肯定不好吃。”\n\n颜慕琪鼓着腮帮子，不服气地说：“谁说的，我可是有专门学过烘焙课程的，这点信心还是有的。”\n\n“切，我才不信呢，你不烤糊就不错了。”\n\n“少瞧不起人，士别三日刮目相看，懂不懂。”\n\n“不懂，除非你先去烤一个给我。”\n\n“好啊！”颜慕琪一赌气真的就丢下杂志跑进了厨房，没多大会儿工夫又跑了回来，气鼓鼓地说：“你又想骗我给你做吃的了，之前不是给你烤过饼干吃了嘛，已经证明过实力给你看了，这次休想骗我。”\n\n“唉！小傻瓜……”陈达飞轻轻地拍了拍她的小脑瓜，有些气恼地说：“你就不能再聪明点吗？或是再笨一点也行。”\n\n颜慕琪不解地瞪了他一眼说：“本姑娘聪明的很，凭什么要叫我笨一点。“\n\n因此，当陈达飞看见这个蛋糕时，在那样一个成功加喜悦的氛围中，让他短暂地失去了平时的冷静，根本没有发现这其中的蹊跷之处。\n\n他接过那个“颜慕琪送给他”的蛋糕时，兴奋地和每一位朋友分享了起来，那时候他的心情，开心得像个孩子。\n\n直到他的好友们开始向他表达祝贺时，他才猛然间发觉，事情好像并不是自己想象的那个样子。\n\n但是，这个时候全世界都已经知道了，吴娜娜向他表白成功的这件事情。\n\n就在他打算跟大家解释清楚的时候，他的父母也走了过来，一反过去对于他“早恋”的抵制态度，竟然也表达出了赞成的意思。\n\n就连他母亲都甚感欣慰地说：“我家达飞眼光真好，能攀上吴院长家的千金，真是这一辈子的福气……”\n\n吴院长！他知道，这个人一直是他父母想要去巴结，却怎么也巴结不上的对象。\n\n面对木已成舟的局面，他退缩了，他只能怀着满腔的怨怼和怒火，打电话喊了颜慕琪出来见面，想问清楚这一切到底是怎么回事！\n\n而看到颜慕琪此刻慌乱的状态，就更加证实了他内心的想法，那的确不是她给自己的表白蛋糕，她……被自己最好的闺蜜，算计了！', '0', 6, 1624379120);
INSERT INTO `dd_articles` VALUES (2, 1, '魂道倾天', '噬魂大法，破大脑封印；魂武双修，魂破九重天。\n天生异瞳的姜楠，征服生命禁区昆仑，获上古噬魂青莲，黑洞穿越至异界，与爆体蛟龙血肉融合，脱胎换骨，破茧重生，开启异界波澜壮阔的征战之旅。\n这是一本雄性励志、激情、杀戮、征服的玄幻。\n场面宏大、跌宕起伏、全程高能，您值得推荐、收藏。\n故事采用时空交叉的叙事结构，前几章稍有耐心，静静品读。如同醇厚老酒，越品越有味道，一旦入戏，定将如痴如醉，欲罢不能。', '0', '0', '/uploads/images/8e/625dcf8eace85de3cbcba582a7bbe4.jpg', '黑暗森林，坠龙涧，生命禁区。\n\n“蚩剑，你个人渣，人面兽心的衣冠禽兽，我就是死也不会让你得逞。”\n\n一个十六七岁，身着简单豹纹衣裙的少女，正在灌木山石间飞快奔逃，腰上的伤口随着奔跑一次次撕裂，少女坚定的脸上也不断漏出痛苦之色。\n\n“唐婉儿，你就别跑了。这里就我们孤男寡女，天当被、地当床，做我的女人吧。”\n\n身着麻布袍的男子不紧不慢的随在少女身后，目光阴鸷邪魅，盯着奔逃的少女，如同盯着猎物，扭曲的脸上闪烁着淫邪的光。\n\n而前方少女脚步一刻不停，直接朝着坠龙涧的方向逃去。\n\n“婉儿，你要干什么？前面就是坠龙涧，你不想活了？”\n\n“我死了，我爹必灭你全族！”\n\n说罢，少女毅然决绝的跳向坠龙涧，身体在罡风中像风中的树叶，随波逐流，被罡风席卷进暴风眼。\n\n跳崖少女或许是命大，或许是运气好，少女跳崖的瞬间恰是罡风最弱的时候，随着罡风吸入了一个巨大岩洞中。\n\n“嘤咛”，不知过了多久，唐婉儿从昏迷中醒来，浑身被罡风撕扯的衣衫褴褛，伤痕累累。\n\n忍住剧痛，唐婉儿在岩洞中四处打量，巨大的岩洞嵌入在险峻的山体中腰，她就在岩洞的边缘，从边缘向下看，是深不见底的大峡谷，向上看，万仞绝壁直耸天际，岩洞前方是延绵无际的仙见愁山脉。\n\n巨大的岩洞似乎把山掏空了，有数十个练武场大小，仿佛是刀劈斧砍而成，看来像是一个远古秘境。\n\n岩洞内散乱地矗立着人首蛇身雕像。\n\n有的跃跃欲试，欲一飞冲天，\n\n有的满目狰狞，要挣脱身上的枷锁，\n\n有的勾魂摄魄、妖娆魅惑，\n\n活灵活现、惟妙惟肖。\n\n突然，唐婉儿似乎听到一个有力的“砰砰砰”的心跳声，循声看去，一个两人高的巨蛋，龙影环绕。唐婉儿水灵的眼睛睁得滚圆，我就是被这颗龙蛋撞晕的？这可真撞了大运。\n\n这是颗龙蛋？这里是坠龙涧，难道一条小龙要孵化出壳了？\n\n围着龙蛋转了一圈，发现龙蛋外壳竟有无数的小气旋吸扯着外界的灵气能量，这颗龙蛋就是制造大峡谷常年罡风不断的那只煽动翅膀的蝴蝶？\n\n也暗自庆幸，没有被罡风扯成碎片。\n\n唐婉儿热切地看着颤动的龙蛋，捂着高耸的胸部，担心狂跳的心脏蹦了出来。\n\n“神迹呀，大难不死，上天赐予我天大的机缘，据说刚出壳的神兽看到的第一个活物，会当成自己的娘，我岂不是可以拥有一头神兽？”\n\n----------------------\n\n唐婉儿做梦也想不到，龙蛋内孕育了一个人，一个十四五岁的少年。\n\n此时，龙蛋里的少年慢慢睁开眼睛，蜷缩着身体，全身刺痛，游离的意识开始回归，发现自己包裹在一个肉茧之中里，他伸开双手想要撕破肉茧，但是没有成功。他又尝试了各种手段，都没能破开肉茧。\n\n他不再挣扎，开始检视自己的身体，像是十四五岁的少年，全身全乎，下意识往胯下一看，“嗯，还在。”\n\n身体像铁打的一样，肌肉的柔韧性相当好，男人，就该这样，该硬的，要够硬，该软的，要柔韧。”\n\n我是谁？我来自哪儿？我这是在哪儿？\n\n一个名字在脑海一闪而过，姜楠……\n\n少年大脑开始撕裂般疼痛，脑海中的三叶青莲依然存在，但似乎小了一圈，相当萎靡。\n\n而这离奇一切，似乎都和这三叶青莲有关。\n\n记忆，像潮水般涌来，一幅幅画面闪烁重现……\n\n---------------------\n\n姜楠，二十三岁，炎黄血脉，天生异瞳，地球异能组织的精英，\n\n生命禁区昆仑山探秘队长…寻找传说中开启异界空间的虫洞…\n\n小队成员一个个死去…\n\n传说中的冰宫圣殿…苍翠欲滴的上古三叶青莲…\n\n队友和恋人的突然反目…身体被墨阳剑洞穿…\n\n青莲钻入自己的眉心…莲花冰台塌陷…\n\n陷入黑洞…那一对狗男女在黑洞关闭前也跳入了黑洞。\n\n来到异界再一次出现意外，\n\n空间乱流与正在渡劫的天蟒蛟龙惊天对撞，自己和蛟龙双双爆裂…\n\n画面最后的一瞬…\n\n三叶青莲包裹着自己灵魂，似乎听到一声感叹，神魂不灭，生命长存。\n\n----------------\n\n经历了爆体之灾的姜楠甚至不相信自己还活着，脑海中的青莲奄奄一息，散发着微弱的光晕，心念一闪，是旷世青莲以惊天伟力逆天改命，护住自己的魂魄，在这个不知名的异界重生了。\n\n甚至与爆体的蛟龙筋骨糅合，伐毛洗髓、脱胎换骨，身体较前世，如同重新回炉锻造，精钢反复淬炼，去芜存菁，难怪连身体都小了一号，变成了十四、五岁的样子。\n\n异界重生过了多久了？几天？几年？不重要，重要的是还活着。\n\n姜楠开启异瞳发现自己被一个巨大的肉茧包裹，自己如同婴儿般蜷缩，身体与肉茧之间如同被万千个细微的血管连接，汲取肉茧中精纯的能量。\n\n周边的肉质坚韧无比，困在其中甚至动弹不得。\n\n已强大数倍的双手无法撕裂肉茧，张口边向嘴边的肉撕咬而去，非常艰难的撕咬下一小块，血肉新鲜如初，而且弹糯细腻，入口即化。\n\n肉质晶莹剔透，似乎每一个细微的肉里都蕴涵着惊人的能量，这便是龙肉吗？\n\n只是，这样撕咬着吃，不知需要到猴年马月，既然窍穴都能直接汲取能量，何不再试试易筋经呢？\n\n姜楠在地球成立的密训组织，搜罗了全球各种传说中的秘籍、功法的古本，易筋经就是其一，此易筋经绝非市面及地摊流传的易筋经可比。据说修练易筋经可伐毛洗髓、脱胎换骨，身体柔弱无骨、却又坚若磐石。\n\n姜楠在地球上就练过易筋经，或许灵气匮乏、或许能量太低，并没有什么用。\n\n姜楠即刻进入空冥状态，运行功法，在这个生机浓烈肉茧里，没想到易筋经大显神威，将饱含生机的血液拉成丝拖入身体，周边的血肉精华以看得见的速度朝姜楠涌来。\n\n大量的能量通过窍穴吸入姜楠的身体时，突入的巨大能量让筋骨、肌肉撕裂，巨大的疼痛让姜楠差点让姜楠昏厥过去。\n\n“凝神静气、抱首归一”，碎裂的筋骨开始蠕动、酥痒、愈合，并排出乌黑的杂质。\n\n这就是就是传说中的脱胎换骨、伐毛洗髓？是苦尽甘来后命运给自己的馈赠吗？\n\n姜楠兴奋的狞笑，“哈哈哈哈，莫森、凤凰，你们两个贱人也来到异界了，老子应该感谢你们呢？还是恨你们呢？不是被你们所赐捅了一剑，还不能得到上古青莲，更不会与蛟龙糅合改造身体。\n\n今日的机缘到底是拜你们所赐，这到底是你们的幸运呢？还是你们的不幸呢？待我脱困肉茧之刻，更是龙体锻造成功之时。”\n\n-----------------\n\n“咦，你是谁？怎么在我的龙蛋里？我对你…满满的恶意？”一个稚嫩的如同四、五岁孩童的声音在脑海响起。\n\n识海中传出一个声音，好像不是声音，而是一种意念。\n\n这尼玛是什么意思？还一个活物，难道爆体的蛟龙也重生了？\n\n这时姜楠的异瞳之眼看到肉茧里另一个非蛇非龙的生命，这个生命甚至还和自己血肉相连。\n\n稍加思索，姜楠即刻明白三叶青莲不仅保护了自己的灵魂，与爆体蛟龙筋骨糅合重塑了自己的身体，还重塑了渡劫蛟龙，也难怪脑海中的三叶青莲小了一圈。\n\n姜楠灵机一动对小龙道：“你是我双胞胎弟弟。”\n\n“凭啥你是哥，我是弟？…为什么，对你有敌意？”\n\n姜楠俨然一副兄长模样，继续对小龙说教：“我们在一颗龙蛋里，但是我已经进化为龙人，你进化得慢还只是龙兽，所以我是哥哥，你是弟弟。你出生的使命只有一个，弟弟要保护哥哥，吃苦在前，享受在后，这都是天理。\n\n你对我敌意，是因为你太自私，想独占龙蛋的精华。你以后对长兄有敌意，会天打五雷轰，遭雷劈的。”姜楠信口胡诌道。\n\n“啊？”爆体天蟒如今重生为幼小蛟龙，之前的意识已经荡然无存，但是听到“雷劈”的字眼，脑海中仿佛又出现令人心悸的雷劫，太可怕了，仔细想的时候，大脑撕裂般疼痛。\n\n太可怕了，这真是长兄？重生后的天蟒由于刚才灵魂的悸动，似信非信、将信将疑。\n\n“哥哥给你起个名字，叫姜小纯，你的心要像冰山一样纯洁，对哥哥不能有一丝一毫恶意。”\n\n可怜的姜小纯才刚成型，心如白纸，就被姜楠按自己的意愿，在他纯洁的白纸上书写着，刻在内心深处。\n\n“我们很快就要出去了，趁这个机遇，全力吸收巨蛋的精华为身体所用，失去精华的蛋壳坚硬程度也会变弱。\n\n我们兄弟俩联手打破这个囚笼，然后龙行天下，真是快意恩仇呀！”\n\n兄弟两又各自的方式进入了破茧而出的修炼。\n\n姜楠全力启动易筋经，在身体的各个窍穴形成一个个小小的漩涡，龙肉如丝般般再次向姜楠窍穴涌入身体，周边的血肉形成漩涡将原本坚韧如筋的龙肉碎化成粘稠的血液向姜楠涌来。\n\n龙蛋内能量迅速减少的同时，龙蛋正在展示着可怕的吞噬力，巨蛋形成一个个漩涡，如同填不满的黑洞，吸扯着周边的所有能量，大峡谷再次起风了。\n\n少女吓了一跳，跳的远远的，眼睛却一眨不眨，生怕错过了神兽出壳的伟大时刻，“发财了，发财了，越强大的神兽，出壳前需要的能量越多。”\n\n三天过去了，姜楠痛并快乐着的享受着筋骨、肌肉一次次破碎，又重新快速重组，身体一次次如同精铁般锻造，一次次排出身体的毒素、杂质后，身体轻盈了许多，柔韧无骨、却又坚若磐石，似乎每一个细胞都充满了蓬勃的活力。\n\n当肉茧内最后的能量精华被两兄弟吸收殆尽后，肉茧已相当薄弱了，终于可以破壳重生了。', '0', 4, 1624379206);
INSERT INTO `dd_articles` VALUES (3, 2, '国务院办公厅关于印发深化医药卫生体制改革  2021年重点工作任务的通知', '国办发〔2021〕20号', '0', '0', '/uploads/images/79/ff3dce5c7aa3c0f255b615638b4969.jpg', '各省、自治区、直辖市人民政府，国务院各部委、各直属机构：\n\n《深化医药卫生体制改革2021年重点工作任务》已经国务院同意，现印发给你们，请结合实际，认真组织实施。\n\n国务院办公厅\n\n2021年5月24日\n\n（此件公开发布）\n\n\n\n深化医药卫生体制改革2021年重点工作任务\n\n\n新一轮医药卫生体制改革实施以来，我国基本医疗卫生制度加快健全，人民健康状况和基本医疗卫生服务的公平性可及性持续改善。2021年是中国共产党成立100周年，也是实施“十四五”规划、开启全面建设社会主义现代化国家新征程的第一年。深化医改要坚持以习近平新时代中国特色社会主义思想为指导，全面贯彻党的十九大和十九届二中、三中、四中、五中全会精神，认真落实党中央、国务院决策部署，深入实施健康中国战略，推广三明市医改经验，强化改革系统联动，促进优质医疗资源均衡布局，统筹疫情防控与公共卫生体系建设，继续着力推动把以治病为中心转变为以人民健康为中心，着力解决看病难、看病贵问题。\n\n一、进一步推广三明市医改经验，加快推进医疗、医保、医药联动改革\n\n（一）大力推广三明市医改经验。在三明市建设全国深化医改经验推广基地，加大经验推广力度。按照“腾空间、调结构、保衔接”的路径，以降药价为突破口，同步推进医疗服务价格、薪酬、医保支付等综合改革。完善服务体系和体制机制，促进优质医疗资源均衡布局。加强对推广三明市医改经验的指导。（国务院医改领导小组秘书处、各相关部门按职责分工负责）\n\n（二）推进药品耗材集中采购。常态化制度化开展国家组织药品集中采购，逐步扩大药品和高值医用耗材集中带量采购范围。落实国家组织药品耗材集中采购医保资金结余留用政策，指导医疗机构利用好增加的可支配收入，积极推进薪酬制度改革。加大力度推进国家医保谈判药品落地使用，2021年8月底前进一步完善相关政策措施。建立实施医药价格和招采信用评价制度。推进统一的医保药品、医用耗材分类与编码标准。推进医疗器械唯一标识在监管、医疗、医保等领域的衔接应用。（国家医保局、国家卫生健康委、财政部、人力资源社会保障部、国家药监局等按职责分工负责）\n\n（三）深化医疗服务价格改革。指导地方建立健全灵敏有度的价格动态调整机制，定期开展调价评估，提高体现技术劳务价值的医疗服务价格，对进展滞后的地区加大指导督促力度。加快审核新增医疗服务价格项目。指导地方依法依规改革优化政府制定医疗服务价格的行为规则和相关成本监审听证目录，允许定价部门采取简明易行的方式开展成本调查和听取意见。推进深化医疗服务价格改革试点，2021年9月底前印发政策文件。（国家医保局、国家发展改革委、国家卫生健康委、国家中医药局等按职责分工负责）\n\n（四）深化人事薪酬制度改革。落实“两个允许”要求，合理确定、动态调整公立医院薪酬水平。加强对地方的督促指导，推动落实政府办医责任和公立医院投入政策。拓宽公立医院薪酬制度改革的经费渠道。允许医院自主设立薪酬项目，鼓励对主要负责人实行年薪制。改革完善医务人员职称评价机制，突出实践能力业绩导向，鼓励卫生专业技术人员扎根防病治病一线。（教育部、财政部、人力资源社会保障部、国家卫生健康委、国家中医药局等按职责分工负责）\n\n（五）推进医保支付方式改革。推进按疾病诊断相关分组付费、按病种分值付费试点，促进精细管理，适时总结经验并向全国推广。完善基层机构医保政策，引导恢复期和康复期患者到基层就诊。（国家医保局、财政部、国家卫生健康委、国家中医药局等按职责分工负责）\n\n（六）推动公立医院高质量发展。坚持和加强党对公立医院的全面领导，全面落实党委领导下的院长负责制。深入实施公立医院绩效考核，健全以公益性为导向的考核指标和方式方法，考核结果及时以适当方式向社会公布，并与公立医院新增薪酬总量挂钩。开展公立医院高质量发展试点。深入推进公立医院综合改革示范和建立健全现代医院管理制度试点。（国家卫生健康委、国务院国资委、中央编办、国家发展改革委、教育部、财政部、人力资源社会保障部、国家医保局、国家中医药局等按职责分工负责）\n\n二、促进优质医疗资源均衡布局，完善分级诊疗体系\n\n（七）推动优质医疗资源扩容和均衡布局。启动国家医学中心和第二批区域医疗中心试点建设项目，统筹谋划推进“十四五”时期区域医疗中心建设，完善合作方式和引导机制，推动试点医院与输出医院同质化发展。针对省、市、县诊疗需求，规划推进“十四五”时期临床专科能力建设，加快补齐服务短板。加大公立医疗卫生机构建设力度。积极支持社会办医发展。优化支持国有企业办医疗机构发展，2021年10月底前制定相关政策文件。（国家发展改革委、国家卫生健康委、国务院国资委、国家中医药局等按职责分工负责）\n\n（八）推进医疗联合体建设。推进县域医共体和城市医疗集团试点，强化网格化建设布局和规范化管理。完善县域医共体引导政策，提高县域疾病防治水平。推进对紧密型医疗联合体实行总额付费，加强监督考核，结余留用、合理超支分担，引导医疗联合体更加注重疾病预防、提升基层服务能力和推动基层首诊、双向转诊。社会办医疗机构可牵头组建或参加县域医共体和城市医疗集团。推进专科联盟和远程医疗协作网发展。（国家卫生健康委、国家医保局、国家发展改革委、国家中医药局等按职责分工负责）\n\n（九）加快推进分级诊疗体系建设。加强“十四五”时期统筹谋划，加大支持引导力度，推动省、市、县、乡、村等各级各类医疗机构落实功能定位，均衡发挥作用。制定加快分级诊疗体系建设的政策文件。开展优质高效的整合型医疗卫生服务体系试点。持续推进县级医院（含中医医院）服务和管理能力建设。改善基层基础设施条件，发展社区医院。推动采取灵活的家庭医生签约服务周期。落实乡村医生待遇。实施基层中医药服务能力提升工程“十四五”行动计划。（国家卫生健康委、国家发展改革委、教育部、人力资源社会保障部、国家医保局、国家中医药局等按职责分工负责）\n\n（十）完善全民医保制度。加快推进健全重特大疾病医疗保险和救助制度。建立健全职工医保门诊共济保障机制。鼓励有条件的省份按照分级管理、责任共担、统筹调剂、预算考核的思路，推动基本医保省级统筹。完善异地就医结算管理和服务，基本实现普通门诊费用跨省直接结算统筹地区全覆盖，探索高血压、糖尿病等门诊慢特病跨省直接结算。指导地方做好跨统筹地区医保关系转移接续工作。完善医保定点医疗机构和定点零售药店协议管理，积极推进“掌上办”、“网上办”等便民服务。（国家医保局、财政部、国家卫生健康委、国家中医药局等按职责分工负责）\n\n（十一）推动中医药振兴发展。实施中医药振兴发展重大工程。支持打造一批国家中医药传承创新中心、中西医协同“旗舰”医院、中医特色重点医院、国家中医疫病防治基地，实施名医堂工程，提升县级中医医院传染病防治能力。推进中医医院牵头组建医疗联合体。完善符合中医药特点的医保支付政策，发布中医优势病种。推进国家中医药综合改革示范区建设。2021年9月底前，制定实施促进中医治未病健康工程升级的意见。（国家中医药局、国家发展改革委、国家卫生健康委、国家医保局等按职责分工负责）\n\n三、坚持预防为主，加强公共卫生体系建设\n\n（十二）加强新冠肺炎疫情防控。坚持常态化防控和局部应急处置有机结合，毫不放松做好外防输入、内防反弹各项工作。加快推进新冠病毒疫苗接种，提升接种能力，保障疫苗批签发质量和效率，提升企业有效供给能力。推动完善公共卫生重大风险评估、研判、决策机制，强化基层公共卫生体系。健全公共卫生应急处置和物资保障体系。（国家卫生健康委、国家疾病预防控制局〔以下简称国家疾控局〕、外交部、国家发展改革委、工业和信息化部、财政部、海关总署、国家医保局、国家移民局、中国民航局、国家药监局等按职责分工负责）\n\n（十三）深化疾病预防控制体系改革。提升早期监测预警、风险评估研判、现场流行病学调查、检验检测、应急处置等能力。建立稳定的公共卫生事业投入机制，创新科研和社会化服务机制。加强国家级公共卫生机构人才队伍和实验室建设，提升重大公共卫生应急和防控能力。建立健全重大疫情救治体系。健全公共卫生医师制度，完善人才评价，主要评价岗位职责履行情况。（国家卫生健康委、国家疾控局、国家发展改革委、教育部、科技部、财政部、人力资源社会保障部、海关总署、国家中医药局等按职责分工负责）\n\n（十四）持续推进健康中国行动。建立全媒体健康科普知识发布和传播机制。强化市场监管，坚决依法打击非法兜售保健品、坑蒙拐骗等行为。推进基本公共卫生服务均等化。加强精神卫生和心理健康服务。扩大高发癌症筛查覆盖范围，启动县级癌症筛查和早诊早治中心建设试点。推进儿童青少年近视防控和超重肥胖防控。加强艾滋病、地方病、职业病等重大疾病防治。推动老年健康服务体系建设，增加医养结合服务供给。深入开展爱国卫生运动。推进村（居）民委员会公共卫生委员会建设。（国家卫生健康委、国家疾控局、中央宣传部、中央网信办、教育部、民政部、市场监管总局、体育总局、国家中医药局等按职责分工负责）\n\n（十五）创新医防协同机制。强化疾病预防控制中心技术指导、人员培训、督导评价等职能，督促各级医疗机构落实疾病预防控制职责。推进高血压、高血糖、高血脂“三高”共管试点，推动疾控机构与医疗机构在慢性病综合防治方面业务融合。强化县级医院公共卫生服务职能。完善妇幼保健机构内部管理，提供防治结合的医疗保健服务。依托现有医疗卫生机构，提升省级、地市级职业病预防控制、诊断治疗、康复能力。加强毕业后教育和继续教育，大力培养医防融合人才。（国家卫生健康委、国家疾控局、国家发展改革委、教育部、财政部、国家中医药局等按职责分工负责）\n\n四、统筹推进相关重点改革，形成工作合力\n\n（十六）推进全民健康信息化建设。制定全国医疗卫生机构医疗健康信息互通共享实施方案，破除信息壁垒，促进数据共享互认。加强智慧医院建设，推动人工智能、第五代移动通信（5G）等新技术应用。规范互联网诊疗服务，严格实行监管，完善药品网络销售监管工作机制。指导医疗机构合理保留传统服务方式，着力解决老年人等群体运用智能技术困难的问题。（工业和信息化部、国家卫生健康委、国家医保局、国家中医药局、国家疾控局、国家药监局等按职责分工负责）\n\n（十七）改善群众服务体验。深入推进“互联网+医疗健康”、“五个一”服务行动。推广多学科诊疗、日间手术等服务模式，优化预约诊疗。推动医疗机构优化线上线下支付流程，改善结算模式。推进先诊疗后结算或一站式缴费改革试点。明确医疗机构检查结果互认具体办法。加强胸痛、卒中、危重孕产妇、新生儿和儿童、创伤等重大急性病救治中心建设。（国家卫生健康委、国家发展改革委、国家中医药局、中央军委后勤保障部卫生局等按职责分工负责）\n\n（十八）加强医学人才培养和使用。加强全科医生等紧缺人才培养。实施医学专业高校毕业生免试申请乡村医生执业注册政策。面向社会招收的普通高校应届毕业生经住院医师规范化培训合格后当年在医疗卫生机构就业的，在招聘、派遣、落户等方面按应届毕业生同等对待；对经住院医师规范化培训合格的本科学历临床医师，在招聘、职称晋升、岗位聘用、薪酬待遇等方面与临床医学、口腔医学、中医专业学位硕士研究生同等对待。加强农村订单定向医学生就业安置和履约管理，将定向生违约情况纳入信用信息管理。加强校医队伍建设。（教育部、人力资源社会保障部、国家卫生健康委、国家中医药局等按职责分工负责）\n\n（十九）增强药品供应保障能力。持续推进药品优先审评审批，加快创新药、临床急需药品上市。完善短缺药品保供稳价机制。加强儿童用药供应保障。研究修订国家基本药物目录管理办法，优化目录遴选调整程序，适时启动目录调整工作。加强基本药物配备使用和用药规范管理，促进医疗联合体内部用药衔接。制定医疗机构药事管理办法。（工业和信息化部、国家卫生健康委、国家药监局等按职责分工负责）\n\n（二十）严格监督管理。完善医疗卫生行业综合监管督察机制。大力推行医疗卫生行业“互联网+监管”，加快完善“双随机、一公开”监督抽查、飞行检查等精准监管机制，强化监管结果公开和责任追究。深化医保基金监管制度体系改革，推进医保智能监控示范点建设。制定原料药领域的反垄断指南。（国家卫生健康委、国家疾控局、市场监管总局、国家医保局、国家中医药局等按职责分工负责）\n\n各地各有关部门要切实加强组织领导，勇于担当作为，敢于触碰利益，大力推广三明市医改经验，持续深化医改。国务院医改领导小组秘书处要加强统筹谋划和跟踪监测，建立任务台账并按季度通报。要加强宣传引导，及时回应社会关切，凝聚改革共识。', '[\"1\",\"2\",\"3\",\"4\",\"5\",\"6\",\"7\",\"8\",\"9\",\"10\",\"11\",\"12\",\"13\"]', 0, 1624379392);
INSERT INTO `dd_articles` VALUES (4, 1, '蛋蛋收费测试', '这里写描述内容，支持2000字', '3', '0', '/uploads/images/3f/7e91e1045f34a78e83c9c533b8cc6d.jpg', '这里写描述内容，支持5000字.这里写描述内容，支持5000字.这里写描述内容，支持5000字.这里写描述内容，支持5000字.这里写描述内容，支持5000字.这里写描述内容，支持5000字.这里写描述内容，支持5000字.这里写描述内容，支持5000字.这里写描述内容，支持5000字.这里写描述内容，支持5000字.这里写描述内容，支持5000字.这里写描述内容，支持5000字.这里写描述内容，支持5000字.这里写描述内容，支持5000字.这里写描述内容，支持5000字.这里写描述内容，支持5000字.', '0', 3, 1624400731);
INSERT INTO `dd_articles` VALUES (5, 1, '32123', '32123', '3', '0', '/uploads/images/3f/7e91e1045f34a78e83c9c533b8cc6d.jpg', '3212321', '0', 2, 1624400873);
INSERT INTO `dd_articles` VALUES (6, 1, '测钱包支付', '测钱包支付', '0', '1', '/uploads/images/59/bd79bd567067f9c4b9c92694338813.jpg', '测钱包支付测钱包支付测钱包支付测钱包支付测钱包支付测钱包支付测钱包支付', '0', 0, 1624401750);
INSERT INTO `dd_articles` VALUES (7, 2, '普通用户可见', '普通用户可见普通用户可见普通用户可见', '0', '0', '/uploads/images/59/bd79bd567067f9c4b9c92694338813.jpg', '普通用户可见普通用户可见普通用户可见普通用户可见普通用户可见', '[\"1\"]', 0, 1624401779);
INSERT INTO `dd_articles` VALUES (8, 2, '准工人可见', '准工人可见', '0', '0', '/uploads/images/59/bd79bd567067f9c4b9c92694338813.jpg', '准工人可见准工人可见准工人可见准工人可见准工人可见准工人可见准工人可见准工人可见准工人可见', '[\"2\"]', 0, 1624401807);
INSERT INTO `dd_articles` VALUES (9, 2, '工人用户可见', '工人用户可见工人用户可见工人用户可见', '0', '0', '/uploads/images/59/bd79bd567067f9c4b9c92694338813.jpg', '工人用户可见工人用户可见工人用户可见工人用户可见工人用户可见工人用户可见工人用户可见', '[\"3\"]', 0, 1624401824);
INSERT INTO `dd_articles` VALUES (10, 2, '初级合伙人可见', '初级合伙人可见初级合伙人可见初级合伙人可见', '0', '0', '/uploads/images/59/bd79bd567067f9c4b9c92694338813.jpg', '初级合伙人可见初级合伙人可见初级合伙人可见初级合伙人可见初级合伙人可见初级合伙人可见初级合伙人可见初级合伙人可见初级合伙人可见初级合伙人可见', '[\"4\"]', 0, 1624401862);
INSERT INTO `dd_articles` VALUES (11, 2, '高级合伙人可见', '高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见', '0', '0', '/uploads/images/59/bd79bd567067f9c4b9c92694338813.jpg', '高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见高级合伙人可见', '[\"5\"]', 0, 1624401883);
INSERT INTO `dd_articles` VALUES (12, 2, '准高级合伙人可见', '准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见', '0', '0', '/uploads/images/59/bd79bd567067f9c4b9c92694338813.jpg', '准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见准高级合伙人可见', '[\"6\"]', 0, 1624401905);
INSERT INTO `dd_articles` VALUES (13, 2, '战略联盟可见', '战略联盟可见战略联盟可见战略联盟可见战略联盟可见', '0', '0', '/uploads/images/59/bd79bd567067f9c4b9c92694338813.jpg', '战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见战略联盟可见', '[\"7\"]', 0, 1624401929);
INSERT INTO `dd_articles` VALUES (14, 2, '驻场老师可见', '驻场老师可见驻场老师可见驻场老师可见', '0', '0', '/uploads/images/59/bd79bd567067f9c4b9c92694338813.jpg', '驻场老师可见驻场老师可见驻场老师可见驻场老师可见驻场老师可见驻场老师可见驻场老师可见', '[\"8\"]', 0, 1624401948);
INSERT INTO `dd_articles` VALUES (15, 2, '驻场经理可见', '驻场经理可见驻场经理可见驻场经理可见驻场经理可见驻场经理可见驻场经理可见', '0', '0', '/uploads/images/59/bd79bd567067f9c4b9c92694338813.jpg', '驻场经理可见驻场经理可见驻场经理可见驻场经理可见驻场经理可见驻场经理可见驻场经理可见驻场经理可见驻场经理可见驻场经理可见', '[\"9\"]', 0, 1624401969);
INSERT INTO `dd_articles` VALUES (16, 2, '工厂HR可见', '工厂HR可见工厂HR可见工厂HR可见工厂HR可见工厂HR可见', '0', '0', '/uploads/images/59/bd79bd567067f9c4b9c92694338813.jpg', '工厂HR可见工厂HR可见工厂HR可见工厂HR可见工厂HR可见工厂HR可见工厂HR可见工厂HR可见工厂HR可见工厂HR可见工厂HR可见工厂HR可见工厂HR可见工厂HR可见工厂HR可见工厂HR可见工厂HR可见工厂HR可见工厂HR可见工厂HR可见工厂HR可见工厂HR可见工厂HR可见工厂HR可见工厂HR可见工厂HR可见工厂HR可见工厂HR可见工厂HR可见工厂HR可见', '[\"10\"]', 0, 1624402365);
INSERT INTO `dd_articles` VALUES (17, 2, '业务员可见', '业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见', '0', '0', '/uploads/images/59/bd79bd567067f9c4b9c92694338813.jpg', '业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见业务员可见', '[\"11\"]', 0, 1624402392);
INSERT INTO `dd_articles` VALUES (18, 2, '人事部可见', '人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见', '0', '0', '/uploads/images/59/bd79bd567067f9c4b9c92694338813.jpg', '人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见人事部可见', '[\"12\"]', 0, 1624402413);
INSERT INTO `dd_articles` VALUES (19, 2, '财务部可见', '财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见', '0', '0', '/uploads/images/59/bd79bd567067f9c4b9c92694338813.jpg', '财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见财务部可见', '[\"13\"]', 0, 1624402432);
INSERT INTO `dd_articles` VALUES (21, 2, '标题', '描述描述描述描述描述描述描述描述描述描述', '0', '0', '/uploads/images/6b/ba5a181aaf2241fa700c5233e630fc.jpg', '内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容', '[\"1\",\"2\",\"3\",\"4\",\"5\",\"6\",\"7\",\"8\",\"9\",\"10\",\"11\",\"12\",\"13\"]', 0, 1625021302);
COMMIT;

-- ----------------------------
-- Table structure for dd_bank_list
-- ----------------------------
DROP TABLE IF EXISTS `dd_bank_list`;
CREATE TABLE `dd_bank_list` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(32) DEFAULT NULL,
  `bank_code` varchar(10) DEFAULT NULL,
  `bank` varchar(255) DEFAULT NULL,
  `rate` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=23 DEFAULT CHARSET=utf8 COMMENT='银行列表';

-- ----------------------------
-- Records of dd_bank_list
-- ----------------------------
BEGIN;
INSERT INTO `dd_bank_list` VALUES (1, '中国工商银行', '0102', 'ICBC', '0.00');
INSERT INTO `dd_bank_list` VALUES (2, '中国农业银行', '0103', 'ABC', '0.00');
INSERT INTO `dd_bank_list` VALUES (3, '中国银行', '0104', 'BOC', '0.00');
INSERT INTO `dd_bank_list` VALUES (4, '中国建设银行', '0105', 'CCB', '0.00');
INSERT INTO `dd_bank_list` VALUES (5, '国家开发银行', '0201', 'CDB', '0.00');
INSERT INTO `dd_bank_list` VALUES (6, '中国农业发展银行', '0203', 'ADBC', '0.00');
INSERT INTO `dd_bank_list` VALUES (7, '交通银行', '0301', 'BANKCOMM', '0.00');
INSERT INTO `dd_bank_list` VALUES (8, '中信银行', '0302', 'CITICBANK', '0.00');
INSERT INTO `dd_bank_list` VALUES (9, '中国光大银行', '0303', 'CEBBANK', '0.00');
INSERT INTO `dd_bank_list` VALUES (10, '华夏银行', '0304', 'HXBANK', '0.00');
INSERT INTO `dd_bank_list` VALUES (11, '中国民生银行', '0305', 'CMBC', '0.00');
INSERT INTO `dd_bank_list` VALUES (12, '广东发展银行', '0306', 'CGB', '0.00');
INSERT INTO `dd_bank_list` VALUES (13, '平安银行', '0307', 'PINGAN', '0.00');
INSERT INTO `dd_bank_list` VALUES (14, '招商银行', '0308', 'CMB', '0.00');
INSERT INTO `dd_bank_list` VALUES (15, '兴业银行', '0309', 'CIB', '0.00');
INSERT INTO `dd_bank_list` VALUES (16, '上海浦东发展银行', '0310', 'SPDB', '0.00');
INSERT INTO `dd_bank_list` VALUES (17, '中国邮政储蓄银行', '0403', 'PSBC', '0.00');
INSERT INTO `dd_bank_list` VALUES (18, '北京银行', '04031000', 'BJBANK', '0.00');
INSERT INTO `dd_bank_list` VALUES (19, '中国邮政储蓄', '0403', 'PSBC', '0.00');
INSERT INTO `dd_bank_list` VALUES (20, '东莞农商银行', '14156020', 'DRCBANK', '0.00');
INSERT INTO `dd_bank_list` VALUES (21, '农村合作银行', '0317', 'SDNXS', '0.00');
INSERT INTO `dd_bank_list` VALUES (22, '东莞银行', '04256020', 'GONGGUANBANK', '0.00');
COMMIT;

-- ----------------------------
-- Table structure for dd_borrow
-- ----------------------------
DROP TABLE IF EXISTS `dd_borrow`;
CREATE TABLE `dd_borrow` (
  `id` int(32) NOT NULL AUTO_INCREMENT,
  `money` varchar(255) DEFAULT '0',
  `create_timer` varchar(21) DEFAULT NULL,
  `uid` int(11) DEFAULT NULL,
  `status` int(255) DEFAULT '0' COMMENT '是否已还款',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of dd_borrow
-- ----------------------------
BEGIN;
INSERT INTO `dd_borrow` VALUES (1, '200', '1624474557', 29, 0);
INSERT INTO `dd_borrow` VALUES (2, '900', NULL, 48, 0);
COMMIT;

-- ----------------------------
-- Table structure for dd_dividend
-- ----------------------------
DROP TABLE IF EXISTS `dd_dividend`;
CREATE TABLE `dd_dividend` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uid` int(11) NOT NULL DEFAULT '0' COMMENT '得到分红的用户',
  `amount` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '分红金额',
  `fid` int(11) NOT NULL DEFAULT '0',
  `jid` int(11) NOT NULL DEFAULT '0',
  `isWithdraw` int(11) NOT NULL DEFAULT '0',
  `proportion` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '分红比例',
  `wages` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '工价',
  `create_time` int(11) NOT NULL,
  `type` varchar(45) NOT NULL,
  `rid` int(11) DEFAULT '0' COMMENT '佣金的角色',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8 COMMENT='分红';

-- ----------------------------
-- Records of dd_dividend
-- ----------------------------
BEGIN;
INSERT INTO `dd_dividend` VALUES (1, 43, '1.0', 1, 4, 0, '1', '90.0', 1625026135, '小时工', 8);
INSERT INTO `dd_dividend` VALUES (2, 43, '1.0', 1, 4, 0, '1', '90.0', 1625026135, '小时工', 11);
INSERT INTO `dd_dividend` VALUES (3, 0, '8.80', 1, 4, 0, '11.0', '90.0', 1625026135, '小时工', 15);
INSERT INTO `dd_dividend` VALUES (4, 22, '22.00', 1, 4, 0, '27.5', '90.0', 1625026135, '小时工', 7);
INSERT INTO `dd_dividend` VALUES (5, 22, '13.20', 1, 4, 0, '16.5', '90.0', 1625026135, '小时工', 5);
INSERT INTO `dd_dividend` VALUES (6, 25, '36.00', 1, 4, 1, '45.0', '90.0', 1625026135, '小时工', 4);
INSERT INTO `dd_dividend` VALUES (7, 43, '1.0', 1, 4, 0, '1', '90.0', 1625037113, '小时工', 8);
INSERT INTO `dd_dividend` VALUES (8, 43, '1.0', 1, 4, 0, '1', '90.0', 1625037113, '小时工', 11);
INSERT INTO `dd_dividend` VALUES (9, 0, '9.79', 1, 4, 0, '11.0', '90.0', 1625037113, '小时工', 15);
INSERT INTO `dd_dividend` VALUES (10, 22, '24.48', 1, 4, 0, '27.5', '90.0', 1625037113, '小时工', 7);
INSERT INTO `dd_dividend` VALUES (11, 22, '14.69', 1, 4, 0, '16.5', '90.0', 1625037113, '小时工', 5);
INSERT INTO `dd_dividend` VALUES (12, 25, '40.05', 1, 4, 1, '45.0', '90.0', 1625037113, '小时工', 4);
COMMIT;

-- ----------------------------
-- Table structure for dd_enterprise_commission
-- ----------------------------
DROP TABLE IF EXISTS `dd_enterprise_commission`;
CREATE TABLE `dd_enterprise_commission` (
  `id` int(32) NOT NULL AUTO_INCREMENT,
  `uid` int(11) DEFAULT '0' COMMENT '员工',
  `fid` int(11) DEFAULT '0' COMMENT '工厂',
  `jid` int(11) DEFAULT '0' COMMENT '职位ID',
  `remark` varchar(255) DEFAULT '',
  `status` int(11) DEFAULT '0' COMMENT '是否审核',
  `signBill` varchar(255) DEFAULT '0' COMMENT '签单价',
  `staffBill` varchar(255) DEFAULT '0' COMMENT '员工单价',
  `teacherBill` varchar(255) DEFAULT '0' COMMENT '老师提成',
  `salesmanBill` varchar(255) DEFAULT '0' COMMENT '业务员提成',
  `primaryBill` varchar(255) DEFAULT '0' COMMENT '初级提成',
  `advancedBill` varchar(255) DEFAULT '0' COMMENT '高级提成',
  `strategicBill` varchar(255) DEFAULT '0' COMMENT '战略提成',
  `dandanBill` varchar(255) DEFAULT '0' COMMENT '蛋蛋分红',
  `hour` varchar(255) DEFAULT NULL COMMENT '工作多少小时',
  `type` int(255) DEFAULT '0' COMMENT '1 小时工 2 同工同酬 3代理招聘',
  `dandanId` int(11) NOT NULL DEFAULT '22',
  `teacherId` int(11) DEFAULT '0',
  `salesmanId` int(11) DEFAULT '0',
  `primaryId` int(11) DEFAULT '0',
  `advancedId` int(11) DEFAULT '0',
  `strategicId` int(11) DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=32 DEFAULT CHARSET=utf8 COMMENT='新 企业佣金';

-- ----------------------------
-- Records of dd_enterprise_commission
-- ----------------------------
BEGIN;
INSERT INTO `dd_enterprise_commission` VALUES (16, 29, 1, 1, '12321', 2, '100.0', '90.0', '1', '1', '45.0', '16.5', '27.5', '11.0', '10', 0, 22, 27, 43, 25, 22, 22);
INSERT INTO `dd_enterprise_commission` VALUES (17, 34, 1, 1, '', 0, '100.0', '90.0', '1', '1', '45.0', '16.5', '27.5', '11.0', '10', 0, 22, 27, 43, 22, 22, 22);
INSERT INTO `dd_enterprise_commission` VALUES (18, 29, 1, 1, 'ok', 1, '100.0', '90.0', '1', '1', '45.0', '16.5', '27.5', '11.0', '10', 0, 22, 27, 43, 25, 22, 22);
INSERT INTO `dd_enterprise_commission` VALUES (19, 34, 1, 1, 'ok', 1, '100.0', '90.0', '1', '1', '45.0', '16.5', '27.5', '11.0', '10', 0, 22, 27, 43, 22, 22, 22);
INSERT INTO `dd_enterprise_commission` VALUES (20, 29, 1, 1, '123123', 1, '100.0', '90.0', '1', '1', '45.0', '16.5', '27.5', '11.0', '10', 0, 22, 27, 43, 25, 22, 22);
INSERT INTO `dd_enterprise_commission` VALUES (21, 29, 1, 1, '', 1, '100.0', '90.0', '1', '1', '45.0', '16.5', '27.5', '11.0', '10', 0, 22, 27, 43, 25, 22, 22);
INSERT INTO `dd_enterprise_commission` VALUES (22, 44, 1, 1, '', 1, '100.0', '90.0', '1', '1', '45.0', '16.5', '27.5', '11.0', '10', 0, 22, 27, 43, 22, 22, 22);
INSERT INTO `dd_enterprise_commission` VALUES (23, 30, 1, 1, '', 1, '100.0', '90.0', '1', '1', '45.0', '16.5', '27.5', '11.0', '10', 0, 22, 27, 43, 22, 22, 22);
INSERT INTO `dd_enterprise_commission` VALUES (24, 47, 1, 5, '', 1, '100.0', '90.0', '1', '1', '45.0', '16.5', '27.5', '11.0', '10', 0, 22, 27, 43, 25, 22, 22);
INSERT INTO `dd_enterprise_commission` VALUES (25, 47, 1, 5, '', 1, '100.0', '90.0', '1', '1', '45.0', '16.5', '27.5', '11.0', '10', 0, 22, 27, 43, 25, 22, 22);
INSERT INTO `dd_enterprise_commission` VALUES (26, 47, 1, 5, '', 0, '100.0', '90.0', '1', '1', '45.0', '16.5', '27.5', '11.0', '10', 0, 22, 27, 43, 25, 22, 22);
INSERT INTO `dd_enterprise_commission` VALUES (27, 48, 1, 4, '', 1, '100.0', '90.0', '1', '1', '45.0', '16.5', '27.5', '11.0', '10', 0, 22, 22, 43, 25, 22, 22);
INSERT INTO `dd_enterprise_commission` VALUES (28, 48, 1, 4, '', 1, '100.0', '90.0', '1', '1', '45.0', '16.5', '27.5', '11.0', '10', 0, 22, 22, 43, 25, 22, 22);
INSERT INTO `dd_enterprise_commission` VALUES (29, 38, 1, 4, '', 1, '100.0', '90.0', '1', '1', '45.0', '16.5', '27.5', '11.0', '10', 0, 22, 22, 43, 25, 22, 22);
INSERT INTO `dd_enterprise_commission` VALUES (30, 34, 1, 1, '', 0, '100.0', '90.0', '1', '1', '45.0', '16.5', '27.5', '11.0', '10', 0, 22, 22, 43, 22, 22, 22);
INSERT INTO `dd_enterprise_commission` VALUES (31, 34, 1, 1, '', 0, '100.0', '90.0', '1', '1', '45.0', '16.5', '27.5', '11.0', '10', 0, 22, 22, 43, 22, 22, 22);
COMMIT;

-- ----------------------------
-- Table structure for dd_event_payslip
-- ----------------------------
DROP TABLE IF EXISTS `dd_event_payslip`;
CREATE TABLE `dd_event_payslip` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '工资条',
  `uid` int(11) NOT NULL COMMENT '接收工资条的用户',
  `pid` int(11) NOT NULL COMMENT '工人的上级,当工人点击确认工资时更新',
  `fid` int(11) NOT NULL COMMENT '工厂ID',
  `jid` int(11) NOT NULL COMMENT '职位ID',
  `sid` int(11) NOT NULL COMMENT '员工所属于的战略联盟ID',
  `type` int(11) NOT NULL COMMENT '工资条类型	1:小时工 2:同工同薪酬 3:代理招聘',
  `create_time` int(11) NOT NULL,
  `update_time` int(11) NOT NULL,
  `t_basic_wages` varchar(45) NOT NULL COMMENT '同工同薪酬-基本薪资',
  `t_day` varchar(45) DEFAULT NULL COMMENT '同工同薪酬-当月标准天数',
  `t_actual_day` varchar(45) DEFAULT NULL COMMENT '同工同薪酬-实际出勤天数',
  `t_base_wages` varchar(45) DEFAULT NULL COMMENT '同工同薪酬-底薪工资',
  `t_p_overtime` varchar(45) DEFAULT NULL COMMENT '同工同薪酬-平时加班工时',
  `t_p_overtime_wages` varchar(45) DEFAULT NULL COMMENT '同工同薪酬-平时加班工资',
  `t_p_weekend_overtime` varchar(45) DEFAULT NULL COMMENT '同工同薪酬-周六.周日加班工时',
  `t_p_weekend_overtime_wages` varchar(45) DEFAULT NULL COMMENT '同工同薪酬-周六.周日加班工资',
  `t_p_holiday_overtime` varchar(45) DEFAULT NULL COMMENT '同工同薪酬-法定假日加班工时',
  `t_p_holiday_overtime_wages` varchar(45) DEFAULT NULL COMMENT '同工同薪酬-法定假日加班工时工资',
  `t_p_other` varchar(45) DEFAULT NULL COMMENT '同工同薪酬-其他',
  `t_d_food_expenses` varchar(45) DEFAULT NULL COMMENT '同工同薪酬-伙食费',
  `t_d_taxes` varchar(45) DEFAULT NULL COMMENT '同工同薪酬-税金',
  `t_d_social_securly` varchar(45) DEFAULT NULL COMMENT '同工同薪酬-社保费',
  `t_d_accumulation_fund` varchar(45) DEFAULT NULL COMMENT '同工同薪酬-公积金',
  `t_d_other` varchar(45) DEFAULT NULL COMMENT '同工同薪酬-其他扣款',
  `x_working_hours` varchar(45) DEFAULT NULL COMMENT '小时工-总工时',
  `x_price` varchar(45) DEFAULT NULL COMMENT '小时工-工价',
  `x_d_other` varchar(45) DEFAULT NULL COMMENT '小时工-其他扣款',
  `p_d_loan` varchar(45) DEFAULT NULL COMMENT '员工-预支费用',
  `x_subsidy` varchar(45) DEFAULT NULL COMMENT '小时工-补助',
  `x_d_insurance` varchar(45) DEFAULT NULL COMMENT '小时工-保险',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='工资条事件\n';

-- ----------------------------
-- Table structure for dd_events
-- ----------------------------
DROP TABLE IF EXISTS `dd_events`;
CREATE TABLE `dd_events` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uid` int(11) NOT NULL COMMENT '申请人',
  `pid` int(11) NOT NULL DEFAULT '0' COMMENT '上级ID',
  `etid` int(11) NOT NULL DEFAULT '0' COMMENT '事件类型ID',
  `fid` int(11) NOT NULL DEFAULT '0',
  `jid` int(11) NOT NULL DEFAULT '0',
  `create_time` int(11) NOT NULL,
  `update_time` int(11) NOT NULL,
  `status` int(11) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=49 DEFAULT CHARSET=utf8 COMMENT='事件表\n';

-- ----------------------------
-- Records of dd_events
-- ----------------------------
BEGIN;
INSERT INTO `dd_events` VALUES (11, 22, 22, 4, 0, 0, 1624473203, 1624473212, 1);
INSERT INTO `dd_events` VALUES (12, 43, 0, 1, 1, 0, 1624476571, 1624476571, 0);
INSERT INTO `dd_events` VALUES (13, 25, 22, 2, 0, 0, 1624477630, 1624477657, 1);
INSERT INTO `dd_events` VALUES (14, 24, 22, 2, 0, 0, 1624477736, 1624477754, 1);
INSERT INTO `dd_events` VALUES (15, 24, 22, 3, 0, 0, 1624477774, 1624477797, 1);
INSERT INTO `dd_events` VALUES (16, 26, 22, 2, 0, 0, 1624477894, 1624477920, 1);
INSERT INTO `dd_events` VALUES (17, 33, 26, 2, 0, 0, 1624478013, 1624478036, 1);
INSERT INTO `dd_events` VALUES (18, 29, 25, 6, 1, 1, 1624478290, 1624478372, 1);
INSERT INTO `dd_events` VALUES (19, 23, 22, 2, 0, 0, 1624494492, 1624494520, 1);
INSERT INTO `dd_events` VALUES (20, 23, 22, 3, 0, 0, 1624494562, 1624494575, 1);
INSERT INTO `dd_events` VALUES (21, 23, 22, 4, 0, 0, 1624494656, 1624494676, 1);
INSERT INTO `dd_events` VALUES (22, 43, 0, 1, 2, 0, 1624495617, 1624495617, 0);
INSERT INTO `dd_events` VALUES (23, 43, 0, 1, 3, 0, 1624495846, 1624495846, 0);
INSERT INTO `dd_events` VALUES (24, 34, 22, 6, 1, 1, 1624496806, 1624496905, 1);
INSERT INTO `dd_events` VALUES (25, 44, 22, 6, 1, 1, 1624523995, 1624524027, 1);
INSERT INTO `dd_events` VALUES (26, 30, 22, 6, 1, 1, 1624821317, 1624835733, 1);
INSERT INTO `dd_events` VALUES (27, 39, 22, 6, 1, 1, 1624821395, 1624821395, 0);
INSERT INTO `dd_events` VALUES (28, 35, 22, 5, 0, 0, 1624854830, 1624854830, 0);
INSERT INTO `dd_events` VALUES (29, 29, 25, 6, 2, 2, 1624932523, 1624932621, 1);
INSERT INTO `dd_events` VALUES (30, 34, 22, 6, 1, 1, 1624951014, 1624951014, 0);
INSERT INTO `dd_events` VALUES (31, 47, 25, 6, 1, 5, 1625008519, 1625008601, 1);
INSERT INTO `dd_events` VALUES (32, 48, 25, 6, 1, 4, 1625017923, 1625023311, 1);
INSERT INTO `dd_events` VALUES (33, 48, 25, 2, 0, 0, 1625018777, 1625025814, 1);
INSERT INTO `dd_events` VALUES (34, 48, 25, 5, 0, 0, 1625018820, 1625025779, 1);
INSERT INTO `dd_events` VALUES (35, 25, 22, 6, 3, 3, 1625019552, 1625019552, 0);
INSERT INTO `dd_events` VALUES (36, 22, 0, 1, 4, 0, 1625021058, 1625021058, 0);
INSERT INTO `dd_events` VALUES (37, 48, 25, 3, 0, 0, 1625025850, 1625025869, 1);
INSERT INTO `dd_events` VALUES (38, 42, 42, 4, 0, 0, 1625026491, 1625026505, 1);
INSERT INTO `dd_events` VALUES (39, 37, 25, 6, 1, 4, 1625035161, 1625035280, 1);
INSERT INTO `dd_events` VALUES (40, 38, 25, 6, 1, 1, 1625035942, 1625036113, 1);
INSERT INTO `dd_events` VALUES (41, 38, 25, 6, 1, 4, 1625036448, 1625036498, 1);
INSERT INTO `dd_events` VALUES (42, 49, 25, 2, 0, 0, 1625040634, 1625040685, 1);
INSERT INTO `dd_events` VALUES (43, 50, 49, 2, 0, 0, 1625040900, 1625040922, 1);
INSERT INTO `dd_events` VALUES (44, 51, 50, 2, 0, 0, 1625041376, 1625041408, 1);
INSERT INTO `dd_events` VALUES (45, 51, 50, 3, 0, 0, 1625041444, 1625041457, 1);
INSERT INTO `dd_events` VALUES (46, 51, 50, 6, 1, 4, 1625041521, 1625041613, 1);
INSERT INTO `dd_events` VALUES (47, 50, 49, 6, 1, 1, 1625041905, 1625041978, 1);
INSERT INTO `dd_events` VALUES (48, 52, 49, 6, 1, 1, 1625042210, 1625042295, 1);
COMMIT;

-- ----------------------------
-- Table structure for dd_events_logs
-- ----------------------------
DROP TABLE IF EXISTS `dd_events_logs`;
CREATE TABLE `dd_events_logs` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '审核角色',
  `eid` int(11) NOT NULL,
  `rid` int(11) NOT NULL DEFAULT '0' COMMENT '审核者的角色类型ID',
  `uid` int(11) NOT NULL DEFAULT '0' COMMENT '审核员ID',
  `status` tinyint(4) NOT NULL DEFAULT '0',
  `remark` varchar(128) NOT NULL DEFAULT '暂无',
  `create_time` int(11) NOT NULL,
  `update_time` int(11) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=75 DEFAULT CHARSET=utf8 COMMENT='事件日志\n';

-- ----------------------------
-- Records of dd_events_logs
-- ----------------------------
BEGIN;
INSERT INTO `dd_events_logs` VALUES (13, 11, 1, 22, 1, '备注', 1624473212, 1624473212);
INSERT INTO `dd_events_logs` VALUES (14, 12, 8, 43, 1, '财务通过', 1624477087, 1624477087);
INSERT INTO `dd_events_logs` VALUES (15, 13, 100, 43, 1, '人事同意', 1624477657, 1624477657);
INSERT INTO `dd_events_logs` VALUES (16, 14, 100, 43, 1, '人事通过', 1624477754, 1624477754);
INSERT INTO `dd_events_logs` VALUES (17, 15, 100, 43, 1, '人事通过', 1624477797, 1624477797);
INSERT INTO `dd_events_logs` VALUES (18, 16, 100, 43, 1, '人事通过', 1624477920, 1624477920);
INSERT INTO `dd_events_logs` VALUES (19, 17, 100, 43, 1, '绑定准高级合伙人', 1624478036, 1624478036);
INSERT INTO `dd_events_logs` VALUES (20, 18, 4, 25, 1, '初级已同意', 1624478337, 1624478337);
INSERT INTO `dd_events_logs` VALUES (21, 18, 12, 43, 1, '人事已同意', 1624478372, 1624478372);
INSERT INTO `dd_events_logs` VALUES (22, 18, 8, 27, 1, '驻场同意', 1624478445, 1624478445);
INSERT INTO `dd_events_logs` VALUES (23, 19, 100, 43, 1, '人事通过', 1624494520, 1624494520);
INSERT INTO `dd_events_logs` VALUES (24, 20, 100, 43, 1, '人事同意', 1624494575, 1624494575);
INSERT INTO `dd_events_logs` VALUES (25, 21, 100, 43, 1, '财务通过', 1624494676, 1624494676);
INSERT INTO `dd_events_logs` VALUES (26, 22, 8, 43, 1, '财务同意', 1624495864, 1624495864);
INSERT INTO `dd_events_logs` VALUES (27, 23, 8, 43, 1, '财务同意', 1624495868, 1624495868);
INSERT INTO `dd_events_logs` VALUES (28, 24, 4, 22, 1, '刚刚疼痛', 1624496888, 1624496888);
INSERT INTO `dd_events_logs` VALUES (29, 24, 12, 43, 1, '人事通过', 1624496905, 1624496905);
INSERT INTO `dd_events_logs` VALUES (30, 24, 8, 27, 1, '驻场通过', 1624496927, 1624496927);
INSERT INTO `dd_events_logs` VALUES (31, 25, 4, 22, 1, '同意', 1624524013, 1624524013);
INSERT INTO `dd_events_logs` VALUES (32, 25, 12, 43, 1, '123123', 1624524027, 1624524027);
INSERT INTO `dd_events_logs` VALUES (33, 25, 8, 27, 1, '同意', 1624524068, 1624524068);
INSERT INTO `dd_events_logs` VALUES (34, 27, 8, 22, 1, '同意', 1624821455, 1624821455);
INSERT INTO `dd_events_logs` VALUES (35, 26, 4, 22, 1, '同意', 1624835711, 1624835711);
INSERT INTO `dd_events_logs` VALUES (36, 26, 12, 43, 1, 'ok', 1624835733, 1624835733);
INSERT INTO `dd_events_logs` VALUES (37, 26, 8, 22, 1, '确认', 1624835753, 1624835753);
INSERT INTO `dd_events_logs` VALUES (38, 29, 4, 25, 1, '同意', 1624932605, 1624932605);
INSERT INTO `dd_events_logs` VALUES (39, 29, 12, 43, 1, '同意', 1624932621, 1624932621);
INSERT INTO `dd_events_logs` VALUES (40, 29, 8, 27, 1, '同意', 1624932671, 1624932671);
INSERT INTO `dd_events_logs` VALUES (41, 30, 8, 22, 1, '同意', 1624951125, 1624951125);
INSERT INTO `dd_events_logs` VALUES (42, 31, 4, 25, 1, 'ok', 1625008585, 1625008585);
INSERT INTO `dd_events_logs` VALUES (43, 31, 12, 43, 1, 'ok', 1625008601, 1625008601);
INSERT INTO `dd_events_logs` VALUES (44, 31, 8, 27, 1, '哦看', 1625008657, 1625008657);
INSERT INTO `dd_events_logs` VALUES (45, 32, 4, 25, 1, '同意', 1625017988, 1625017988);
INSERT INTO `dd_events_logs` VALUES (46, 32, 12, 22, 1, 'ok', 1625023311, 1625023311);
INSERT INTO `dd_events_logs` VALUES (47, 32, 8, 27, 1, '同意', 1625023575, 1625023575);
INSERT INTO `dd_events_logs` VALUES (48, 34, 100, 22, 1, 'ok', 1625025779, 1625025779);
INSERT INTO `dd_events_logs` VALUES (49, 33, 100, 22, 1, 'ok', 1625025814, 1625025814);
INSERT INTO `dd_events_logs` VALUES (50, 37, 100, 22, 1, 'ok', 1625025869, 1625025869);
INSERT INTO `dd_events_logs` VALUES (51, 38, 100, 22, 1, 'ok', 1625026505, 1625026505);
INSERT INTO `dd_events_logs` VALUES (52, 36, 8, 22, 1, '123123', 1625027131, 1625027131);
INSERT INTO `dd_events_logs` VALUES (53, 39, 4, 25, 1, '同意', 1625035263, 1625035263);
INSERT INTO `dd_events_logs` VALUES (54, 39, 12, 22, 1, 'ok', 1625035280, 1625035280);
INSERT INTO `dd_events_logs` VALUES (55, 39, 8, 27, 1, '同意', 1625035323, 1625035323);
INSERT INTO `dd_events_logs` VALUES (56, 40, 4, 25, 1, '同意', 1625036065, 1625036065);
INSERT INTO `dd_events_logs` VALUES (57, 40, 12, 22, 1, 'ok', 1625036113, 1625036113);
INSERT INTO `dd_events_logs` VALUES (58, 40, 8, 27, 1, '同意', 1625036188, 1625036188);
INSERT INTO `dd_events_logs` VALUES (59, 41, 4, 25, 1, '这么多年我', 1625036487, 1625036487);
INSERT INTO `dd_events_logs` VALUES (60, 41, 12, 22, 1, 'ok', 1625036498, 1625036498);
INSERT INTO `dd_events_logs` VALUES (61, 41, 8, 27, 1, '中央军委', 1625036534, 1625036534);
INSERT INTO `dd_events_logs` VALUES (62, 42, 100, 43, 1, 'ok', 1625040685, 1625040685);
INSERT INTO `dd_events_logs` VALUES (63, 43, 100, 43, 1, 'ok', 1625040922, 1625040922);
INSERT INTO `dd_events_logs` VALUES (64, 44, 100, 43, 1, 'ok', 1625041408, 1625041408);
INSERT INTO `dd_events_logs` VALUES (65, 45, 100, 43, 1, 'ok', 1625041457, 1625041457);
INSERT INTO `dd_events_logs` VALUES (66, 46, 4, 50, 1, '123', 1625041538, 1625041538);
INSERT INTO `dd_events_logs` VALUES (67, 46, 12, 43, 1, '123123', 1625041613, 1625041613);
INSERT INTO `dd_events_logs` VALUES (68, 46, 8, 27, 1, '123213', 1625041628, 1625041628);
INSERT INTO `dd_events_logs` VALUES (69, 47, 4, 49, 1, '223', 1625041965, 1625041965);
INSERT INTO `dd_events_logs` VALUES (70, 47, 12, 43, 1, '123123', 1625041978, 1625041978);
INSERT INTO `dd_events_logs` VALUES (71, 47, 8, 27, 1, '555', 1625042021, 1625042021);
INSERT INTO `dd_events_logs` VALUES (72, 48, 4, 49, 1, '525', 1625042237, 1625042237);
INSERT INTO `dd_events_logs` VALUES (73, 48, 12, 43, 1, 'ok', 1625042295, 1625042295);
INSERT INTO `dd_events_logs` VALUES (74, 48, 8, 27, 1, '255', 1625042312, 1625042312);
COMMIT;

-- ----------------------------
-- Table structure for dd_events_pay_slip
-- ----------------------------
DROP TABLE IF EXISTS `dd_events_pay_slip`;
CREATE TABLE `dd_events_pay_slip` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `pwdid` varchar(45) NOT NULL DEFAULT '0' COMMENT '工资条详情ID',
  `type` varchar(45) NOT NULL DEFAULT '0' COMMENT '小时工\n同工同酬\n代理招聘',
  `tuid` varchar(45) NOT NULL DEFAULT '0' COMMENT '驻场老师id',
  `uid` varchar(45) NOT NULL DEFAULT '0' COMMENT '员工id',
  `pid` varchar(45) NOT NULL DEFAULT '0' COMMENT '员工的上级id',
  `sid` varchar(45) NOT NULL DEFAULT '0' COMMENT '员工上级的战略公司ID',
  `fid` varchar(45) NOT NULL DEFAULT '0' COMMENT '工厂ID',
  `jid` varchar(45) NOT NULL DEFAULT '0' COMMENT '职位ID',
  `status` int(11) NOT NULL DEFAULT '0' COMMENT '员工是否确认',
  `create_time` int(11) NOT NULL,
  `isWithdraw` int(11) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8 COMMENT='工资条事件\n';

-- ----------------------------
-- Records of dd_events_pay_slip
-- ----------------------------
BEGIN;
INSERT INTO `dd_events_pay_slip` VALUES (1, '1', '小时工工资条', '43', '29', '25', '4', '1', '1', 1, 1624504515, 1);
INSERT INTO `dd_events_pay_slip` VALUES (2, '2', '小时工工资条', '43', '34', '22', '4', '1', '1', 1, 1624504604, 0);
INSERT INTO `dd_events_pay_slip` VALUES (3, '3', '小时工工资条', '43', '29', '25', '4', '1', '1', 1, 1624519226, 1);
INSERT INTO `dd_events_pay_slip` VALUES (4, '4', '小时工工资条', '43', '30', '22', '4', '1', '1', 1, 1624835829, 0);
INSERT INTO `dd_events_pay_slip` VALUES (5, '5', '小时工工资条', '43', '47', '25', '4', '1', '5', 1, 1625008865, 0);
INSERT INTO `dd_events_pay_slip` VALUES (6, '6', '小时工工资条', '43', '48', '25', '4', '1', '4', 1, 1625024674, 1);
INSERT INTO `dd_events_pay_slip` VALUES (7, '7', '小时工工资条', '43', '38', '25', '4', '1', '4', 1, 1625036956, 0);
COMMIT;

-- ----------------------------
-- Table structure for dd_events_pay_slip_agent
-- ----------------------------
DROP TABLE IF EXISTS `dd_events_pay_slip_agent`;
CREATE TABLE `dd_events_pay_slip_agent` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `sign_unit_price` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '签单价',
  `taxes` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '税费',
  `salesperson_commission` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '业务员提成',
  `resident_teacher_commission` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '驻场老师提成',
  `management_fee` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '管理费',
  `primary_dividend` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '初级分红',
  `advanced_dividend` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '高级分红',
  `strategic_dividend` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '战略分红',
  `dividend` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '蛋蛋分红',
  `uid` int(11) NOT NULL DEFAULT '0' COMMENT '员工ID',
  `status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '财务是否审核',
  `settlement_method` varchar(45) NOT NULL COMMENT '结算方式',
  `create_time` int(11) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='代理招聘工资条详情\n';

-- ----------------------------
-- Table structure for dd_events_pay_slip_epfew
-- ----------------------------
DROP TABLE IF EXISTS `dd_events_pay_slip_epfew`;
CREATE TABLE `dd_events_pay_slip_epfew` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '同工同酬ID',
  `sign_unit_price` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '签单价',
  `loan` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '借款',
  `other_additions` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '其他加项',
  `other_additions_remarks` varchar(45) NOT NULL DEFAULT '' COMMENT '其他加项（备注）',
  `other_deductions` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '其他扣款',
  `other_deductions_remarks` varchar(45) NOT NULL DEFAULT '' COMMENT '其他扣款（备注）',
  `employee_unit_price` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '员工单价',
  `salesperson_commission` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '业务员提成',
  `resident_teacher_commission` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '驻场老师提成',
  `overtime_work` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '平时加班工时',
  `overtime_pay` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '平时加班工资',
  `overtime_work_on_weekends` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '周末加班工时',
  `eeekend_overtime_pay` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '周末加班工资',
  `working_overtime_on_holidays` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '法定节假日加班工时',
  `overtime_pay_on_holidays` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '法定节假日加班工资',
  `food_expenses` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '伙食费',
  `taxes` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '税费',
  `social_security_charges` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '社保费',
  `provident_fund` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '公积金',
  `standard_days_of_the_month` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '当月标准天数',
  `actual_attendance_days` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '实际出勤天数',
  `withholding_payments` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '代扣代缴款项',
  `primary_dividend` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '初级分红',
  `advanced_dividend` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '高级分红',
  `strategic_dividend` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '战略分红',
  `dividend` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '蛋蛋分红',
  `uid` int(11) NOT NULL DEFAULT '0',
  `status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '财务是否审核',
  `settlement_method` varchar(45) NOT NULL DEFAULT '' COMMENT '结算方式',
  `management_fee` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '管理费',
  `actual_salary` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '实发工资',
  `create_time` int(11) NOT NULL,
  `update_time` int(11) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='同工同酬工资条详情\n';

-- ----------------------------
-- Table structure for dd_events_pay_slip_hourly_worker
-- ----------------------------
DROP TABLE IF EXISTS `dd_events_pay_slip_hourly_worker`;
CREATE TABLE `dd_events_pay_slip_hourly_worker` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `sign_unit_price` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '签单价',
  `insurance` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '保险费',
  `taxes` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '税费',
  `loan` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '借款',
  `other_deductions` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '其他扣款',
  `other_deductions_remarks` varchar(45) NOT NULL COMMENT '其他减项备注',
  `other_additions` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '其他加项',
  `other_additions_remarks` varchar(45) NOT NULL COMMENT '其他加项备注',
  `employee_unit_price` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '员工单价',
  `total_working_hours` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '总工时',
  `salesperson_commission` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '业务员提成',
  `resident_teacher_commission` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '驻场老师提成',
  `primary_dividend` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '初级分红',
  `advanced_dividend` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '高级分红',
  `strategic_dividend` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '战略分红',
  `dividend` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '蛋蛋分红',
  `settlement_method` varchar(45) NOT NULL COMMENT '结算方式',
  `management_fee` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '管理费',
  `status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '财务是否审核',
  `uid` int(11) NOT NULL DEFAULT '0' COMMENT '员工ID',
  `create_time` int(11) NOT NULL,
  `actual_salary` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '实发工资',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8 COMMENT='小时工工资详情\n';

-- ----------------------------
-- Records of dd_events_pay_slip_hourly_worker
-- ----------------------------
BEGIN;
INSERT INTO `dd_events_pay_slip_hourly_worker` VALUES (1, '100.0', '0.0', '0.0', '0.0', '0.0', '暂无', '0.0', '暂无', '90.0', '0.0', '1.0', '1.0', '108.00', '39.60', '66.00', '26.40', '', '0.0', 1, 29, 1624504515, '2700.0');
INSERT INTO `dd_events_pay_slip_hourly_worker` VALUES (2, '100.0', '200.0', '100.0', '0.0', '50.0', '暂无', '0.0', '暂无', '90.0', '0.0', '1.0', '1.0', '184.50', '67.65', '112.75', '45.10', '', '0.0', 1, 34, 1624504604, '1450.0');
INSERT INTO `dd_events_pay_slip_hourly_worker` VALUES (3, '100.0', '0.0', '0.0', '0.0', '0.0', '暂无', '0.0', '暂无', '90.0', '0.0', '1.0', '1.0', '180.00', '66.00', '110.00', '44.00', '', '0.0', 1, 29, 1624519226, '4500.0');
INSERT INTO `dd_events_pay_slip_hourly_worker` VALUES (4, '100.0', '0.0', '0.0', '0.0', '0.0', '暂无', '0.0', '暂无', '90.0', '10.0', '1.0', '1.0', '36.00', '13.20', '22.00', '8.80', '', '0.0', 1, 30, 1624835829, '900.0');
INSERT INTO `dd_events_pay_slip_hourly_worker` VALUES (5, '100.0', '0.0', '0.0', '0.0', '0.0', '暂无', '0.0', '暂无', '90.0', '20.0', '1.0', '1.0', '72.00', '26.40', '44.00', '17.60', '', '0.0', 1, 47, 1625008865, '1800.0');
INSERT INTO `dd_events_pay_slip_hourly_worker` VALUES (6, '100.0', '0.0', '0.0', '0.0', '0.0', '暂无', '0.0', '暂无', '90.0', '10.0', '1.0', '1.0', '36.00', '13.20', '22.00', '8.80', '', '0.0', 1, 48, 1625024674, '900.0');
INSERT INTO `dd_events_pay_slip_hourly_worker` VALUES (7, '100.0', '10.0', '3.0', '0.0', '100.0', '暂无', '100.0', '暂无', '90.0', '10.0', '1.0', '1.0', '40.05', '14.69', '24.48', '9.79', '', '10.0', 1, 38, 1625036956, '887.0');
COMMIT;

-- ----------------------------
-- Table structure for dd_events_staff
-- ----------------------------
DROP TABLE IF EXISTS `dd_events_staff`;
CREATE TABLE `dd_events_staff` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '员工事件(工作流)\n请假\n报销\n离职\n打卡',
  `uid` int(11) NOT NULL DEFAULT '0',
  `fid` int(11) NOT NULL DEFAULT '0' COMMENT '工厂ID',
  `jid` int(11) NOT NULL DEFAULT '0' COMMENT '职位ID',
  `pid` int(11) NOT NULL DEFAULT '0' COMMENT '上级ID',
  `etid` int(11) NOT NULL DEFAULT '0' COMMENT '事件类型ID',
  `start_time` varchar(32) DEFAULT NULL,
  `end_time` varchar(32) DEFAULT NULL,
  `remark` varchar(128) NOT NULL DEFAULT '',
  `cost` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '报销、预支金额',
  `images` varchar(1024) DEFAULT NULL,
  `create_time` int(11) DEFAULT NULL,
  `update_time` int(11) DEFAULT NULL,
  `hour` varchar(10) NOT NULL DEFAULT '0.0' COMMENT '打卡小时数',
  `status` tinyint(10) NOT NULL DEFAULT '0' COMMENT '是否有效果 0待审核 1驻场审核 2人事审核 10驳回',
  `total` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '预支时的总金额',
  `xstatus` int(255) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=40 DEFAULT CHARSET=utf8 COMMENT='员工事件表';

-- ----------------------------
-- Records of dd_events_staff
-- ----------------------------
BEGIN;
INSERT INTO `dd_events_staff` VALUES (2, 29, 1, 1, 25, 11, NULL, NULL, '', '0.0', NULL, 1624481480, 1624508245, '10', 1, '0.0', 1);
INSERT INTO `dd_events_staff` VALUES (4, 29, 1, 1, 25, 11, NULL, NULL, '', '0.0', NULL, 1624491691, 1624508245, '10', 1, '0.0', 1);
INSERT INTO `dd_events_staff` VALUES (5, 34, 1, 1, 22, 11, NULL, NULL, '', '0.0', NULL, 1624496950, 1624520999, '10', 1, '0.0', 1);
INSERT INTO `dd_events_staff` VALUES (6, 29, 1, 1, 25, 11, NULL, NULL, '', '0.0', NULL, 1624497535, 1624508245, '10', 1, '0.0', 1);
INSERT INTO `dd_events_staff` VALUES (7, 34, 1, 1, 22, 11, NULL, NULL, '', '0.0', NULL, 1624497563, 1624520999, '10', 1, '0.0', 1);
INSERT INTO `dd_events_staff` VALUES (9, 29, 1, 1, 25, 11, NULL, NULL, '', '0.0', NULL, 1624504960, 1624508245, '10', 1, '0.0', 1);
INSERT INTO `dd_events_staff` VALUES (16, 29, 1, 1, 25, 11, NULL, NULL, '', '0.0', NULL, 1624519093, 1624519178, '10', 1, '0.0', 0);
INSERT INTO `dd_events_staff` VALUES (17, 29, 1, 1, 25, 7, '2021/06/24 15:24', '2021/06/24 18:00', '事假', '0.0', NULL, 1624519515, 1624519515, '8', 0, '0.0', 0);
INSERT INTO `dd_events_staff` VALUES (18, 29, 1, 1, 25, 8, NULL, NULL, '出差报销', '60', '[\"\\/uploads\\/images\\/11\\/5dfa1877f961817a8c836741894642.jpg\"]', 1624519662, 1624519662, '0.0', 0, '0.0', 0);
INSERT INTO `dd_events_staff` VALUES (19, 29, 1, 1, 25, 10, NULL, '2021/06/24', '自离', '0.0', NULL, 1624519697, 1624519697, '0.0', 0, '0.0', 0);
INSERT INTO `dd_events_staff` VALUES (21, 44, 1, 1, 22, 11, NULL, NULL, '', '0.0', NULL, 1624524241, 1624524241, '10', 0, '0.0', 0);
INSERT INTO `dd_events_staff` VALUES (22, 30, 1, 1, 22, 11, NULL, NULL, '', '0.0', NULL, 1624835777, 1624835812, '10', 1, '0.0', 0);
INSERT INTO `dd_events_staff` VALUES (23, 29, 2, 2, 25, 10, NULL, '2021/06/29', '不干了', '0.0', NULL, 1624932734, 1624932734, '0.0', 0, '0.0', 0);
INSERT INTO `dd_events_staff` VALUES (24, 34, 1, 1, 22, 10, NULL, '2021/06/29', '离职', '0.0', NULL, 1624936458, 1624936458, '0.0', 0, '0.0', 0);
INSERT INTO `dd_events_staff` VALUES (25, 47, 1, 5, 25, 11, NULL, NULL, '', '0.0', NULL, 1625008677, 1625008723, '10', 1, '0.0', 0);
INSERT INTO `dd_events_staff` VALUES (26, 47, 1, 5, 25, 11, NULL, NULL, '', '0.0', NULL, 1625008753, 1625008765, '10', 1, '0.0', 0);
INSERT INTO `dd_events_staff` VALUES (27, 47, 1, 5, 25, 11, NULL, NULL, '', '0.0', NULL, 1625009557, 1625009604, '10', 1, '0.0', 0);
INSERT INTO `dd_events_staff` VALUES (28, 48, 1, 4, 25, 11, NULL, NULL, '', '0.0', NULL, 1625023794, 1625025013, '10', 1, '0.0', 1);
INSERT INTO `dd_events_staff` VALUES (29, 48, 1, 4, 25, 8, NULL, NULL, '打车费', '200', '[\"\\/uploads\\/images\\/96\\/fecc57defdc8a51050b6ce220bb97a.jpg\"]', 1625024029, 1625025412, '0.0', 1, '0.0', 0);
INSERT INTO `dd_events_staff` VALUES (30, 48, 1, 4, 25, 7, '2021/06/30 14:00', '2021/07/01 04:00', '请假', '0.0', NULL, 1625024078, 1625024078, '8', 0, '0.0', 0);
INSERT INTO `dd_events_staff` VALUES (31, 48, 1, 4, 25, 10, NULL, '2021/06/30', '离职', '0.0', NULL, 1625024107, 1625024107, '0.0', 0, '0.0', 0);
INSERT INTO `dd_events_staff` VALUES (32, 48, 1, 4, 25, 11, NULL, NULL, '', '0.0', NULL, 1625024759, 1625025013, '10', 1, '0.0', 1);
INSERT INTO `dd_events_staff` VALUES (33, 48, 1, 4, 25, 12, NULL, NULL, '', '900', NULL, 1625024866, 1625025013, '0.0', 1, '0.0', 0);
INSERT INTO `dd_events_staff` VALUES (34, 37, 1, 4, 25, 10, NULL, '2021/06/30', '这么', '0.0', NULL, 1625035345, 1625035345, '0.0', 0, '0.0', 0);
INSERT INTO `dd_events_staff` VALUES (35, 38, 1, 1, 25, 10, NULL, '2021/06/30', '吧台风来了', '0.0', NULL, 1625036249, 1625036249, '0.0', 0, '0.0', 0);
INSERT INTO `dd_events_staff` VALUES (36, 38, 1, 4, 25, 11, NULL, NULL, '', '0.0', NULL, 1625036558, 1625036589, '10', 1, '0.0', 0);
INSERT INTO `dd_events_staff` VALUES (37, 38, 1, 4, 25, 12, NULL, NULL, '', '450', NULL, 1625036610, 1625036610, '0.0', 0, '0.0', 0);
INSERT INTO `dd_events_staff` VALUES (38, 34, 1, 1, 22, 11, NULL, NULL, '', '0.0', NULL, 1625042538, 1625042538, '10', 0, '0.0', 0);
INSERT INTO `dd_events_staff` VALUES (39, 34, 1, 1, 22, 11, NULL, NULL, '', '0.0', NULL, 1625042657, 1625042657, '10', 0, '0.0', 0);
COMMIT;

-- ----------------------------
-- Table structure for dd_events_staff_logs
-- ----------------------------
DROP TABLE IF EXISTS `dd_events_staff_logs`;
CREATE TABLE `dd_events_staff_logs` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `eid` int(11) NOT NULL COMMENT '对应dd_events_staff事件ID',
  `uid` varchar(45) NOT NULL COMMENT '审核用户ID',
  `status` tinyint(4) NOT NULL,
  `remark` varchar(45) NOT NULL,
  `create_time` int(11) NOT NULL,
  `update_time` int(11) NOT NULL,
  `rid` int(11) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=51 DEFAULT CHARSET=utf8 COMMENT='员工事件日志';

-- ----------------------------
-- Records of dd_events_staff_logs
-- ----------------------------
BEGIN;
INSERT INTO `dd_events_staff_logs` VALUES (1, 1, '5', 1, 'ok', 1624471772, 1624471772, 8);
INSERT INTO `dd_events_staff_logs` VALUES (2, 2, '27', 1, '同意', 1624481557, 1624481557, 8);
INSERT INTO `dd_events_staff_logs` VALUES (3, 7, '27', 1, '然而', 1624503854, 1624503854, 8);
INSERT INTO `dd_events_staff_logs` VALUES (4, 6, '27', 1, '我外国', 1624503864, 1624503864, 8);
INSERT INTO `dd_events_staff_logs` VALUES (5, 5, '27', 1, '是方法论', 1624503873, 1624503873, 8);
INSERT INTO `dd_events_staff_logs` VALUES (6, 4, '27', 1, '二是', 1624503883, 1624503883, 8);
INSERT INTO `dd_events_staff_logs` VALUES (7, 8, '43', 2, '不通过', 1624504933, 1624504933, 13);
INSERT INTO `dd_events_staff_logs` VALUES (8, 9, '27', 1, '二人', 1624504982, 1624504982, 8);
INSERT INTO `dd_events_staff_logs` VALUES (9, 10, '43', 2, 'jkl', 1624505017, 1624505017, 13);
INSERT INTO `dd_events_staff_logs` VALUES (10, 11, '43', 1, '通过', 1624507254, 1624507254, 13);
INSERT INTO `dd_events_staff_logs` VALUES (12, 13, '43', 1, 'jfkdl', 1624507472, 1624507472, 13);
INSERT INTO `dd_events_staff_logs` VALUES (13, 14, '43', 1, '123', 1624507948, 1624507948, 13);
INSERT INTO `dd_events_staff_logs` VALUES (14, 15, '43', 1, '123', 1624508245, 1624508245, 13);
INSERT INTO `dd_events_staff_logs` VALUES (15, 16, '27', 1, '123213', 1624519178, 1624519178, 8);
INSERT INTO `dd_events_staff_logs` VALUES (16, 17, '27', 1, 'ok', 1624519563, 1624519563, 8);
INSERT INTO `dd_events_staff_logs` VALUES (17, 17, '43', 1, 'ok', 1624519598, 1624519598, 12);
INSERT INTO `dd_events_staff_logs` VALUES (18, 19, '27', 1, '哦看', 1624519733, 1624519733, 8);
INSERT INTO `dd_events_staff_logs` VALUES (19, 19, '43', 1, 'ok', 1624519764, 1624519764, 12);
INSERT INTO `dd_events_staff_logs` VALUES (20, 20, '43', 1, 'ok', 1624520999, 1624520999, 13);
INSERT INTO `dd_events_staff_logs` VALUES (21, 22, '22', 1, '确认', 1624835812, 1624835812, 8);
INSERT INTO `dd_events_staff_logs` VALUES (22, 23, '27', 1, '同意', 1624932793, 1624932793, 8);
INSERT INTO `dd_events_staff_logs` VALUES (23, 23, '43', 1, '同意', 1624932818, 1624932818, 12);
INSERT INTO `dd_events_staff_logs` VALUES (24, 23, '27', 1, '同', 1624933650, 1624933650, 8);
INSERT INTO `dd_events_staff_logs` VALUES (25, 23, '43', 2, '同意', 1624933672, 1624933672, 12);
INSERT INTO `dd_events_staff_logs` VALUES (26, 23, '43', 1, '123', 1624934439, 1624934439, 12);
INSERT INTO `dd_events_staff_logs` VALUES (27, 19, '43', 1, '123', 1624935192, 1624935192, 12);
INSERT INTO `dd_events_staff_logs` VALUES (28, 23, '43', 1, '123', 1624935200, 1624935200, 12);
INSERT INTO `dd_events_staff_logs` VALUES (29, 23, '43', 1, '123123', 1624936062, 1624936062, 12);
INSERT INTO `dd_events_staff_logs` VALUES (30, 24, '27', 1, '离职', 1624936965, 1624936965, 8);
INSERT INTO `dd_events_staff_logs` VALUES (31, 24, '43', 1, '123123', 1624937033, 1624937033, 12);
INSERT INTO `dd_events_staff_logs` VALUES (32, 25, '27', 1, '哦看\n', 1625008723, 1625008723, 8);
INSERT INTO `dd_events_staff_logs` VALUES (33, 26, '27', 1, '哦哦', 1625008765, 1625008765, 8);
INSERT INTO `dd_events_staff_logs` VALUES (34, 27, '27', 1, '噢噢', 1625009604, 1625009604, 8);
INSERT INTO `dd_events_staff_logs` VALUES (35, 30, '27', 1, '同意', 1625024303, 1625024303, 8);
INSERT INTO `dd_events_staff_logs` VALUES (36, 29, '27', 1, '同意', 1625024323, 1625024323, 8);
INSERT INTO `dd_events_staff_logs` VALUES (37, 28, '27', 1, '同意', 1625024421, 1625024421, 8);
INSERT INTO `dd_events_staff_logs` VALUES (38, 32, '27', 1, '同意', 1625024773, 1625024773, 8);
INSERT INTO `dd_events_staff_logs` VALUES (39, 33, '22', 1, '同意', 1625025013, 1625025013, 13);
INSERT INTO `dd_events_staff_logs` VALUES (40, 30, '22', 1, 'ok', 1625025280, 1625025280, 12);
INSERT INTO `dd_events_staff_logs` VALUES (41, 29, '22', 1, 'ok', 1625025362, 1625025362, 12);
INSERT INTO `dd_events_staff_logs` VALUES (42, 29, '22', 1, 'ok', 1625025412, 1625025412, 13);
INSERT INTO `dd_events_staff_logs` VALUES (43, 29, '22', 1, '23123', 1625025567, 1625025567, 13);
INSERT INTO `dd_events_staff_logs` VALUES (44, 31, '27', 1, '确认', 1625035365, 1625035365, 8);
INSERT INTO `dd_events_staff_logs` VALUES (45, 34, '22', 1, '123123', 1625035376, 1625035376, 12);
INSERT INTO `dd_events_staff_logs` VALUES (46, 35, '27', 1, '时候我还', 1625036294, 1625036294, 8);
INSERT INTO `dd_events_staff_logs` VALUES (47, 35, '22', 1, 'ok', 1625036325, 1625036325, 12);
INSERT INTO `dd_events_staff_logs` VALUES (48, 36, '27', 1, '这种事情', 1625036589, 1625036589, 8);
INSERT INTO `dd_events_staff_logs` VALUES (49, 37, '22', 2, '123', 1625036670, 1625036670, 13);
INSERT INTO `dd_events_staff_logs` VALUES (50, 37, '22', 2, '789', 1625036731, 1625036731, 13);
COMMIT;

-- ----------------------------
-- Table structure for dd_events_type
-- ----------------------------
DROP TABLE IF EXISTS `dd_events_type`;
CREATE TABLE `dd_events_type` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(45) NOT NULL COMMENT '事件名称',
  `name` varchar(45) NOT NULL COMMENT '事件名称',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8 COMMENT='事件类型列表';

-- ----------------------------
-- Records of dd_events_type
-- ----------------------------
BEGIN;
INSERT INTO `dd_events_type` VALUES (1, '工厂录入', 'factory_entry');
INSERT INTO `dd_events_type` VALUES (2, '初级合伙人申请', 'junior_partner_application');
INSERT INTO `dd_events_type` VALUES (3, '高级合伙人申请', 'senior_partner_application');
INSERT INTO `dd_events_type` VALUES (4, '战略联盟申请', 'strategic_alliance_application');
INSERT INTO `dd_events_type` VALUES (5, '业务员申请', 'salesman_application');
INSERT INTO `dd_events_type` VALUES (6, '职位报名申请', 'position_application');
INSERT INTO `dd_events_type` VALUES (7, '请假申请', 'leave_application');
INSERT INTO `dd_events_type` VALUES (8, '报销申请', 'claim_for_reimbursement');
INSERT INTO `dd_events_type` VALUES (9, '工资条确认申请', 'payslip_confirmation_application');
INSERT INTO `dd_events_type` VALUES (10, '离职申请', 'quit_application');
INSERT INTO `dd_events_type` VALUES (11, '打卡', 'punch_the_clock');
INSERT INTO `dd_events_type` VALUES (12, '预支申请', 'advance_payments');
COMMIT;

-- ----------------------------
-- Table structure for dd_factory_basic_information
-- ----------------------------
DROP TABLE IF EXISTS `dd_factory_basic_information`;
CREATE TABLE `dd_factory_basic_information` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `factory_name` varchar(45) NOT NULL,
  `province` varchar(45) NOT NULL,
  `city` varchar(45) NOT NULL,
  `district` varchar(45) NOT NULL,
  `addres` varchar(45) NOT NULL,
  `location` varchar(128) NOT NULL,
  `longitude` varchar(45) NOT NULL COMMENT '经度',
  `latitude` varchar(45) NOT NULL COMMENT '纬度',
  `logo` varchar(128) NOT NULL DEFAULT '/resources/avatar.png',
  `uid` int(11) NOT NULL,
  `status` int(11) NOT NULL DEFAULT '0',
  `remark` varchar(45) NOT NULL DEFAULT '暂无',
  `create_time` int(11) NOT NULL,
  `update_time` int(11) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8 COMMENT='工厂基本信息(位置信息等)\n';

-- ----------------------------
-- Records of dd_factory_basic_information
-- ----------------------------
BEGIN;
INSERT INTO `dd_factory_basic_information` VALUES (1, '华为科技', '广东省', '东莞市', '东莞市', '工业东路2号', '113.904957,22.960359', '113.904957', '22.960359', '/uploads/images/2c/0f6debe39e5cee9f78f011d7f383d3.jpg', 43, 1, '', 1624476570, 1624477087);
INSERT INTO `dd_factory_basic_information` VALUES (2, '腾讯科技', '广东省', '深圳市', '宝安区', '海秀路21号龙光世纪大厦B座11楼', '113.886102,22.548654', '113.886102', '22.548654', '/uploads/images/9c/b5221e22498cb98e17e90c1bece1af.jpg', 43, 1, '', 1624495617, 1624495864);
INSERT INTO `dd_factory_basic_information` VALUES (3, '阿里中心', '广东省', '深圳市', '南山区', '科苑南路3331号', '113.942744,22.509406', '113.942744', '22.509406', '/uploads/images/16/e0a0e40fb44d67e9303dce6fbe71e5.jpg', 43, 1, '', 1624495846, 1624495868);
INSERT INTO `dd_factory_basic_information` VALUES (4, '白云区人和镇蚌湖小学', '广东省', '广州市', '白云区', '人和镇蚌湖建南杨巷北一街25号', '113.260059,23.293442', '113.260059', '23.293442', '/uploads/images/3c/e3fb8ae0ecbb87deff3e603694a9bc.jpg', 22, 1, '备注', 1625021058, 1625027131);
COMMIT;

-- ----------------------------
-- Table structure for dd_factory_employed_users
-- ----------------------------
DROP TABLE IF EXISTS `dd_factory_employed_users`;
CREATE TABLE `dd_factory_employed_users` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uid` int(11) NOT NULL,
  `fid` int(11) NOT NULL,
  `jid` int(11) NOT NULL,
  `create_time` int(11) NOT NULL COMMENT '入职时间',
  `update_time` int(11) NOT NULL COMMENT '有可能是离职时间,但不一定',
  `state` tinyint(4) NOT NULL DEFAULT '0' COMMENT '是否离职',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='已经入职或离职用户\n';

-- ----------------------------
-- Table structure for dd_factory_environment_and_treatment
-- ----------------------------
DROP TABLE IF EXISTS `dd_factory_environment_and_treatment`;
CREATE TABLE `dd_factory_environment_and_treatment` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `age_requirements` varchar(45) NOT NULL COMMENT '年龄要求',
  `working_hours` varchar(45) NOT NULL COMMENT '工作时长',
  `rest_day_count` int(11) NOT NULL COMMENT '每月休息多少天',
  `way_to_work` varchar(45) NOT NULL COMMENT '上班方式',
  `is_insurance` varchar(45) NOT NULL COMMENT '是否有保险',
  `is_experience` varchar(45) NOT NULL COMMENT '是否体验',
  `dormitory_location` varchar(45) NOT NULL COMMENT '宿舍位置',
  `people_of_dormitory` varchar(45) NOT NULL COMMENT '宿舍住多少人',
  `is_toilet` varchar(45) NOT NULL COMMENT '是否有厕所',
  `dietary_standard` varchar(45) NOT NULL COMMENT '膳食标准',
  `night_shift_allowance` varchar(45) NOT NULL COMMENT '夜班补贴',
  `ethnic_restrictions` varchar(45) NOT NULL COMMENT '民族限制',
  `required_certificates` varchar(45) NOT NULL COMMENT '所需证件',
  `training_time` varchar(45) NOT NULL COMMENT '培训时间',
  `training_content` varchar(128) NOT NULL COMMENT '培训内容',
  `fid` int(11) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8 COMMENT='工厂环境与待遇\n';

-- ----------------------------
-- Records of dd_factory_environment_and_treatment
-- ----------------------------
BEGIN;
INSERT INTO `dd_factory_environment_and_treatment` VALUES (1, '30', '8', 4, '长白班', '有', '有', '无', '无', '有', '无', '无', '不限', '三证齐全', '入职当天', '职前培训', 1);
INSERT INTO `dd_factory_environment_and_treatment` VALUES (2, '30', '8', 4, '长白班', '有', '有', '无', '无', '有', '无', '无', '不限', '三证齐全', '入职当天', '职前培训', 2);
INSERT INTO `dd_factory_environment_and_treatment` VALUES (3, '30', '8', 4, '长白班', '有', '有', '无', '无', '有', '无', '无', '不限', '三证齐全', '入职当天', '职前培训', 3);
INSERT INTO `dd_factory_environment_and_treatment` VALUES (4, '30', '8', 4, '', '有', '有', '无', '无', '有', '无', '无', '不限', '三证齐全', '入职当天', '职前培训', 4);
COMMIT;

-- ----------------------------
-- Table structure for dd_factory_hr
-- ----------------------------
DROP TABLE IF EXISTS `dd_factory_hr`;
CREATE TABLE `dd_factory_hr` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uid` int(11) NOT NULL DEFAULT '0',
  `fid` int(11) NOT NULL DEFAULT '0',
  `score` int(11) NOT NULL DEFAULT '0',
  `create_time` int(11) NOT NULL,
  `update_time` int(11) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=12 DEFAULT CHARSET=utf8 COMMENT='工厂HR列表';

-- ----------------------------
-- Records of dd_factory_hr
-- ----------------------------
BEGIN;
INSERT INTO `dd_factory_hr` VALUES (1, 22, 1, 0, 1624494794, 1624494794);
INSERT INTO `dd_factory_hr` VALUES (2, 23, 1, 0, 1624494798, 1624494798);
INSERT INTO `dd_factory_hr` VALUES (3, 24, 1, 0, 1624494802, 1624494802);
INSERT INTO `dd_factory_hr` VALUES (4, 25, 1, 0, 1624494810, 1624494810);
INSERT INTO `dd_factory_hr` VALUES (5, 27, 1, 0, 1624494816, 1624494816);
INSERT INTO `dd_factory_hr` VALUES (7, 48, 0, 0, 1625022883, 1625022883);
INSERT INTO `dd_factory_hr` VALUES (8, 32, 0, 0, 1625023195, 1625023195);
INSERT INTO `dd_factory_hr` VALUES (9, 39, 0, 0, 1625028164, 1625028164);
INSERT INTO `dd_factory_hr` VALUES (10, 26, 0, 0, 1625028200, 1625028200);
INSERT INTO `dd_factory_hr` VALUES (11, 28, 0, 0, 1625035617, 1625035617);
COMMIT;

-- ----------------------------
-- Table structure for dd_factory_images
-- ----------------------------
DROP TABLE IF EXISTS `dd_factory_images`;
CREATE TABLE `dd_factory_images` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `fid` int(11) DEFAULT NULL,
  `url` varchar(128) DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=15 DEFAULT CHARSET=utf8 COMMENT='存放工厂环境图片';

-- ----------------------------
-- Records of dd_factory_images
-- ----------------------------
BEGIN;
INSERT INTO `dd_factory_images` VALUES (1, 1, '/uploads/images/91/01bc46b8c69f35ed6425aa42f14d6b.jpg');
INSERT INTO `dd_factory_images` VALUES (2, 1, '/uploads/images/65/81c314aa494b50ec68eaf93b37f0fe.jpg');
INSERT INTO `dd_factory_images` VALUES (3, 2, '/uploads/images/b0/b98b1089432c09ac6aa89152c19c75.webp');
INSERT INTO `dd_factory_images` VALUES (4, 2, '/uploads/images/15/b66ab511058c184a19537c702302f3.webp');
INSERT INTO `dd_factory_images` VALUES (5, 2, '/uploads/images/42/ead30fffc6adc7909c7a165d3701f9.webp');
INSERT INTO `dd_factory_images` VALUES (6, 2, '/uploads/images/dd/5bf3d83d2b8cbdffaa9f4ccb283b18.webp');
INSERT INTO `dd_factory_images` VALUES (7, 3, '/uploads/images/9b/991415f59245d033dea8014171f79e.jpg');
INSERT INTO `dd_factory_images` VALUES (8, 3, '/uploads/images/9b/991415f59245d033dea8014171f79e.jpg');
INSERT INTO `dd_factory_images` VALUES (9, 3, '/uploads/images/7a/223dcbbb12e64aafad714be1f46095.jpg');
INSERT INTO `dd_factory_images` VALUES (10, 3, '/uploads/images/a1/1fb422cb13209b001bee892c0af8ab.jpg');
INSERT INTO `dd_factory_images` VALUES (11, 4, '/uploads/images/42/ead30fffc6adc7909c7a165d3701f9.webp');
INSERT INTO `dd_factory_images` VALUES (12, 4, '/uploads/images/15/b66ab511058c184a19537c702302f3.webp');
INSERT INTO `dd_factory_images` VALUES (13, 4, '/uploads/images/b0/b98b1089432c09ac6aa89152c19c75.webp');
INSERT INTO `dd_factory_images` VALUES (14, 4, '/uploads/images/dd/5bf3d83d2b8cbdffaa9f4ccb283b18.webp');
COMMIT;

-- ----------------------------
-- Table structure for dd_factory_information
-- ----------------------------
DROP TABLE IF EXISTS `dd_factory_information`;
CREATE TABLE `dd_factory_information` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `nature_of_plant` varchar(45) NOT NULL COMMENT '厂房性质',
  `nature_of_enterprise` varchar(45) NOT NULL COMMENT '企业性质',
  `fixed_assets` varchar(45) NOT NULL COMMENT '固定资产',
  `registered_capital` varchar(45) NOT NULL COMMENT '注册资金',
  `plant_area` varchar(45) NOT NULL COMMENT '工厂面积',
  `ratio_of_men_to_women` varchar(45) NOT NULL COMMENT '男女比例',
  `existing_employees` varchar(45) NOT NULL COMMENT '现有员工',
  `average_age` varchar(45) NOT NULL COMMENT '平均年龄',
  `existing_recruitment_channels` varchar(45) NOT NULL COMMENT '现有招聘途径',
  `stable_age` varchar(45) NOT NULL COMMENT '稳定年龄段',
  `expected_demand` int(11) NOT NULL DEFAULT '0' COMMENT '预计需求量',
  `used_jobs` varchar(128) NOT NULL DEFAULT '[]' COMMENT '用过的工种',
  `bad_jobs` varchar(128) NOT NULL DEFAULT '[]' COMMENT '不好招的工种',
  `labor_shortage_month` varchar(128) NOT NULL DEFAULT '[]' COMMENT '用工紧张月',
  `fid` int(11) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8 COMMENT='工厂信息\n';

-- ----------------------------
-- Records of dd_factory_information
-- ----------------------------
BEGIN;
INSERT INTO `dd_factory_information` VALUES (1, '自建', '私营企业', '500', '500000', '3000', '1比1', '60', '30', '网招', '30', 200, '[\"小时工\"]', '[\"小时工\"]', '[\"2\",\"3\",\"4\"]', 1);
INSERT INTO `dd_factory_information` VALUES (2, '自建', '私营企业', '500', '500000', '3000', '1比1', '60', '30', '网招', '30', 200, '[\"社会工\"]', '[\"社会工\"]', '[\"2\",\"3\",\"4\"]', 2);
INSERT INTO `dd_factory_information` VALUES (3, '租赁', '私营企业', '500', '500000', '3000', '1比1', '60', '30', '30', '30', 200, '[\"代理招聘\"]', '[\"代理招聘\"]', '[\"4\",\"5\",\"6\",\"7\"]', 3);
INSERT INTO `dd_factory_information` VALUES (4, '自建', '国营企业', '500', '500000', '3000', '1比1', '200', '30', '网招·', '30', 10, '[\"小时工\"]', '[\"小时工\"]', '[\"2\"]', 4);
COMMIT;

-- ----------------------------
-- Table structure for dd_factory_job_type
-- ----------------------------
DROP TABLE IF EXISTS `dd_factory_job_type`;
CREATE TABLE `dd_factory_job_type` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(45) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8 COMMENT='工厂职位类型';

-- ----------------------------
-- Records of dd_factory_job_type
-- ----------------------------
BEGIN;
INSERT INTO `dd_factory_job_type` VALUES (1, '全部');
INSERT INTO `dd_factory_job_type` VALUES (2, '普通职位');
INSERT INTO `dd_factory_job_type` VALUES (3, '技工职位');
INSERT INTO `dd_factory_job_type` VALUES (4, '小时工');
INSERT INTO `dd_factory_job_type` VALUES (5, '学生工');
INSERT INTO `dd_factory_job_type` VALUES (6, '社会工');
INSERT INTO `dd_factory_job_type` VALUES (7, '热招中');
COMMIT;

-- ----------------------------
-- Table structure for dd_factory_jobs
-- ----------------------------
DROP TABLE IF EXISTS `dd_factory_jobs`;
CREATE TABLE `dd_factory_jobs` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `fid` int(11) NOT NULL COMMENT '工厂ID',
  `job_name` varchar(45) NOT NULL COMMENT '职位名称',
  `job_type` varchar(45) NOT NULL COMMENT '职位类型',
  `isHot` tinyint(4) NOT NULL DEFAULT '1' COMMENT '是否热招',
  `minimum_search_range` int(11) NOT NULL COMMENT '最小薪资范围',
  `maximum_salary_range` int(11) NOT NULL COMMENT '最大薪资范围',
  `base_salary` varchar(10) NOT NULL COMMENT '底薪-基本工资(¥/小时)',
  `number_of_recruiters` int(11) NOT NULL COMMENT '招聘人数',
  `number_of_people_recruited` int(11) NOT NULL COMMENT '已招人数',
  `job_payroll_time` varchar(45) NOT NULL COMMENT '发薪日期',
  `certificates` varchar(45) NOT NULL COMMENT '身份证',
  `phto` varchar(45) NOT NULL COMMENT '照片',
  `diploma` varchar(45) NOT NULL COMMENT '毕业证',
  `diploma_copy` varchar(45) NOT NULL COMMENT '毕业证明复印件',
  `dust_free_clothes` varchar(45) NOT NULL COMMENT '无尘服',
  `face_recognition` varchar(45) NOT NULL COMMENT '人脸识别',
  `tattoo` varchar(45) NOT NULL COMMENT '纹身',
  `smoke_scars` varchar(45) NOT NULL COMMENT '烟疤',
  `english_requirements` varchar(45) NOT NULL COMMENT '英文要求',
  `arithmetic_requirements` varchar(45) NOT NULL COMMENT '算术要求',
  `in_vivo_examination` varchar(45) NOT NULL COMMENT '体内检查',
  `job_environment` varchar(45) NOT NULL COMMENT '工作环境',
  `traffic` varchar(45) NOT NULL COMMENT '交通',
  `teturn_to_factory_rules` varchar(5000) NOT NULL COMMENT '返厂规定',
  `job_description` varchar(5000) NOT NULL COMMENT '工作描述',
  `contract_note` varchar(5000) NOT NULL COMMENT '合同说明',
  `salary_structure` varchar(5000) NOT NULL COMMENT '薪资结构',
  `reminder` varchar(90) NOT NULL COMMENT '温馨提示',
  `status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '0 未发布 1已发布',
  `create_time` int(11) NOT NULL,
  `update_time` int(11) NOT NULL,
  `city` varchar(255) NOT NULL DEFAULT '',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8 COMMENT='职位列表';

-- ----------------------------
-- Records of dd_factory_jobs
-- ----------------------------
BEGIN;
INSERT INTO `dd_factory_jobs` VALUES (1, 1, '船舶普工/保安/电焊工', '1', 1, 8000, 12000, '8000', 200, 9, '次月10号', '带磁身份', '蓝底免冠大一寸照', '无要求', '无要求', '无要求', '无', '无要求', '无要求', '无要求', '无要求', '无', '空间车间', '无', '无', '  职位描述：\n职位描述: 职位描述: 详细情况直接来电咨询，如看不到电话号码\n\n（请先投递简历，投递简历以后可以看到电话号码）\n\n公司直招，无需缴纳任何费用、当天面试通过、当天安排入职\n\n请求职者直接来电报名咨询\n\n外地来上海的车票保管好，在公司做满一个月可申报全程路费\n\n可带好自己随身物品，洗漱物品、换洗衣服， 所有员工一经公司正式录用需 签订正式入职合同当天安排入职\n\n应聘基本条件：\n\n1、年龄18-50岁周岁；\n\n2、身体健康、无心脏疾病、无传染性疾病、不晕船\n\n3、无犯罪前科，热爱航海事业\n\n能吃苦耐劳、有无工作经验均可\n\n5、能随时上岗并带上身份证和换洗衣服，面试合格，当天安排港口工作', ' 详情与经纪人联系', '  五险一金免费班车定期体检包住带薪年假医疗保险交通补贴年底双薪加班补助通讯补贴年度旅游', '  详情与经纪人联系', 1, 1624477519, 1625042312, '东莞市');
INSERT INTO `dd_factory_jobs` VALUES (2, 2, '普工/临时工加班多可借支', '2', 1, 7000, 8000, '7000', 50, 1, '次月10号', '带磁身份', '蓝底免冠大一寸照', '无要求', '无要求', '无要求', '无', '无要求', '无要求', '无要求', '无要求', '无', '空间车间', '无', '无', '  职位描述: 急招，急招， 小时工、正式工。可接受寒假工，结算灵活。\n\n因公司增加订单，增添生产线，近期入职岗位好，工资高，奖金高。入职即签订合同，面试不收任何费用。\n\n以长白班岗位为主，坐班，独立岗位，工作轻松。\n\n1、男女不限；16-45周岁。学历不限\n\n2、身体健康，无明显纹身。\n\n3、本人身份证（临时身份证也可以）在有效期内。\n\n小时工待遇\n\n1、小时工：23--26元/小时（可以申请转正，也可以长期）。每月有：300个—330个工时。\n\n2、综合收入：7000元—8000元/月。\n\n3、.每周可预支工资200-300元\n\n正式工待遇\n\n1、加班按劳动法算，平时加班1.5倍，周末加班2倍，法定节假日3倍；平均每天加班2至3小时，加班自由，不限制加班。岗位津贴100元-500元，绩效奖100元-300元，全勤奖等等。\n\n工作内容\n\n1、岗位涉上市电子产品的组装、组立、检测、包装、插件、品管、测试、物料、等岗位\n\n2、无需经验；生手熟手均可；生手进厂后有老员工带。\n\n车间环境\n\n1、车间配有：饮水机，休息间。\n\n2、车间配有中央空调（冬暖夏凉）\n\n3、坐着上班，不需要穿防尘服，穿的是普通工衣免费食宿（包吃包住）\n\n1、进厂当天，凭厂牌吃饭，不用自己掏钱充值。\n\n2、饭堂：有米饭、粤菜、湘菜、川菜窗口，小食有水饺、馒头、面包、鸡蛋、吃饱为止，持厂牌即可刷卡就餐。\n\n3、免费提供住宿、6-8人一间，房间大。\n\n面试须知\n\n1、需要携带本人身份证原件（及）个人生活用品，需要准备1寸相片及身份证复印件各3张，没有可以过来办理。\n\n2、带行李优先安排，可挑选床位！工厂当天安排住宿入职，隔天上班，带薪培训！', '  详情请与经纪人联系', '五险一金带薪年假年底双薪公寓式宿舍包吃住普通工衣', '详情请与经纪人联系', 1, 1624496018, 1624932671, '深圳市');
INSERT INTO `dd_factory_jobs` VALUES (3, 3, '家政保洁/清洁工/月嫂', '2', 1, 4500, 6000, '4500', 30, 0, '次月10号', '带磁身份', '蓝底免冠大一寸照', '无要求', '无要求', '无要求', '无', '无要求', '无要求', '无要求', '无要求', '无', '空间车间', '无', '无', '  职位描述: 1.主要负责雇主家里饮食起居\n\n2.负责雇主家里的小孩子安全和教育培养\n\n3.负责雇主家里的清洁卫生\n\n4.要求50以下诚信态度好会基本的家务', '    详情请与经纪人联系', '  五险一金包住餐补年底双薪', '  详情请与经纪人联系', 1, 1624496113, 1624496122, '深圳市');
INSERT INTO `dd_factory_jobs` VALUES (4, 1, '普工', '2', 0, 4000, 7000, '3000', 100, 4, '次月10号', '带磁身份', '蓝底免冠大一寸照', '无要求', '无要求', '无要求', '无', '无要求', '无要求', '无要求', '无要求', '无', '空间车间', '无', '无', '职位说明', '合同说明', '薪资结构', '温馨提示', 1, 1624927826, 1625041628, '东莞市');
INSERT INTO `dd_factory_jobs` VALUES (5, 1, '技术工', '1', 1, 3000, 4000, '3000', 100, 101, '次月10号', '带磁身份', '蓝底免冠大一寸照', '无要求', '无要求', '无要求', '无', '无要求', '无要求', '无要求', '无要求', '无', '空间车间', '无', '无', ' 职位说明 ', ' 合同说明 ', ' 薪资结构   ', '   温馨提示 ', 1, 1625004761, 1625008657, '东莞市');
INSERT INTO `dd_factory_jobs` VALUES (6, 2, '临时工', '1', 1, 4000, 8000, '4000', 100, 0, '次月10号', '带磁身份', '蓝底免冠大一寸照', '无要求', '无要求', '无要求', '无', '无要求', '无要求', '无要求', '无要求', '无', '空间车间', '无', '无', '职位说明\n', '合同说明\n', '薪资结构\n', '温馨提示\n', 1, 1625005089, 1625005094, '深圳市');
COMMIT;

-- ----------------------------
-- Table structure for dd_factory_plant_related_personnel
-- ----------------------------
DROP TABLE IF EXISTS `dd_factory_plant_related_personnel`;
CREATE TABLE `dd_factory_plant_related_personnel` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `receptionist` varchar(45) NOT NULL COMMENT '接待人',
  `receptionist_phone` varchar(45) NOT NULL COMMENT '接待人联系电话',
  `houseparent` varchar(45) NOT NULL COMMENT '宿舍管理员',
  `houseparent_phone` varchar(45) NOT NULL COMMENT '宿舍管理员联系电话',
  `follow_up_person` varchar(45) NOT NULL COMMENT '跟进人',
  `follow_up_person_phone` varchar(45) NOT NULL COMMENT '跟进人联系电话',
  `fid` int(11) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8 COMMENT='工厂相关人员\n';

-- ----------------------------
-- Records of dd_factory_plant_related_personnel
-- ----------------------------
BEGIN;
INSERT INTO `dd_factory_plant_related_personnel` VALUES (1, '业务员', '13800138021', '业务员', '13800138021', '业务员', '13800138021', 1);
INSERT INTO `dd_factory_plant_related_personnel` VALUES (2, '业务员', '13800138021', '业务员', '13800138021', '业务员', '13800138021', 2);
INSERT INTO `dd_factory_plant_related_personnel` VALUES (3, '业务员', '13800138021', '业务员', '13800138021', '业务员', '13800138021', 3);
INSERT INTO `dd_factory_plant_related_personnel` VALUES (4, '蛋蛋', '13800138000', '蛋蛋', '13800138000', '蛋蛋', '13800138000', 4);
COMMIT;

-- ----------------------------
-- Table structure for dd_factory_signing_information
-- ----------------------------
DROP TABLE IF EXISTS `dd_factory_signing_information`;
CREATE TABLE `dd_factory_signing_information` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `cooperation_mode` varchar(45) NOT NULL COMMENT '合作方式',
  `salary_payment_method` varchar(45) NOT NULL COMMENT '工资发放方式',
  `signed_unit_price` varchar(45) NOT NULL DEFAULT '0.00' COMMENT '签单价格',
  `employee_unit_price` varchar(45) NOT NULL DEFAULT '0.00' COMMENT '员工单价',
  `commission_for_teacher` varchar(45) NOT NULL DEFAULT '0.00' COMMENT '老师提成',
  `commission_for_salesman` varchar(45) NOT NULL DEFAULT '0.00' COMMENT '业务员提成',
  `settlement_date` varchar(45) NOT NULL COMMENT '合同届满薪资结算日期',
  `startTime` varchar(45) NOT NULL COMMENT '合同有效期-起始日期',
  `endTime` varchar(45) NOT NULL COMMENT '合同有效期-结束日期',
  `fid` int(11) NOT NULL COMMENT '工厂ID',
  `income_tax` varchar(45) NOT NULL DEFAULT '0.00' COMMENT '税金\n',
  `insurance_premium` varchar(45) NOT NULL DEFAULT '0.00' COMMENT '保险费',
  `management_expense` varchar(45) NOT NULL DEFAULT '0.00' COMMENT '管理费',
  `create_time` int(11) NOT NULL,
  `update_time` int(11) NOT NULL,
  `overtime_pay` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '平时加班工资',
  `weekend_overtime_pay` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '周末加班工资',
  `overtim_pay_on_holidays` varchar(45) NOT NULL DEFAULT '0.0' COMMENT '法定节假日加班工资',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8 COMMENT='工厂签单信息\n';

-- ----------------------------
-- Records of dd_factory_signing_information
-- ----------------------------
BEGIN;
INSERT INTO `dd_factory_signing_information` VALUES (1, '小时工', '蛋蛋发放', '100.0', '90.0', '1', '1', '2021-06-24', '2021-06-24', '2021-06-24', 1, '3.0', '10.0', '10.00', 1624476571, 1625036895, '0.0', '0.0', '0.0');
INSERT INTO `dd_factory_signing_information` VALUES (2, '同工同酬', '蛋蛋发放', '100.0', '80.0', '3.0', '3.0', '2021-06-24', '2021-06-24', '2021-06-24', 2, '0.0', '0.0', '1.00', 1624495617, 1625028561, '0.0', '0.0', '0.0');
INSERT INTO `dd_factory_signing_information` VALUES (3, '代理招聘', '其他', '10.0', '0.0', '1.0', '1.0', '2021-06-24', '2021-06-24', '2021-06-24', 3, '0.0', '0.0', '1.00', 1624495846, 1625028568, '0.0', '0.0', '0.0');
INSERT INTO `dd_factory_signing_information` VALUES (4, '小时工', '其他', '20.0', '16.5', '1.0', '1.0', '2021-06-24', '2021-06-24', '2021-06-24', 4, '10.0', '20.0', '2.00', 1625021058, 1625028679, '0.0', '0.0', '0.0');
COMMIT;

-- ----------------------------
-- Table structure for dd_factory_staff
-- ----------------------------
DROP TABLE IF EXISTS `dd_factory_staff`;
CREATE TABLE `dd_factory_staff` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uid` int(11) NOT NULL COMMENT '员工ID',
  `fid` int(11) NOT NULL COMMENT '工厂ID',
  `jid` int(11) NOT NULL COMMENT '职位ID',
  `status` tinyint(4) NOT NULL DEFAULT '1' COMMENT '默认1:在职 0离职',
  `create_time` int(11) NOT NULL,
  `update_time` int(11) NOT NULL,
  `pid` int(11) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8 COMMENT='工厂员工';

-- ----------------------------
-- Records of dd_factory_staff
-- ----------------------------
BEGIN;
INSERT INTO `dd_factory_staff` VALUES (3, 44, 1, 1, 1, 1624524068, 1624524068, 22);
INSERT INTO `dd_factory_staff` VALUES (4, 39, 1, 1, 1, 1624821455, 1624821455, 22);
INSERT INTO `dd_factory_staff` VALUES (5, 30, 1, 1, 1, 1624835753, 1624835753, 22);
INSERT INTO `dd_factory_staff` VALUES (6, 29, 2, 2, 1, 1624932671, 1624932671, 25);
INSERT INTO `dd_factory_staff` VALUES (7, 34, 1, 1, 1, 1624951125, 1624951125, 22);
INSERT INTO `dd_factory_staff` VALUES (8, 47, 1, 5, 1, 1625008657, 1625008657, 25);
INSERT INTO `dd_factory_staff` VALUES (9, 48, 1, 4, 1, 1625023575, 1625023575, 25);
INSERT INTO `dd_factory_staff` VALUES (12, 38, 1, 4, 1, 1625036534, 1625036534, 25);
INSERT INTO `dd_factory_staff` VALUES (13, 51, 1, 4, 1, 1625041628, 1625041628, 50);
INSERT INTO `dd_factory_staff` VALUES (14, 50, 1, 1, 1, 1625042021, 1625042021, 49);
INSERT INTO `dd_factory_staff` VALUES (15, 52, 1, 1, 1, 1625042312, 1625042312, 49);
COMMIT;

-- ----------------------------
-- Table structure for dd_factory_teacher
-- ----------------------------
DROP TABLE IF EXISTS `dd_factory_teacher`;
CREATE TABLE `dd_factory_teacher` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uid` int(11) NOT NULL DEFAULT '0',
  `fid` int(11) NOT NULL DEFAULT '0',
  `score` varchar(10) NOT NULL DEFAULT '0.0',
  `create_time` int(11) NOT NULL,
  `update_time` int(11) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=19 DEFAULT CHARSET=utf8 COMMENT='驻场老师';

-- ----------------------------
-- Records of dd_factory_teacher
-- ----------------------------
BEGIN;
INSERT INTO `dd_factory_teacher` VALUES (6, 27, 3, '0.0', 1624504412, 1624504412);
INSERT INTO `dd_factory_teacher` VALUES (7, 27, 2, '4.5', 1624504432, 1624932734);
INSERT INTO `dd_factory_teacher` VALUES (8, 22, 3, '0.0', 1624524839, 1624524839);
INSERT INTO `dd_factory_teacher` VALUES (9, 22, 1, '18', 1624821434, 1625036249);
INSERT INTO `dd_factory_teacher` VALUES (10, 27, 1, '13.5', 1625020511, 1625036249);
INSERT INTO `dd_factory_teacher` VALUES (11, 22, 4, '0.0', 1625027252, 1625027252);
INSERT INTO `dd_factory_teacher` VALUES (12, 23, 4, '0.0', 1625027263, 1625027263);
INSERT INTO `dd_factory_teacher` VALUES (13, 24, 4, '0.0', 1625027274, 1625027274);
INSERT INTO `dd_factory_teacher` VALUES (14, 23, 3, '0.0', 1625027305, 1625027305);
INSERT INTO `dd_factory_teacher` VALUES (15, 24, 3, '0.0', 1625027313, 1625027313);
INSERT INTO `dd_factory_teacher` VALUES (16, 23, 2, '0.0', 1625027320, 1625027320);
INSERT INTO `dd_factory_teacher` VALUES (17, 24, 2, '0.0', 1625027327, 1625027327);
INSERT INTO `dd_factory_teacher` VALUES (18, 22, 2, '0.0', 1625027338, 1625027338);
COMMIT;

-- ----------------------------
-- Table structure for dd_favorites
-- ----------------------------
DROP TABLE IF EXISTS `dd_favorites`;
CREATE TABLE `dd_favorites` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `type` tinyint(4) NOT NULL COMMENT '1:文章 2:职位',
  `uid` int(11) NOT NULL COMMENT '用户',
  `title` varchar(64) NOT NULL COMMENT '标题',
  `subtitle` varchar(5000) NOT NULL COMMENT '子标题',
  `cid` int(11) NOT NULL COMMENT '内容id',
  `image` varchar(128) NOT NULL COMMENT '缩略图',
  `create_time` int(11) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=14 DEFAULT CHARSET=utf8 COMMENT='收藏夹';

-- ----------------------------
-- Records of dd_favorites
-- ----------------------------
BEGIN;
INSERT INTO `dd_favorites` VALUES (1, 2, 4, '船舶普工/保安/电焊工', '富士康工厂', 7, '/uploads/images/d7/3e15e6b3861db171ee65c5b8cdd300.jpg', 1624470179);
INSERT INTO `dd_favorites` VALUES (2, 2, 29, '船舶普工/保安/电焊工', '华为科技', 1, '/uploads/images/2c/0f6debe39e5cee9f78f011d7f383d3.jpg', 1624478289);
INSERT INTO `dd_favorites` VALUES (3, 1, 34, '蛋蛋收费测试', '这里写描述内容，支持2000字', 4, '/uploads/images/3f/7e91e1045f34a78e83c9c533b8cc6d.jpg', 1624521064);
INSERT INTO `dd_favorites` VALUES (4, 2, 44, '船舶普工/保安/电焊工', '华为科技', 1, '/uploads/images/2c/0f6debe39e5cee9f78f011d7f383d3.jpg', 1624523741);
INSERT INTO `dd_favorites` VALUES (5, 1, 22, '校草又在装高冷', '一段源于音乐的邂逅，一段源于网游的陪伴\n一段轻松、愉悦、浪漫的爱情故事\n一段青春、拼搏、励志的成长经历\n来看一个天才音乐少女和钢琴小王子的缠绵悱恻', 1, '/uploads/images/76/c5f46573dc92eba40f87d7433df403.jpg', 1624789488);
INSERT INTO `dd_favorites` VALUES (6, 1, 46, '校草又在装高冷', '一段源于音乐的邂逅，一段源于网游的陪伴\n一段轻松、愉悦、浪漫的爱情故事\n一段青春、拼搏、励志的成长经历\n来看一个天才音乐少女和钢琴小王子的缠绵悱恻', 1, '/uploads/images/76/c5f46573dc92eba40f87d7433df403.jpg', 1625005728);
INSERT INTO `dd_favorites` VALUES (7, 1, 46, '魂道倾天', '噬魂大法，破大脑封印；魂武双修，魂破九重天。\n天生异瞳的姜楠，征服生命禁区昆仑，获上古噬魂青莲，黑洞穿越至异界，与爆体蛟龙血肉融合，脱胎换骨，破茧重生，开启异界波澜壮阔的征战之旅。\n这是一本雄性励志、激情、杀戮、征服的玄幻。\n场面宏大、跌宕起伏、全程高能，您值得推荐、收藏。\n故事采用时空交叉的叙事结构，前几章稍有耐心，静静品读。如同醇厚老酒，越品越有味道，一旦入戏，定将如痴如醉，欲罢不能。', 2, '/uploads/images/8e/625dcf8eace85de3cbcba582a7bbe4.jpg', 1625005740);
INSERT INTO `dd_favorites` VALUES (8, 2, 46, '家政保洁/清洁工/月嫂', '阿里中心', 3, '/uploads/images/16/e0a0e40fb44d67e9303dce6fbe71e5.jpg', 1625006919);
INSERT INTO `dd_favorites` VALUES (9, 1, 48, '校草又在装高冷', '一段源于音乐的邂逅，一段源于网游的陪伴\n一段轻松、愉悦、浪漫的爱情故事\n一段青春、拼搏、励志的成长经历\n来看一个天才音乐少女和钢琴小王子的缠绵悱恻', 1, '/uploads/images/76/c5f46573dc92eba40f87d7433df403.jpg', 1625017043);
INSERT INTO `dd_favorites` VALUES (10, 1, 48, '魂道倾天', '噬魂大法，破大脑封印；魂武双修，魂破九重天。\n天生异瞳的姜楠，征服生命禁区昆仑，获上古噬魂青莲，黑洞穿越至异界，与爆体蛟龙血肉融合，脱胎换骨，破茧重生，开启异界波澜壮阔的征战之旅。\n这是一本雄性励志、激情、杀戮、征服的玄幻。\n场面宏大、跌宕起伏、全程高能，您值得推荐、收藏。\n故事采用时空交叉的叙事结构，前几章稍有耐心，静静品读。如同醇厚老酒，越品越有味道，一旦入戏，定将如痴如醉，欲罢不能。', 2, '/uploads/images/8e/625dcf8eace85de3cbcba582a7bbe4.jpg', 1625017086);
INSERT INTO `dd_favorites` VALUES (12, 1, 25, '校草又在装高冷', '一段源于音乐的邂逅，一段源于网游的陪伴\n一段轻松、愉悦、浪漫的爱情故事\n一段青春、拼搏、励志的成长经历\n来看一个天才音乐少女和钢琴小王子的缠绵悱恻', 1, '/uploads/images/76/c5f46573dc92eba40f87d7433df403.jpg', 1625019540);
INSERT INTO `dd_favorites` VALUES (13, 1, 25, '魂道倾天', '噬魂大法，破大脑封印；魂武双修，魂破九重天。\n天生异瞳的姜楠，征服生命禁区昆仑，获上古噬魂青莲，黑洞穿越至异界，与爆体蛟龙血肉融合，脱胎换骨，破茧重生，开启异界波澜壮阔的征战之旅。\n这是一本雄性励志、激情、杀戮、征服的玄幻。\n场面宏大、跌宕起伏、全程高能，您值得推荐、收藏。\n故事采用时空交叉的叙事结构，前几章稍有耐心，静静品读。如同醇厚老酒，越品越有味道，一旦入戏，定将如痴如醉，欲罢不能。', 2, '/uploads/images/8e/625dcf8eace85de3cbcba582a7bbe4.jpg', 1625019542);
COMMIT;

-- ----------------------------
-- Table structure for dd_feedbackes
-- ----------------------------
DROP TABLE IF EXISTS `dd_feedbackes`;
CREATE TABLE `dd_feedbackes` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uid` int(11) DEFAULT NULL,
  `title` varchar(45) DEFAULT NULL,
  `content` varchar(255) DEFAULT NULL,
  `create_time` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COMMENT='意见反馈';

-- ----------------------------
-- Records of dd_feedbackes
-- ----------------------------
BEGIN;
INSERT INTO `dd_feedbackes` VALUES (1, 25, '我有话跟你说', '你的时候你是不是在我家的时候我就算不是吗。我是', 1624524306);
INSERT INTO `dd_feedbackes` VALUES (2, 48, '吧唧一口吃掉你', '45454689797979出去的少女', 1625019076);
COMMIT;

-- ----------------------------
-- Table structure for dd_friends
-- ----------------------------
DROP TABLE IF EXISTS `dd_friends`;
CREATE TABLE `dd_friends` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `fuid` int(11) NOT NULL,
  `tuid` int(11) NOT NULL,
  `create_time` int(11) NOT NULL,
  `status` int(11) NOT NULL DEFAULT '0' COMMENT '0 发起申请\n1同意好友申请\n2拒绝好友申请',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=37 DEFAULT CHARSET=utf8 COMMENT='好友列表';

-- ----------------------------
-- Records of dd_friends
-- ----------------------------
BEGIN;
INSERT INTO `dd_friends` VALUES (1, 23, 22, 1624494917, 1);
INSERT INTO `dd_friends` VALUES (2, 23, 24, 1624494919, 1);
INSERT INTO `dd_friends` VALUES (3, 23, 25, 1624494921, 1);
INSERT INTO `dd_friends` VALUES (4, 23, 26, 1624494922, 1);
INSERT INTO `dd_friends` VALUES (5, 23, 27, 1624494926, 0);
INSERT INTO `dd_friends` VALUES (6, 23, 28, 1624494928, 1);
INSERT INTO `dd_friends` VALUES (7, 23, 29, 1624494930, 1);
INSERT INTO `dd_friends` VALUES (8, 23, 30, 1624494932, 1);
INSERT INTO `dd_friends` VALUES (9, 23, 31, 1624494935, 1);
INSERT INTO `dd_friends` VALUES (10, 23, 32, 1624494937, 0);
INSERT INTO `dd_friends` VALUES (11, 23, 33, 1624494939, 0);
INSERT INTO `dd_friends` VALUES (12, 29, 22, 1624509927, 1);
INSERT INTO `dd_friends` VALUES (13, 29, 25, 1624509936, 1);
INSERT INTO `dd_friends` VALUES (14, 22, 34, 1624510188, 1);
INSERT INTO `dd_friends` VALUES (15, 22, 35, 1624510190, 1);
INSERT INTO `dd_friends` VALUES (16, 22, 36, 1624510193, 0);
INSERT INTO `dd_friends` VALUES (17, 23, 34, 1624510245, 1);
INSERT INTO `dd_friends` VALUES (18, 24, 22, 1624510279, 1);
INSERT INTO `dd_friends` VALUES (19, 24, 23, 1624510281, 0);
INSERT INTO `dd_friends` VALUES (20, 24, 25, 1624510285, 1);
INSERT INTO `dd_friends` VALUES (21, 24, 26, 1624510287, 1);
INSERT INTO `dd_friends` VALUES (22, 24, 27, 1624510288, 0);
INSERT INTO `dd_friends` VALUES (23, 24, 28, 1624510290, 1);
INSERT INTO `dd_friends` VALUES (24, 24, 29, 1624510293, 1);
INSERT INTO `dd_friends` VALUES (25, 24, 30, 1624510295, 1);
INSERT INTO `dd_friends` VALUES (26, 24, 31, 1624510298, 1);
INSERT INTO `dd_friends` VALUES (27, 24, 35, 1624510302, 1);
INSERT INTO `dd_friends` VALUES (28, 24, 36, 1624510304, 0);
INSERT INTO `dd_friends` VALUES (29, 31, 22, 1624510670, 1);
INSERT INTO `dd_friends` VALUES (30, 22, 30, 1624510725, 0);
INSERT INTO `dd_friends` VALUES (31, 22, 31, 1624510728, 0);
INSERT INTO `dd_friends` VALUES (32, 44, 22, 1624523567, 1);
INSERT INTO `dd_friends` VALUES (33, 44, 28, 1624523569, 0);
INSERT INTO `dd_friends` VALUES (34, 46, 22, 1625007210, 1);
INSERT INTO `dd_friends` VALUES (35, 46, 24, 1625007397, 0);
INSERT INTO `dd_friends` VALUES (36, 48, 25, 1625018307, 1);
COMMIT;

-- ----------------------------
-- Table structure for dd_images
-- ----------------------------
DROP TABLE IF EXISTS `dd_images`;
CREATE TABLE `dd_images` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `url` varchar(255) NOT NULL,
  `create_time` int(11) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=52 DEFAULT CHARSET=utf8 COMMENT='用户头像，报销图片列表';

-- ----------------------------
-- Records of dd_images
-- ----------------------------
BEGIN;
INSERT INTO `dd_images` VALUES (1, '/uploads/images/3c/e3fb8ae0ecbb87deff3e603694a9bc.jpg', 1624474531);
INSERT INTO `dd_images` VALUES (2, '/uploads/images/26/3624736492f6f50b0b52508f4cc1fd.jpg', 1624474550);
INSERT INTO `dd_images` VALUES (3, '/uploads/images/6b/ba5a181aaf2241fa700c5233e630fc.jpg', 1624474568);
INSERT INTO `dd_images` VALUES (4, '/uploads/images/fe/4f02eafe1d71b15fa239b93355dc09.jpg', 1624474590);
INSERT INTO `dd_images` VALUES (5, '/uploads/images/3c/e3fb8ae0ecbb87deff3e603694a9bc.jpg', 1624474630);
INSERT INTO `dd_images` VALUES (6, '/uploads/images/fb/c4ed9c49dc464853323357db244787.png', 1624474682);
INSERT INTO `dd_images` VALUES (7, '/uploads/images/2c/0f6debe39e5cee9f78f011d7f383d3.jpg', 1624476490);
INSERT INTO `dd_images` VALUES (8, '/uploads/images/65/81c314aa494b50ec68eaf93b37f0fe.jpg', 1624476501);
INSERT INTO `dd_images` VALUES (9, '/uploads/images/91/01bc46b8c69f35ed6425aa42f14d6b.jpg', 1624476501);
INSERT INTO `dd_images` VALUES (10, '/uploads/images/9c/b5221e22498cb98e17e90c1bece1af.jpg', 1624495599);
INSERT INTO `dd_images` VALUES (11, '/uploads/images/b0/b98b1089432c09ac6aa89152c19c75.webp', 1624495607);
INSERT INTO `dd_images` VALUES (12, '/uploads/images/dd/5bf3d83d2b8cbdffaa9f4ccb283b18.webp', 1624495607);
INSERT INTO `dd_images` VALUES (13, '/uploads/images/42/ead30fffc6adc7909c7a165d3701f9.webp', 1624495607);
INSERT INTO `dd_images` VALUES (14, '/uploads/images/15/b66ab511058c184a19537c702302f3.webp', 1624495607);
INSERT INTO `dd_images` VALUES (15, '/uploads/images/16/e0a0e40fb44d67e9303dce6fbe71e5.jpg', 1624495789);
INSERT INTO `dd_images` VALUES (16, '/uploads/images/7a/223dcbbb12e64aafad714be1f46095.jpg', 1624495844);
INSERT INTO `dd_images` VALUES (17, '/uploads/images/9b/991415f59245d033dea8014171f79e.jpg', 1624495844);
INSERT INTO `dd_images` VALUES (18, '/uploads/images/9b/991415f59245d033dea8014171f79e.jpg', 1624495844);
INSERT INTO `dd_images` VALUES (19, '/uploads/images/a1/1fb422cb13209b001bee892c0af8ab.jpg', 1624495844);
INSERT INTO `dd_images` VALUES (20, '/uploads/images/e9/4aa240d9446c613a2a1aed37ece365.jpg', 1624503529);
INSERT INTO `dd_images` VALUES (21, '/uploads/images/5a/010d141dca24e426dbb64dcb3e5b73.jpg', 1624503534);
INSERT INTO `dd_images` VALUES (22, '/uploads/images/75/059aceda9bd65462bcce65a6fb3134.jpg', 1624503541);
INSERT INTO `dd_images` VALUES (23, '/uploads/images/fe/a0121a293ffb5c33053e98f847fd64.jpg', 1624503548);
INSERT INTO `dd_images` VALUES (24, '/uploads/images/3e/88f2c4c7d07eb8851c8530d0db60c0.jpg', 1624503703);
INSERT INTO `dd_images` VALUES (25, '/uploads/images/5b/f235ab4c46a93ca09cd0c8afbe265d.jpg', 1624503707);
INSERT INTO `dd_images` VALUES (26, '/uploads/images/26/8b9346cb2d0f21f429b972d7b77b47.jpg', 1624503712);
INSERT INTO `dd_images` VALUES (27, '/uploads/images/b7/eb2b865375d72230e70d2c5b28bc90.jpg', 1624503716);
INSERT INTO `dd_images` VALUES (28, '/uploads/images/11/5dfa1877f961817a8c836741894642.jpg', 1624519647);
INSERT INTO `dd_images` VALUES (29, '/uploads/images/11/5dfa1877f961817a8c836741894642.jpg', 1624521233);
INSERT INTO `dd_images` VALUES (30, '/uploads/images/e0/960463567faad45cd3aaf31907787a.jpg', 1624522588);
INSERT INTO `dd_images` VALUES (31, '/uploads/images/11/5dfa1877f961817a8c836741894642.jpg', 1624843174);
INSERT INTO `dd_images` VALUES (32, '/uploads/images/89/5d3d5fd09dfd9edb91669dff65fa52.jpg', 1624843183);
INSERT INTO `dd_images` VALUES (33, '/uploads/images/18/80e9d0ddac2d5a8612fe55e2a38c05.jpg', 1624843207);
INSERT INTO `dd_images` VALUES (34, '/uploads/images/41/4afa97a3247c92701124f2a43180be.jpg', 1624843218);
INSERT INTO `dd_images` VALUES (35, '/uploads/images/68/3c47755b3d1b8260cfd11016d652d8.jpg', 1624843233);
INSERT INTO `dd_images` VALUES (36, '/uploads/images/8b/1584317681cae55763459d973ba2c3.jpg', 1624843244);
INSERT INTO `dd_images` VALUES (37, '/uploads/images/e2/e7a8c15ed4dd89bd7316b3c4695d07.jpg', 1625007850);
INSERT INTO `dd_images` VALUES (38, '/uploads/images/e2/e7a8c15ed4dd89bd7316b3c4695d07.jpg', 1625018589);
INSERT INTO `dd_images` VALUES (39, '/uploads/images/44/0ab457ec1a93aa40458255a68c1811.jpg', 1625018918);
INSERT INTO `dd_images` VALUES (40, '/uploads/images/3c/e3fb8ae0ecbb87deff3e603694a9bc.jpg', 1625020938);
INSERT INTO `dd_images` VALUES (41, '/uploads/images/42/ead30fffc6adc7909c7a165d3701f9.webp', 1625021052);
INSERT INTO `dd_images` VALUES (42, '/uploads/images/15/b66ab511058c184a19537c702302f3.webp', 1625021052);
INSERT INTO `dd_images` VALUES (43, '/uploads/images/b0/b98b1089432c09ac6aa89152c19c75.webp', 1625021052);
INSERT INTO `dd_images` VALUES (44, '/uploads/images/dd/5bf3d83d2b8cbdffaa9f4ccb283b18.webp', 1625021052);
INSERT INTO `dd_images` VALUES (45, '/uploads/images/3f/7e91e1045f34a78e83c9c533b8cc6d.jpg', 1625021233);
INSERT INTO `dd_images` VALUES (46, '/uploads/images/6b/ba5a181aaf2241fa700c5233e630fc.jpg', 1625021283);
INSERT INTO `dd_images` VALUES (47, '/uploads/images/3c/e3fb8ae0ecbb87deff3e603694a9bc.jpg', 1625021496);
INSERT INTO `dd_images` VALUES (48, '/uploads/images/96/fecc57defdc8a51050b6ce220bb97a.jpg', 1625024007);
INSERT INTO `dd_images` VALUES (49, '/uploads/images/2f/febb3932bfd991c141772f049b73ee.jpg', 1625028877);
INSERT INTO `dd_images` VALUES (50, '/uploads/images/fe/4f02eafe1d71b15fa239b93355dc09.jpg', 1625029017);
INSERT INTO `dd_images` VALUES (51, '/uploads/images/6b/ba5a181aaf2241fa700c5233e630fc.jpg', 1625029124);
COMMIT;

-- ----------------------------
-- Table structure for dd_my_bank
-- ----------------------------
DROP TABLE IF EXISTS `dd_my_bank`;
CREATE TABLE `dd_my_bank` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uid` int(11) NOT NULL,
  `number` varchar(32) NOT NULL,
  `name` varchar(45) NOT NULL,
  `bid` int(11) NOT NULL,
  `create_time` int(11) NOT NULL,
  `update_time` int(11) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 COMMENT='我的银行卡';

-- ----------------------------
-- Records of dd_my_bank
-- ----------------------------
BEGIN;
INSERT INTO `dd_my_bank` VALUES (1, 57, '6214857807098621', '李飞恒', 14, 1624458022, 1624458022);
INSERT INTO `dd_my_bank` VALUES (2, 29, '6214857807098621', '李飞恒', 14, 1624520525, 1624520525);
INSERT INTO `dd_my_bank` VALUES (3, 48, '6222034000040968079', '李飞恒', 1, 1625019249, 1625019249);
COMMIT;

-- ----------------------------
-- Table structure for dd_partner_pivot
-- ----------------------------
DROP TABLE IF EXISTS `dd_partner_pivot`;
CREATE TABLE `dd_partner_pivot` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `uid` int(10) unsigned NOT NULL,
  `pid` int(10) unsigned NOT NULL COMMENT '上级ID',
  `sid` int(11) NOT NULL COMMENT '战略联盟ID',
  `create_time` int(11) NOT NULL,
  `update_time` int(11) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=28 DEFAULT CHARSET=utf8 COMMENT='我的上级（绑定邀请码）';

-- ----------------------------
-- Records of dd_partner_pivot
-- ----------------------------
BEGIN;
INSERT INTO `dd_partner_pivot` VALUES (4, 42, 42, 3, 1624472944, 1624472944);
INSERT INTO `dd_partner_pivot` VALUES (5, 22, 22, 4, 1624473212, 1624473212);
INSERT INTO `dd_partner_pivot` VALUES (6, 25, 22, 4, 1624477610, 1624477610);
INSERT INTO `dd_partner_pivot` VALUES (7, 24, 22, 4, 1624477714, 1624477714);
INSERT INTO `dd_partner_pivot` VALUES (8, 26, 22, 4, 1624477877, 1624477877);
INSERT INTO `dd_partner_pivot` VALUES (9, 33, 26, 4, 1624478001, 1624478001);
INSERT INTO `dd_partner_pivot` VALUES (10, 29, 25, 4, 1624478273, 1624478273);
INSERT INTO `dd_partner_pivot` VALUES (11, 27, 22, 4, 1624493366, 1624493366);
INSERT INTO `dd_partner_pivot` VALUES (12, 23, 22, 4, 1624494479, 1624494479);
INSERT INTO `dd_partner_pivot` VALUES (13, 34, 22, 4, 1624496791, 1624496791);
INSERT INTO `dd_partner_pivot` VALUES (14, 30, 22, 4, 1624510624, 1624510624);
INSERT INTO `dd_partner_pivot` VALUES (15, 31, 22, 4, 1624510655, 1624510655);
INSERT INTO `dd_partner_pivot` VALUES (16, 44, 22, 4, 1624523523, 1624523523);
INSERT INTO `dd_partner_pivot` VALUES (17, 37, 25, 4, 1624524377, 1624524377);
INSERT INTO `dd_partner_pivot` VALUES (18, 39, 22, 4, 1624821385, 1624821385);
INSERT INTO `dd_partner_pivot` VALUES (19, 35, 22, 4, 1624854820, 1624854820);
INSERT INTO `dd_partner_pivot` VALUES (20, 46, 22, 4, 1625006861, 1625006861);
INSERT INTO `dd_partner_pivot` VALUES (21, 47, 25, 4, 1625008421, 1625008421);
INSERT INTO `dd_partner_pivot` VALUES (22, 48, 25, 4, 1625017644, 1625017644);
INSERT INTO `dd_partner_pivot` VALUES (23, 38, 25, 4, 1625035495, 1625035495);
INSERT INTO `dd_partner_pivot` VALUES (24, 49, 25, 4, 1625040467, 1625040467);
INSERT INTO `dd_partner_pivot` VALUES (25, 50, 49, 4, 1625040798, 1625040798);
INSERT INTO `dd_partner_pivot` VALUES (26, 51, 50, 4, 1625040999, 1625040999);
INSERT INTO `dd_partner_pivot` VALUES (27, 52, 49, 4, 1625042187, 1625042187);
COMMIT;

-- ----------------------------
-- Table structure for dd_resume_basic_information
-- ----------------------------
DROP TABLE IF EXISTS `dd_resume_basic_information`;
CREATE TABLE `dd_resume_basic_information` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uid` int(11) NOT NULL,
  `origin` varchar(45) NOT NULL,
  `marriage` int(11) NOT NULL,
  `nation` varchar(45) NOT NULL,
  `education` varchar(45) NOT NULL,
  `speciality` varchar(45) NOT NULL,
  `sos_name` varchar(45) NOT NULL,
  `sos_phone` varchar(45) NOT NULL,
  `update_time` int(11) NOT NULL,
  `create_time` int(11) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8 COMMENT='简历基本资料';

-- ----------------------------
-- Records of dd_resume_basic_information
-- ----------------------------
BEGIN;
INSERT INTO `dd_resume_basic_information` VALUES (4, 54, '北京市 北京市 西城区', 0, '汉族', '中专学历', '很多', '高给合伙人', '13800138003', 1624306548, 1624306548);
INSERT INTO `dd_resume_basic_information` VALUES (5, 22, '北京市 北京市 东城区', 0, '汉族', '高中学历', '同仁堂与否认识', '蛋蛋', '13800138000', 1625007511, 1625007511);
INSERT INTO `dd_resume_basic_information` VALUES (6, 46, '广东 深圳市 南山区', 0, '汉族', '本科学历', '玩游戏', '李先生', '1380038030', 1625007684, 1625007684);
INSERT INTO `dd_resume_basic_information` VALUES (7, 25, '湖北 十堰市 郧西县', 0, '汉族', '高中学历', '1213121251', '初级', '13800138003', 1625018493, 1625018493);
COMMIT;

-- ----------------------------
-- Table structure for dd_resume_educational_experience
-- ----------------------------
DROP TABLE IF EXISTS `dd_resume_educational_experience`;
CREATE TABLE `dd_resume_educational_experience` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uid` int(11) NOT NULL,
  `education` varchar(45) NOT NULL,
  `school` varchar(45) NOT NULL,
  `major` varchar(45) NOT NULL,
  `graduation_time` varchar(45) NOT NULL,
  `update_time` int(11) NOT NULL,
  `create_time` int(11) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='简历学历';

-- ----------------------------
-- Table structure for dd_resume_work_experience
-- ----------------------------
DROP TABLE IF EXISTS `dd_resume_work_experience`;
CREATE TABLE `dd_resume_work_experience` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `company_name` varchar(45) NOT NULL,
  `company_address` varchar(45) NOT NULL,
  `company_phone` varchar(45) NOT NULL,
  `company_job` varchar(45) NOT NULL,
  `work_time` varchar(45) NOT NULL,
  `dimission_time` varchar(45) NOT NULL,
  `work_content` varchar(45) NOT NULL,
  `uid` int(11) NOT NULL,
  `update_time` int(11) NOT NULL,
  `create_time` int(11) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 COMMENT='简历工作经验';

-- ----------------------------
-- Records of dd_resume_work_experience
-- ----------------------------
BEGIN;
INSERT INTO `dd_resume_work_experience` VALUES (3, '北京电机集团', '北京市西城区西东北路1680号', '01026885369', '总裁', '10年', '2015-6-22', '负责打游戏通关，吃宵夜', 54, 1624306782, 1624306782);
COMMIT;

-- ----------------------------
-- Table structure for dd_roles_pivot
-- ----------------------------
DROP TABLE IF EXISTS `dd_roles_pivot`;
CREATE TABLE `dd_roles_pivot` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uid` int(11) NOT NULL DEFAULT '0',
  `rid` int(11) NOT NULL DEFAULT '0' COMMENT '角色ID',
  `create_time` int(11) NOT NULL,
  `update_time` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=184 DEFAULT CHARSET=utf8 COMMENT='用户角色列表';

-- ----------------------------
-- Records of dd_roles_pivot
-- ----------------------------
BEGIN;
INSERT INTO `dd_roles_pivot` VALUES (43, 22, 1, 1624472663, 1624472663, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (44, 23, 1, 1624472669, 1624472669, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (45, 24, 1, 1624472676, 1624472676, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (46, 25, 1, 1624472680, 1624472680, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (47, 26, 1, 1624472684, 1624472684, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (48, 27, 1, 1624472687, 1624472687, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (49, 28, 1, 1624472691, 1624472691, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (50, 29, 1, 1624472695, 1624472695, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (51, 30, 1, 1624472699, 1624472699, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (52, 31, 1, 1624472703, 1624472703, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (53, 32, 1, 1624472707, 1624472707, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (54, 33, 1, 1624472711, 1624472711, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (55, 34, 1, 1624472714, 1624472714, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (56, 35, 1, 1624472719, 1624472719, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (57, 36, 1, 1624472722, 1624472722, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (58, 37, 1, 1624472726, 1624472726, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (59, 38, 1, 1624472730, 1624472730, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (60, 39, 1, 1624472733, 1624472733, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (61, 40, 1, 1624472737, 1624472737, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (62, 41, 1, 1624472742, 1624472742, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (63, 42, 1, 1624472746, 1624472746, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (64, 42, 4, 1624472944, 1624472944, '初级合伙人');
INSERT INTO `dd_roles_pivot` VALUES (65, 42, 5, 1624472944, 1624472944, '高级合伙人');
INSERT INTO `dd_roles_pivot` VALUES (66, 42, 7, 1624472944, 1624472944, '战略联盟');
INSERT INTO `dd_roles_pivot` VALUES (67, 22, 9, 1624472983, 1624472983, '驻场经理');
INSERT INTO `dd_roles_pivot` VALUES (68, 22, 11, 1624472984, 1624472984, '业务员');
INSERT INTO `dd_roles_pivot` VALUES (69, 22, 12, 1624472985, 1624472985, '人事部');
INSERT INTO `dd_roles_pivot` VALUES (70, 22, 13, 1624472986, 1624472986, '财务部');
INSERT INTO `dd_roles_pivot` VALUES (71, 22, 14, 1624472987, 1624472987, '总经理');
INSERT INTO `dd_roles_pivot` VALUES (72, 22, 100, 1624473022, 1624473022, '管理员');
INSERT INTO `dd_roles_pivot` VALUES (74, 22, 15, 1624473079, 1624473079, '蛋蛋');
INSERT INTO `dd_roles_pivot` VALUES (81, 22, 4, 1624473212, 1624473212, '初级合伙人');
INSERT INTO `dd_roles_pivot` VALUES (82, 22, 5, 1624473212, 1624473212, '高级合伙人');
INSERT INTO `dd_roles_pivot` VALUES (83, 22, 7, 1624473212, 1624473212, '战略联盟');
INSERT INTO `dd_roles_pivot` VALUES (84, 42, 100, 1624475932, 1624475932, '管理员');
INSERT INTO `dd_roles_pivot` VALUES (85, 42, 11, 1624475933, 1624475933, '业务员');
INSERT INTO `dd_roles_pivot` VALUES (86, 42, 12, 1624475940, 1624475940, '人事部');
INSERT INTO `dd_roles_pivot` VALUES (87, 42, 9, 1624475941, 1624475941, '驻场经理');
INSERT INTO `dd_roles_pivot` VALUES (88, 42, 13, 1624475942, 1624475942, '财务部');
INSERT INTO `dd_roles_pivot` VALUES (89, 43, 1, 1624476066, 1624476066, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (90, 43, 9, 1624476090, 1624476090, '驻场经理');
INSERT INTO `dd_roles_pivot` VALUES (91, 43, 11, 1624476091, 1624476091, '业务员');
INSERT INTO `dd_roles_pivot` VALUES (92, 43, 12, 1624476092, 1624476092, '人事部');
INSERT INTO `dd_roles_pivot` VALUES (93, 43, 13, 1624476093, 1624476093, '财务部');
INSERT INTO `dd_roles_pivot` VALUES (94, 43, 100, 1624476095, 1624476095, '管理员');
INSERT INTO `dd_roles_pivot` VALUES (95, 27, 8, 1624477067, 1624477067, '驻场老师');
INSERT INTO `dd_roles_pivot` VALUES (96, 25, 2, 1624477610, 1624477610, '准工人');
INSERT INTO `dd_roles_pivot` VALUES (97, 25, 4, 1624477657, 1624477657, '初级合伙人');
INSERT INTO `dd_roles_pivot` VALUES (98, 24, 2, 1624477714, 1624477714, '准工人');
INSERT INTO `dd_roles_pivot` VALUES (99, 24, 4, 1624477754, 1624477754, '初级合伙人');
INSERT INTO `dd_roles_pivot` VALUES (100, 24, 5, 1624477797, 1624477797, '高级合伙人');
INSERT INTO `dd_roles_pivot` VALUES (101, 26, 2, 1624477877, 1624477877, '准工人');
INSERT INTO `dd_roles_pivot` VALUES (102, 26, 4, 1624477920, 1624477920, '初级合伙人');
INSERT INTO `dd_roles_pivot` VALUES (103, 33, 2, 1624478001, 1624478001, '准工人');
INSERT INTO `dd_roles_pivot` VALUES (104, 33, 4, 1624478036, 1624478036, '初级合伙人');
INSERT INTO `dd_roles_pivot` VALUES (105, 26, 6, 1624478036, 1624478036, '准高级合伙人');
INSERT INTO `dd_roles_pivot` VALUES (106, 29, 2, 1624478273, 1624478273, '准工人');
INSERT INTO `dd_roles_pivot` VALUES (108, 27, 2, 1624493366, 1624493366, '准工人');
INSERT INTO `dd_roles_pivot` VALUES (109, 23, 2, 1624494479, 1624494479, '准工人');
INSERT INTO `dd_roles_pivot` VALUES (110, 23, 4, 1624494520, 1624494520, '初级合伙人');
INSERT INTO `dd_roles_pivot` VALUES (111, 23, 5, 1624494575, 1624494575, '高级合伙人');
INSERT INTO `dd_roles_pivot` VALUES (112, 23, 7, 1624494676, 1624494676, '战略联盟');
INSERT INTO `dd_roles_pivot` VALUES (113, 22, 10, 1624494794, 1624494794, '工厂HR');
INSERT INTO `dd_roles_pivot` VALUES (114, 23, 10, 1624494798, 1624494798, '工厂HR');
INSERT INTO `dd_roles_pivot` VALUES (115, 24, 10, 1624494802, 1624494802, '工厂HR');
INSERT INTO `dd_roles_pivot` VALUES (116, 25, 10, 1624494810, 1624494810, '工厂HR');
INSERT INTO `dd_roles_pivot` VALUES (117, 27, 10, 1624494816, 1624494816, '工厂HR');
INSERT INTO `dd_roles_pivot` VALUES (120, 34, 2, 1624496791, 1624496791, '准工人');
INSERT INTO `dd_roles_pivot` VALUES (122, 30, 2, 1624510625, 1624510625, '准工人');
INSERT INTO `dd_roles_pivot` VALUES (123, 31, 2, 1624510655, 1624510655, '准工人');
INSERT INTO `dd_roles_pivot` VALUES (124, 44, 1, 1624523100, 1624523100, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (125, 44, 2, 1624523523, 1624523523, '准工人');
INSERT INTO `dd_roles_pivot` VALUES (126, 44, 3, 1624524068, 1624524068, '工人');
INSERT INTO `dd_roles_pivot` VALUES (127, 44, 11, 1624524134, 1624524134, '业务员');
INSERT INTO `dd_roles_pivot` VALUES (128, 44, 100, 1624524138, 1624524138, '管理员');
INSERT INTO `dd_roles_pivot` VALUES (129, 37, 2, 1624524377, 1624524377, '准工人');
INSERT INTO `dd_roles_pivot` VALUES (130, 22, 8, 1624524839, 1624524839, '驻场老师');
INSERT INTO `dd_roles_pivot` VALUES (131, 45, 1, 1624533578, 1624533578, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (132, 39, 2, 1624821385, 1624821385, '准工人');
INSERT INTO `dd_roles_pivot` VALUES (133, 39, 3, 1624821455, 1624821455, '工人');
INSERT INTO `dd_roles_pivot` VALUES (134, 30, 3, 1624835753, 1624835753, '工人');
INSERT INTO `dd_roles_pivot` VALUES (135, 35, 2, 1624854820, 1624854820, '准工人');
INSERT INTO `dd_roles_pivot` VALUES (136, 45, 9, 1624863432, 1624863432, '驻场经理');
INSERT INTO `dd_roles_pivot` VALUES (137, 45, 13, 1624863434, 1624863434, '财务部');
INSERT INTO `dd_roles_pivot` VALUES (138, 34, 3, 1624951125, 1624951125, '工人');
INSERT INTO `dd_roles_pivot` VALUES (139, 46, 1, 1625004212, 1625004212, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (140, 46, 2, 1625006861, 1625006861, '准工人');
INSERT INTO `dd_roles_pivot` VALUES (141, 47, 1, 1625008394, 1625008394, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (142, 47, 2, 1625008421, 1625008421, '准工人');
INSERT INTO `dd_roles_pivot` VALUES (143, 47, 3, 1625008657, 1625008657, '工人');
INSERT INTO `dd_roles_pivot` VALUES (144, 48, 1, 1625016719, 1625016719, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (145, 48, 2, 1625017644, 1625017644, '准工人');
INSERT INTO `dd_roles_pivot` VALUES (147, 48, 10, 1625022883, 1625022883, '工厂HR');
INSERT INTO `dd_roles_pivot` VALUES (148, 32, 10, 1625023195, 1625023195, '工厂HR');
INSERT INTO `dd_roles_pivot` VALUES (149, 48, 3, 1625023575, 1625023575, '工人');
INSERT INTO `dd_roles_pivot` VALUES (150, 48, 11, 1625025779, 1625025779, '业务员');
INSERT INTO `dd_roles_pivot` VALUES (151, 48, 4, 1625025814, 1625025814, '初级合伙人');
INSERT INTO `dd_roles_pivot` VALUES (152, 25, 6, 1625025814, 1625025814, '准高级合伙人');
INSERT INTO `dd_roles_pivot` VALUES (153, 48, 5, 1625025869, 1625025869, '高级合伙人');
INSERT INTO `dd_roles_pivot` VALUES (154, 23, 8, 1625027263, 1625027263, '驻场老师');
INSERT INTO `dd_roles_pivot` VALUES (155, 24, 8, 1625027274, 1625027274, '驻场老师');
INSERT INTO `dd_roles_pivot` VALUES (156, 39, 10, 1625028164, 1625028164, '工厂HR');
INSERT INTO `dd_roles_pivot` VALUES (157, 26, 10, 1625028200, 1625028200, '工厂HR');
INSERT INTO `dd_roles_pivot` VALUES (158, 48, 100, 1625029240, 1625029240, '管理员');
INSERT INTO `dd_roles_pivot` VALUES (159, 48, 14, 1625029244, 1625029244, '总经理');
INSERT INTO `dd_roles_pivot` VALUES (161, 38, 2, 1625035495, 1625035495, '准工人');
INSERT INTO `dd_roles_pivot` VALUES (162, 28, 10, 1625035617, 1625035617, '工厂HR');
INSERT INTO `dd_roles_pivot` VALUES (163, 30, 10, 1625035727, 1625035727, '工厂HR');
INSERT INTO `dd_roles_pivot` VALUES (164, 31, 10, 1625035736, 1625035736, '工厂HR');
INSERT INTO `dd_roles_pivot` VALUES (166, 38, 3, 1625036534, 1625036534, '工人');
INSERT INTO `dd_roles_pivot` VALUES (167, 49, 1, 1625040344, 1625040344, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (168, 49, 2, 1625040467, 1625040467, '准工人');
INSERT INTO `dd_roles_pivot` VALUES (169, 49, 4, 1625040685, 1625040685, '初级合伙人');
INSERT INTO `dd_roles_pivot` VALUES (170, 50, 1, 1625040756, 1625040756, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (171, 50, 2, 1625040798, 1625040798, '准工人');
INSERT INTO `dd_roles_pivot` VALUES (172, 50, 4, 1625040922, 1625040922, '初级合伙人');
INSERT INTO `dd_roles_pivot` VALUES (173, 49, 6, 1625040922, 1625040922, '准高级合伙人');
INSERT INTO `dd_roles_pivot` VALUES (174, 51, 1, 1625040963, 1625040963, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (175, 51, 2, 1625040999, 1625040999, '准工人');
INSERT INTO `dd_roles_pivot` VALUES (176, 51, 4, 1625041408, 1625041408, '初级合伙人');
INSERT INTO `dd_roles_pivot` VALUES (177, 50, 6, 1625041408, 1625041408, '准高级合伙人');
INSERT INTO `dd_roles_pivot` VALUES (178, 51, 5, 1625041457, 1625041457, '高级合伙人');
INSERT INTO `dd_roles_pivot` VALUES (179, 51, 3, 1625041628, 1625041628, '工人');
INSERT INTO `dd_roles_pivot` VALUES (180, 50, 3, 1625042021, 1625042021, '工人');
INSERT INTO `dd_roles_pivot` VALUES (181, 52, 1, 1625042092, 1625042092, '普通用户');
INSERT INTO `dd_roles_pivot` VALUES (182, 52, 2, 1625042187, 1625042187, '准工人');
INSERT INTO `dd_roles_pivot` VALUES (183, 52, 3, 1625042312, 1625042312, '工人');
COMMIT;

-- ----------------------------
-- Table structure for dd_roles_type
-- ----------------------------
DROP TABLE IF EXISTS `dd_roles_type`;
CREATE TABLE `dd_roles_type` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `title` varchar(45) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=101 DEFAULT CHARSET=utf8 COMMENT='角色类型';

-- ----------------------------
-- Records of dd_roles_type
-- ----------------------------
BEGIN;
INSERT INTO `dd_roles_type` VALUES (1, '普通用户');
INSERT INTO `dd_roles_type` VALUES (2, '准工人');
INSERT INTO `dd_roles_type` VALUES (3, '工人');
INSERT INTO `dd_roles_type` VALUES (4, '初级合伙人');
INSERT INTO `dd_roles_type` VALUES (5, '高级合伙人');
INSERT INTO `dd_roles_type` VALUES (6, '准高级合伙人');
INSERT INTO `dd_roles_type` VALUES (7, '战略联盟');
INSERT INTO `dd_roles_type` VALUES (8, '驻场老师');
INSERT INTO `dd_roles_type` VALUES (9, '驻场经理');
INSERT INTO `dd_roles_type` VALUES (10, '工厂HR');
INSERT INTO `dd_roles_type` VALUES (11, '业务员');
INSERT INTO `dd_roles_type` VALUES (12, '人事部');
INSERT INTO `dd_roles_type` VALUES (13, '财务部');
INSERT INTO `dd_roles_type` VALUES (14, '总经理');
INSERT INTO `dd_roles_type` VALUES (15, '蛋蛋');
INSERT INTO `dd_roles_type` VALUES (100, '管理员');
COMMIT;

-- ----------------------------
-- Table structure for dd_seting
-- ----------------------------
DROP TABLE IF EXISTS `dd_seting`;
CREATE TABLE `dd_seting` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `phone` varchar(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `create_time` int(11) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Table structure for dd_shop_cart
-- ----------------------------
DROP TABLE IF EXISTS `dd_shop_cart`;
CREATE TABLE `dd_shop_cart` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `cid` int(11) NOT NULL COMMENT '商品id',
  `uid` int(11) NOT NULL COMMENT '下单用户id',
  `sid` int(11) NOT NULL COMMENT '商家id',
  `count` int(11) NOT NULL COMMENT '购买数量',
  `status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '0未支付\n1已支付',
  `price` varchar(45) NOT NULL DEFAULT '0.00' COMMENT '价格',
  `create_time` int(11) NOT NULL,
  `update_time` int(11) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8 COMMENT='购物车\n';

-- ----------------------------
-- Records of dd_shop_cart
-- ----------------------------
BEGIN;
INSERT INTO `dd_shop_cart` VALUES (1, 1, 52, 52, 2, 0, '268', 1624380210, 1624419277);
INSERT INTO `dd_shop_cart` VALUES (2, 1, 57, 52, 1, 0, '268', 1624419305, 1624419305);
INSERT INTO `dd_shop_cart` VALUES (4, 2, 22, 27, 1, 0, '89', 1624812589, 1624812589);
INSERT INTO `dd_shop_cart` VALUES (5, 2, 46, 27, 1, 0, '89', 1625006626, 1625006626);
INSERT INTO `dd_shop_cart` VALUES (6, 3, 48, 27, 1, 0, '18', 1625017467, 1625017467);
COMMIT;

-- ----------------------------
-- Table structure for dd_shop_commodity
-- ----------------------------
DROP TABLE IF EXISTS `dd_shop_commodity`;
CREATE TABLE `dd_shop_commodity` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '商品列表id',
  `name` varchar(45) NOT NULL,
  `tid` int(11) NOT NULL COMMENT '商品类别',
  `type` int(11) NOT NULL DEFAULT '0' COMMENT '1: banner\n',
  `price` varchar(45) NOT NULL COMMENT '商品价格',
  `uid` int(11) NOT NULL,
  `status` int(11) NOT NULL DEFAULT '0' COMMENT '0 未发布 1已发布 2已下架',
  `text` varchar(1204) NOT NULL COMMENT '商品描述',
  `images` varchar(1204) NOT NULL DEFAULT '[]',
  `create_time` int(11) NOT NULL,
  `update_time` int(11) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8 COMMENT='商城-商品\n';

-- ----------------------------
-- Records of dd_shop_commodity
-- ----------------------------
BEGIN;
INSERT INTO `dd_shop_commodity` VALUES (2, '女装', 5, 1, '89', 27, 1, '2022夏天新款女装', '[\"\\/uploads\\/images\\/e9\\/4aa240d9446c613a2a1aed37ece365.jpg\",\"\\/uploads\\/images\\/5a\\/010d141dca24e426dbb64dcb3e5b73.jpg\",\"\\/uploads\\/images\\/75\\/059aceda9bd65462bcce65a6fb3134.jpg\",\"\\/uploads\\/images\\/fe\\/a0121a293ffb5c33053e98f847fd64.jpg\"]', 1624503563, 1624503749);
INSERT INTO `dd_shop_commodity` VALUES (3, '亚健康的食品', 5, 1, '18', 27, 1, '亚健康食品', '[\"\\/uploads\\/images\\/3e\\/88f2c4c7d07eb8851c8530d0db60c0.jpg\",\"\\/uploads\\/images\\/5b\\/f235ab4c46a93ca09cd0c8afbe265d.jpg\",\"\\/uploads\\/images\\/26\\/8b9346cb2d0f21f429b972d7b77b47.jpg\",\"\\/uploads\\/images\\/b7\\/eb2b865375d72230e70d2c5b28bc90.jpg\"]', 1624503724, 1625006489);
INSERT INTO `dd_shop_commodity` VALUES (4, '2021新款手机', 5, 0, '10', 34, 1, '号给我下了个', '[\"\\/uploads\\/images\\/11\\/5dfa1877f961817a8c836741894642.jpg\"]', 1624521241, 1625006483);
INSERT INTO `dd_shop_commodity` VALUES (5, '2020LV包包', 5, 0, '100', 22, 1, '宝贝正品哦', '[\"\\/uploads\\/images\\/68\\/3c47755b3d1b8260cfd11016d652d8.jpg\",\"\\/uploads\\/images\\/41\\/4afa97a3247c92701124f2a43180be.jpg\",\"\\/uploads\\/images\\/18\\/80e9d0ddac2d5a8612fe55e2a38c05.jpg\",\"\\/uploads\\/images\\/8b\\/1584317681cae55763459d973ba2c3.jpg\"]', 1624843290, 1624843312);
INSERT INTO `dd_shop_commodity` VALUES (6, '女裤', 3, 1, '10', 48, 1, '女装长裤', '[\"\\/uploads\\/images\\/e2\\/e7a8c15ed4dd89bd7316b3c4695d07.jpg\"]', 1625018607, 1625021445);
COMMIT;

-- ----------------------------
-- Table structure for dd_shop_order
-- ----------------------------
DROP TABLE IF EXISTS `dd_shop_order`;
CREATE TABLE `dd_shop_order` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '商品列表',
  `cid` int(11) DEFAULT NULL COMMENT '商品id',
  `uid` int(11) DEFAULT NULL COMMENT '买家',
  `euid` int(11) DEFAULT NULL COMMENT '商家',
  `status` int(11) DEFAULT NULL COMMENT '订单状态\n0 未发货\n1 已发货\n2 已签收\n3 完成\n4 关闭',
  `addid` varchar(45) DEFAULT NULL,
  `price` varchar(45) DEFAULT NULL,
  `count` int(11) DEFAULT '0',
  `create_time` int(11) DEFAULT NULL,
  `update_time` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 COMMENT='商城-订单\n';

-- ----------------------------
-- Records of dd_shop_order
-- ----------------------------
BEGIN;
INSERT INTO `dd_shop_order` VALUES (1, 3, 34, 27, NULL, '1', '18', 1, 1624521497, 1624521497);
INSERT INTO `dd_shop_order` VALUES (2, 4, 34, 34, NULL, '1', '10', 1, 1624521538, 1624521538);
INSERT INTO `dd_shop_order` VALUES (3, 3, 25, 27, NULL, '3', '18', 1, 1625037654, 1625037654);
COMMIT;

-- ----------------------------
-- Table structure for dd_shop_order_addres
-- ----------------------------
DROP TABLE IF EXISTS `dd_shop_order_addres`;
CREATE TABLE `dd_shop_order_addres` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `province` varchar(45) NOT NULL,
  `city` varchar(45) NOT NULL,
  `area` varchar(45) NOT NULL,
  `address` varchar(128) NOT NULL,
  `name` varchar(45) NOT NULL,
  `phone` varchar(45) NOT NULL,
  `create_time` int(11) NOT NULL,
  `update_time` int(11) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='订单地址';

-- ----------------------------
-- Table structure for dd_shop_type
-- ----------------------------
DROP TABLE IF EXISTS `dd_shop_type`;
CREATE TABLE `dd_shop_type` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(45) NOT NULL,
  `image` varchar(255) NOT NULL,
  `create_time` int(11) NOT NULL,
  `update_time` int(11) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8 COMMENT='商品类型\n';

-- ----------------------------
-- Records of dd_shop_type
-- ----------------------------
BEGIN;
INSERT INTO `dd_shop_type` VALUES (1, '床上用品', '/uploads/images/97/81b7b72d47c4b8b5f44621e88f2e3f.jpg', 1624379599, 1624379599);
INSERT INTO `dd_shop_type` VALUES (2, '童装', '/uploads/images/a1/6e4310c885584c74fc09237191cd0b.jpg', 1624379706, 1624379706);
INSERT INTO `dd_shop_type` VALUES (3, '电子数码', '/uploads/images/8a/ba8c51521f03a13ddf5bd7a6544c69.jpg', 1624379777, 1624379777);
INSERT INTO `dd_shop_type` VALUES (4, '保健品', '/uploads/images/37/d83c386fa90f49bd38560a10753c66.jpg', 1624379822, 1624379822);
INSERT INTO `dd_shop_type` VALUES (5, '推荐商品', '/uploads/images/c7/767f91e2f2a6f4cd734d2797aacc71.jpg', 1624379922, 1624379922);
INSERT INTO `dd_shop_type` VALUES (6, '生活用品', '/uploads/images/3c/e3fb8ae0ecbb87deff3e603694a9bc.jpg', 1625021498, 1625021498);
COMMIT;

-- ----------------------------
-- Table structure for dd_sign_in
-- ----------------------------
DROP TABLE IF EXISTS `dd_sign_in`;
CREATE TABLE `dd_sign_in` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uid` int(11) NOT NULL,
  `reward` varchar(45) NOT NULL DEFAULT '0' COMMENT '奖励:蛋蛋币',
  `isCheck` tinyint(4) NOT NULL DEFAULT '0' COMMENT 'isCheck',
  `create_time` int(11) NOT NULL,
  `type` varchar(45) DEFAULT '0' COMMENT '0 ：签到\n1：分享',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8 COMMENT='签到';

-- ----------------------------
-- Records of dd_sign_in
-- ----------------------------
BEGIN;
INSERT INTO `dd_sign_in` VALUES (1, 22, '5.0', 0, 1624478736, '0');
INSERT INTO `dd_sign_in` VALUES (2, 23, '5.0', 0, 1624494761, '0');
INSERT INTO `dd_sign_in` VALUES (3, 29, '5.0', 0, 1624509987, '0');
INSERT INTO `dd_sign_in` VALUES (4, 24, '5.0', 0, 1624510331, '0');
INSERT INTO `dd_sign_in` VALUES (5, 25, '5.0', 0, 1624510383, '0');
INSERT INTO `dd_sign_in` VALUES (6, 28, '5.0', 0, 1624510503, '0');
INSERT INTO `dd_sign_in` VALUES (7, 30, '5.0', 0, 1624510615, '0');
INSERT INTO `dd_sign_in` VALUES (8, 27, '5.0', 0, 1624515921, '0');
INSERT INTO `dd_sign_in` VALUES (9, 34, '5.0', 0, 1624521031, '0');
INSERT INTO `dd_sign_in` VALUES (10, 44, '5.0', 0, 1624523287, '0');
INSERT INTO `dd_sign_in` VALUES (11, 37, '5.0', 0, 1624524587, '0');
INSERT INTO `dd_sign_in` VALUES (12, 22, '5.0', 0, 1625003576, '0');
INSERT INTO `dd_sign_in` VALUES (13, 46, '5.0', 0, 1625005827, '0');
INSERT INTO `dd_sign_in` VALUES (14, 48, '5.0', 0, 1625017132, '0');
INSERT INTO `dd_sign_in` VALUES (15, 25, '5.0', 0, 1625019576, '0');
COMMIT;

-- ----------------------------
-- Table structure for dd_strategic_alliance
-- ----------------------------
DROP TABLE IF EXISTS `dd_strategic_alliance`;
CREATE TABLE `dd_strategic_alliance` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `uid` int(10) unsigned NOT NULL DEFAULT '0',
  `name` varchar(45) DEFAULT NULL COMMENT '战略名称',
  `province` varchar(45) DEFAULT NULL COMMENT '省',
  `city` varchar(45) DEFAULT NULL COMMENT '市',
  `county` varchar(45) DEFAULT NULL COMMENT '区',
  `address` varchar(45) DEFAULT NULL COMMENT '地址',
  `sos_name` varchar(45) DEFAULT NULL COMMENT '紧急联系人',
  `sos_phone` varchar(45) DEFAULT NULL COMMENT '紧急联系人phone',
  `jp_dividend` varchar(45) DEFAULT NULL COMMENT '初级分红比例',
  `sp_dividend` varchar(45) DEFAULT NULL COMMENT '高级全红比例',
  `sa_dividend` varchar(45) DEFAULT NULL COMMENT '战略分红比例',
  `dd_dividend` varchar(45) DEFAULT NULL COMMENT '蛋蛋分红比例',
  `dd_service_charge` varchar(45) DEFAULT '0.00' COMMENT '手续费,不是提现手续费',
  `create_time` int(11) DEFAULT NULL,
  `update_time` int(11) DEFAULT NULL,
  `status` tinyint(4) DEFAULT '0' COMMENT '状态',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8 COMMENT='战略合伙人\n';

-- ----------------------------
-- Records of dd_strategic_alliance
-- ----------------------------
BEGIN;
INSERT INTO `dd_strategic_alliance` VALUES (4, 22, '蛋蛋公司', '', '', '', '', '蛋蛋', '13800138000', '45.0', '16.5', '27.5', '11.0', '0.00', 1624473203, 1624473212, 1);
INSERT INTO `dd_strategic_alliance` VALUES (5, 23, '山东战略联盟公司', '山东', '济南市', '历下区', '历下人民路48号', '山东历下战略联盟', '13800138001', '45.0', '16.5', '27.5', '11.0', '0.00', 1624494656, 1624494676, 1);
INSERT INTO `dd_strategic_alliance` VALUES (6, 42, '20公司', '', '', '', '', '13800138020', '20', '45.0', '16.5', '27.5', '11.0', '0.00', 1625026491, 1625026505, 1);
COMMIT;

-- ----------------------------
-- Table structure for dd_system
-- ----------------------------
DROP TABLE IF EXISTS `dd_system`;
CREATE TABLE `dd_system` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `distance` varchar(45) NOT NULL COMMENT '距离设置',
  `sign_in_reward` varchar(45) NOT NULL COMMENT '签到奖励',
  `share_rewards` varchar(45) NOT NULL COMMENT '分享奖励',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='系统设置\n';

-- ----------------------------
-- Records of dd_system
-- ----------------------------
BEGIN;
INSERT INTO `dd_system` VALUES (1, '3.00', '100.0', '5.0');
COMMIT;

-- ----------------------------
-- Table structure for dd_users
-- ----------------------------
DROP TABLE IF EXISTS `dd_users`;
CREATE TABLE `dd_users` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `code` int(11) NOT NULL DEFAULT '0',
  `username` varchar(32) NOT NULL DEFAULT '',
  `phone` varchar(11) NOT NULL,
  `password` varchar(128) NOT NULL,
  `sex` int(11) NOT NULL DEFAULT '0',
  `age` int(11) NOT NULL DEFAULT '0',
  `birthday` varchar(255) NOT NULL,
  `isAdmin` int(11) NOT NULL DEFAULT '0',
  `isDeath` int(11) NOT NULL DEFAULT '0',
  `said` int(11) NOT NULL DEFAULT '0',
  `avatar` varchar(255) NOT NULL DEFAULT '/resources/avatar.png',
  `registrationID` varchar(128) NOT NULL DEFAULT '',
  `create_time` int(11) NOT NULL,
  `update_time` int(11) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=53 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of dd_users
-- ----------------------------
BEGIN;
INSERT INTO `dd_users` VALUES (22, 999999, '蛋蛋', '13800138000', '4297f44b13955235245b2497399d7a93', 1, 0, '1624472663', 1, 0, 0, '/resources/avatar.png', '1104a897927f32d24ee', 1624472663, 1625007074);
INSERT INTO `dd_users` VALUES (23, 673230, '战略联盟', '13800138001', '4297f44b13955235245b2497399d7a93', 1, 0, '1624472669', 0, 0, 0, '/resources/avatar.png', '1104a897927f5d62c4e', 1624472669, 1625039242);
INSERT INTO `dd_users` VALUES (24, 853250, '高级合伙人', '13800138002', '4297f44b13955235245b2497399d7a93', 0, 0, '1624472676', 0, 0, 0, '/resources/avatar.png', '', 1624472676, 1624477754);
INSERT INTO `dd_users` VALUES (25, 999630, '初级合伙人', '13800138003', '4297f44b13955235245b2497399d7a93', 0, 0, '1624472680', 0, 0, 0, '/resources/avatar.png', '1104a897927f32d24ee', 1624472680, 1624496539);
INSERT INTO `dd_users` VALUES (26, 968390, '准高级合伙人', '13800138004', '4297f44b13955235245b2497399d7a93', 0, 0, '1624472684', 0, 0, 0, '/resources/avatar.png', '', 1624472684, 1624477920);
INSERT INTO `dd_users` VALUES (27, 0, '驻场老师', '13800138005', '4297f44b13955235245b2497399d7a93', 0, 0, '1624472687', 0, 0, 0, '/resources/avatar.png', '101d8559099435b01e2', 1624472687, 1625035959);
INSERT INTO `dd_users` VALUES (28, 0, '工厂HR', '13800138006', '4297f44b13955235245b2497399d7a93', 0, 0, '1624472691', 0, 0, 0, '/resources/avatar.png', '', 1624472691, 1624472691);
INSERT INTO `dd_users` VALUES (29, 0, '工人', '13800138007', '4297f44b13955235245b2497399d7a93', 0, 0, '1624472695', 0, 0, 0, '/resources/avatar.png', '170976fa8a5383cfa3f', 1624472695, 1625015865);
INSERT INTO `dd_users` VALUES (30, 0, '小时工3', '13800138008', '4297f44b13955235245b2497399d7a93', 0, 0, '1624472699', 0, 0, 0, '/resources/avatar.png', '13065ffa4ed9044755a', 1624472699, 1624835657);
INSERT INTO `dd_users` VALUES (31, 0, '代理招聘', '13800138009', '4297f44b13955235245b2497399d7a93', 0, 0, '1624472703', 0, 0, 0, '/resources/avatar.png', '', 1624472703, 1624472703);
INSERT INTO `dd_users` VALUES (32, 0, '电商老板', '13800138010', '4297f44b13955235245b2497399d7a93', 0, 0, '1624472707', 0, 0, 0, '/resources/avatar.png', '13065ffa4ed9044755a', 1624472707, 1625020329);
INSERT INTO `dd_users` VALUES (33, 648210, '绑定准高级合伙人', '13800138011', '4297f44b13955235245b2497399d7a93', 0, 0, '1624472711', 0, 0, 0, '/resources/avatar.png', '', 1624472711, 1624478036);
INSERT INTO `dd_users` VALUES (34, 0, '小时工2', '13800138012', '4297f44b13955235245b2497399d7a93', 0, 0, '1624472714', 0, 0, 0, '/resources/avatar.png', '13065ffa4ed9044755a', 1624472714, 1624936430);
INSERT INTO `dd_users` VALUES (35, 0, '同工同酬', '13800138013', '4297f44b13955235245b2497399d7a93', 0, 0, '1624472719', 0, 0, 0, '/resources/avatar.png', '13065ffa4ed9044755a', 1624472719, 1624924315);
INSERT INTO `dd_users` VALUES (36, 0, '同工同酬2', '13800138014', '4297f44b13955235245b2497399d7a93', 0, 0, '1624472722', 0, 0, 0, '/resources/avatar.png', '', 1624472722, 1624472722);
INSERT INTO `dd_users` VALUES (37, 0, '孔夫子', '13800138015', '4297f44b13955235245b2497399d7a93', 0, 0, '1624472726', 0, 0, 0, '/resources/avatar.png', '', 1624472726, 1625035127);
INSERT INTO `dd_users` VALUES (38, 0, '那多', '13800138016', '4297f44b13955235245b2497399d7a93', 0, 0, '1624472730', 0, 0, 0, '/resources/avatar.png', '170976fa8a53425f2a3', 1624472730, 1625035888);
INSERT INTO `dd_users` VALUES (39, 0, '', '13800138017', '4297f44b13955235245b2497399d7a93', 0, 0, '1624472733', 0, 1, 0, '/resources/avatar.png', '13065ffa4ed9044755a', 1624472733, 1625020298);
INSERT INTO `dd_users` VALUES (40, 0, '', '13800138018', '4297f44b13955235245b2497399d7a93', 0, 0, '1624472737', 0, 0, 0, '/resources/avatar.png', '', 1624472737, 1624472737);
INSERT INTO `dd_users` VALUES (41, 0, '', '13800138019', '4297f44b13955235245b2497399d7a93', 0, 0, '1624472742', 0, 0, 0, '/resources/avatar.png', '', 1624472742, 1624472742);
INSERT INTO `dd_users` VALUES (42, 0, '', '13800138020', '4297f44b13955235245b2497399d7a93', 0, 0, '1624472746', 1, 0, 0, '/resources/avatar.png', '', 1624472746, 1624475932);
INSERT INTO `dd_users` VALUES (43, 0, '业务员', '13800138021', '4297f44b13955235245b2497399d7a93', 0, 0, '1624476066', 1, 0, 0, '/resources/avatar.png', '170976fa8a53425f2a3', 1624476066, 1625028932);
INSERT INTO `dd_users` VALUES (44, 0, '工人2', '15363153911', '4297f44b13955235245b2497399d7a93', 0, 0, '1624523100', 1, 0, 0, '/resources/avatar.png', '13065ffa4ed9044755a', 1624523100, 1624524134);
INSERT INTO `dd_users` VALUES (45, 0, '', '19926841381', 'c8837b23ff8aaa8a2dde915473ce0991', 0, 0, '1624533578', 1, 0, 0, '/resources/avatar.png', '', 1624533578, 1624863432);
INSERT INTO `dd_users` VALUES (46, 0, '李先生', '13800138030', '4297f44b13955235245b2497399d7a93', 1, 0, '1625004212', 0, 0, 0, '/uploads/images/e2/e7a8c15ed4dd89bd7316b3c4695d07.jpg', '170976fa8a5383cfa3f', 1625004212, 1625007850);
INSERT INTO `dd_users` VALUES (47, 0, '用户名', '13800138031', '4297f44b13955235245b2497399d7a93', 0, 0, '1625008394', 0, 0, 0, '/resources/avatar.png', '170976fa8a5383cfa3f', 1625008394, 1625008706);
INSERT INTO `dd_users` VALUES (48, 658790, '杨紫', '18202734591', '3d186804534370c3c817db0563f0e461', 1, 0, '1625016719', 1, 0, 0, '/uploads/images/44/0ab457ec1a93aa40458255a68c1811.jpg', '101d8559099435b01e2', 1625016719, 1625035189);
INSERT INTO `dd_users` VALUES (49, 853290, '01', '13125057751', '4297f44b13955235245b2497399d7a93', 0, 0, '1625040344', 0, 0, 0, '/resources/avatar.png', '', 1625040344, 1625040685);
INSERT INTO `dd_users` VALUES (50, 779970, '02', '13800138100', '4297f44b13955235245b2497399d7a93', 0, 0, '1625040756', 0, 0, 0, '/resources/avatar.png', '', 1625040756, 1625040922);
INSERT INTO `dd_users` VALUES (51, 745930, '101', '13800138101', '4297f44b13955235245b2497399d7a93', 0, 0, '1625040963', 0, 0, 0, '/resources/avatar.png', '1104a897927f5d62c4e', 1625040963, 1625041694);
INSERT INTO `dd_users` VALUES (52, 0, '102', '13800138102', '4297f44b13955235245b2497399d7a93', 0, 0, '1625042092', 0, 0, 0, '/resources/avatar.png', '', 1625042092, 1625042192);
COMMIT;

-- ----------------------------
-- Table structure for dd_versions
-- ----------------------------
DROP TABLE IF EXISTS `dd_versions`;
CREATE TABLE `dd_versions` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `version` varchar(45) NOT NULL,
  `build` int(11) NOT NULL,
  `isStrong` tinyint(4) NOT NULL DEFAULT '0',
  `review` tinyint(4) NOT NULL,
  `url` varchar(255) NOT NULL,
  `title` varchar(45) NOT NULL DEFAULT '版本更新',
  `subtitle` varchar(255) NOT NULL,
  `system` varchar(255) NOT NULL COMMENT '1:ios\n2:android\n3:web',
  `create_time` int(11) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Table structure for dd_wallet_service_charge
-- ----------------------------
DROP TABLE IF EXISTS `dd_wallet_service_charge`;
CREATE TABLE `dd_wallet_service_charge` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '提成手续费',
  `service_charge_for_withdrawal` varchar(45) NOT NULL DEFAULT '0.00' COMMENT '提现手续费',
  `commission_fee` varchar(45) NOT NULL DEFAULT '0.00' COMMENT '提成的提现手续费',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='各种手续费的表\n';

-- ----------------------------
-- Records of dd_wallet_service_charge
-- ----------------------------
BEGIN;
INSERT INTO `dd_wallet_service_charge` VALUES (1, '1.0', '1.5');
COMMIT;

-- ----------------------------
-- Table structure for dd_wallet_type
-- ----------------------------
DROP TABLE IF EXISTS `dd_wallet_type`;
CREATE TABLE `dd_wallet_type` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=20 DEFAULT CHARSET=utf8 COMMENT='账单流水类型\n';

-- ----------------------------
-- Records of dd_wallet_type
-- ----------------------------
BEGIN;
INSERT INTO `dd_wallet_type` VALUES (1, '发工资');
INSERT INTO `dd_wallet_type` VALUES (2, '预支');
INSERT INTO `dd_wallet_type` VALUES (3, '业务提成');
INSERT INTO `dd_wallet_type` VALUES (4, '驻场提成');
INSERT INTO `dd_wallet_type` VALUES (5, '初级分红');
INSERT INTO `dd_wallet_type` VALUES (6, '高级分红');
INSERT INTO `dd_wallet_type` VALUES (7, '战略联盟分红');
INSERT INTO `dd_wallet_type` VALUES (8, '蛋蛋分红');
INSERT INTO `dd_wallet_type` VALUES (9, '卖出');
INSERT INTO `dd_wallet_type` VALUES (10, '消费');
INSERT INTO `dd_wallet_type` VALUES (11, '签到');
INSERT INTO `dd_wallet_type` VALUES (12, '分享');
INSERT INTO `dd_wallet_type` VALUES (13, '工资');
INSERT INTO `dd_wallet_type` VALUES (18, '提现到银行卡');
INSERT INTO `dd_wallet_type` VALUES (19, '创建钱包');
COMMIT;

-- ----------------------------
-- Table structure for dd_wallet_virtual
-- ----------------------------
DROP TABLE IF EXISTS `dd_wallet_virtual`;
CREATE TABLE `dd_wallet_virtual` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `balance` varchar(45) NOT NULL DEFAULT '0.00' COMMENT '余额',
  `egg_coin` varchar(45) NOT NULL DEFAULT '0.00' COMMENT '蛋币',
  `uid` int(11) NOT NULL,
  `create_time` int(11) NOT NULL,
  `update_time` int(11) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=53 DEFAULT CHARSET=utf8 COMMENT='钱包表\n';

-- ----------------------------
-- Records of dd_wallet_virtual
-- ----------------------------
BEGIN;
INSERT INTO `dd_wallet_virtual` VALUES (22, '0', '10', 22, 1624472663, 1625003576);
INSERT INTO `dd_wallet_virtual` VALUES (23, '0.00', '5', 23, 1624472669, 1624494761);
INSERT INTO `dd_wallet_virtual` VALUES (24, '0.00', '5', 24, 1624472676, 1624510331);
INSERT INTO `dd_wallet_virtual` VALUES (25, '340.5', '10', 25, 1624472680, 1625037654);
INSERT INTO `dd_wallet_virtual` VALUES (26, '0.00', '0.00', 26, 1624472684, 1624472684);
INSERT INTO `dd_wallet_virtual` VALUES (27, '0.00', '5', 27, 1624472687, 1624515921);
INSERT INTO `dd_wallet_virtual` VALUES (28, '0.00', '5', 28, 1624472691, 1624510503);
INSERT INTO `dd_wallet_virtual` VALUES (29, '18899.6', '5', 29, 1624472695, 1624520732);
INSERT INTO `dd_wallet_virtual` VALUES (30, '0.00', '5', 30, 1624472699, 1624510615);
INSERT INTO `dd_wallet_virtual` VALUES (31, '0.00', '0.00', 31, 1624472703, 1624472703);
INSERT INTO `dd_wallet_virtual` VALUES (32, '0.00', '0.00', 32, 1624472707, 1624472707);
INSERT INTO `dd_wallet_virtual` VALUES (33, '0.00', '0.00', 33, 1624472711, 1624472711);
INSERT INTO `dd_wallet_virtual` VALUES (34, '836', '2', 34, 1624472714, 1624521538);
INSERT INTO `dd_wallet_virtual` VALUES (35, '0.00', '0.00', 35, 1624472719, 1624472719);
INSERT INTO `dd_wallet_virtual` VALUES (36, '0.00', '0.00', 36, 1624472722, 1624472722);
INSERT INTO `dd_wallet_virtual` VALUES (37, '0.00', '5', 37, 1624472726, 1624524587);
INSERT INTO `dd_wallet_virtual` VALUES (38, '0.00', '0.00', 38, 1624472730, 1624472730);
INSERT INTO `dd_wallet_virtual` VALUES (39, '0.00', '0.00', 39, 1624472733, 1624472733);
INSERT INTO `dd_wallet_virtual` VALUES (40, '0.00', '0.00', 40, 1624472737, 1624472737);
INSERT INTO `dd_wallet_virtual` VALUES (41, '0.00', '0.00', 41, 1624472742, 1624472742);
INSERT INTO `dd_wallet_virtual` VALUES (42, '0.00', '0.00', 42, 1624472746, 1624472746);
INSERT INTO `dd_wallet_virtual` VALUES (43, '0.00', '0.00', 43, 1624476066, 1624476066);
INSERT INTO `dd_wallet_virtual` VALUES (44, '0.00', '5', 44, 1624523100, 1624523287);
INSERT INTO `dd_wallet_virtual` VALUES (45, '0.00', '0.00', 45, 1624533578, 1624533578);
INSERT INTO `dd_wallet_virtual` VALUES (46, '0', '5', 46, 1625004212, 1625005827);
INSERT INTO `dd_wallet_virtual` VALUES (47, '0.00', '0.00', 47, 1625008394, 1625008394);
INSERT INTO `dd_wallet_virtual` VALUES (48, '1800', '5', 48, 1625016719, 1625026205);
INSERT INTO `dd_wallet_virtual` VALUES (49, '0.00', '0.00', 49, 1625040344, 1625040344);
INSERT INTO `dd_wallet_virtual` VALUES (50, '0.00', '0.00', 50, 1625040756, 1625040756);
INSERT INTO `dd_wallet_virtual` VALUES (51, '0.00', '0.00', 51, 1625040963, 1625040963);
INSERT INTO `dd_wallet_virtual` VALUES (52, '0.00', '0.00', 52, 1625042092, 1625042092);
COMMIT;

-- ----------------------------
-- Table structure for dd_wallet_virtual_logs
-- ----------------------------
DROP TABLE IF EXISTS `dd_wallet_virtual_logs`;
CREATE TABLE `dd_wallet_virtual_logs` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '钱包表',
  `wid` int(11) NOT NULL DEFAULT '0' COMMENT '钱包ID',
  `uid` int(11) NOT NULL COMMENT '用户ID',
  `tid` int(11) NOT NULL COMMENT '流水类型',
  `single_number` varchar(64) NOT NULL COMMENT '单号',
  `amount` varchar(45) NOT NULL DEFAULT '0.00' COMMENT '支付价格',
  `egg_coin` varchar(45) NOT NULL DEFAULT '0.00' COMMENT '支付蛋币',
  `amount_type` int(11) NOT NULL DEFAULT '0' COMMENT '金额类型 收入 or 支出',
  `deduction` varchar(45) NOT NULL DEFAULT '0.00' COMMENT '其他扣除费用，如手续费',
  `commission_fee` varchar(45) NOT NULL DEFAULT '0.00' COMMENT '手续费',
  `balance` varchar(45) NOT NULL DEFAULT '0.00' COMMENT '钱包中的余额',
  `total_egg` varchar(45) NOT NULL DEFAULT '0.00' COMMENT '钱包中的蛋币数',
  `create_time` int(11) NOT NULL COMMENT '创建时间',
  `update_time` int(11) NOT NULL COMMENT '更新时间',
  `status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '是否有效',
  `title` varchar(255) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=45 DEFAULT CHARSET=utf8 COMMENT='钱包流水\n';

-- ----------------------------
-- Records of dd_wallet_virtual_logs
-- ----------------------------
BEGIN;
INSERT INTO `dd_wallet_virtual_logs` VALUES (1, 22, 22, 11, '9a11826f32ab76d614633cbce9845b9e', '0.00', '5.0', 1, '0.00', '0.00', '0.00', '5', 1624478736, 1624478736, 1, '签到');
INSERT INTO `dd_wallet_virtual_logs` VALUES (2, 23, 23, 11, '6d210dad482b107cc5cc84520fc74cb9', '0.00', '5.0', 1, '0.00', '0.00', '0.00', '5', 1624494762, 1624494762, 1, '签到');
INSERT INTO `dd_wallet_virtual_logs` VALUES (3, 29, 29, 13, '91947e9bec76bff521bd33c62bdb7357', '2700', '0.00', 1, '0.00', '0.0', '2700', '0.00', 1624504761, 1624504761, 0, '转出');
INSERT INTO `dd_wallet_virtual_logs` VALUES (4, 29, 29, 2, '155b7f1f5febbee5e62309daea1fe5fb', '1800', '0.00', 1, '0.00', '0.00', '4500', '0.00', 1624507254, 1624507254, 1, '预支');
INSERT INTO `dd_wallet_virtual_logs` VALUES (5, 29, 29, 2, 'ee8c0791556b8ce61c24ae45bed18b6d', '1800', '0.00', 1, '0.00', '0.00', '6300', '0.00', 1624507412, 1624507412, 2, '预支');
INSERT INTO `dd_wallet_virtual_logs` VALUES (6, 29, 29, 2, '3cce28859c0265b7379bda5a233b866f', '1800', '0.00', 1, '0.00', '0.00', '8100', '0.00', 1624507472, 1624507472, 1, '预支');
INSERT INTO `dd_wallet_virtual_logs` VALUES (7, 29, 29, 2, 'b27918cae4589659ac0e06867c9af793', '1800', '0.00', 1, '0.00', '0.00', '9900', '0.00', 1624507948, 1624507948, 1, '预支');
INSERT INTO `dd_wallet_virtual_logs` VALUES (8, 29, 29, 2, '4a699ac20e3502503b614edf94612252', '1800', '0.00', 1, '0.00', '0.00', '11700', '0.00', 1624508245, 1624508245, 1, '预支');
INSERT INTO `dd_wallet_virtual_logs` VALUES (9, 29, 29, 11, '1b373d74beb52366b70268c23fcd6b37', '0.00', '5.0', 1, '0.00', '0.00', '11700', '5', 1624509987, 1624509987, 1, '签到');
INSERT INTO `dd_wallet_virtual_logs` VALUES (10, 24, 24, 11, '3e7afd8ba1de41b6683713603eea9d10', '0.00', '5.0', 1, '0.00', '0.00', '0.00', '5', 1624510331, 1624510331, 1, '签到');
INSERT INTO `dd_wallet_virtual_logs` VALUES (11, 25, 25, 11, '6bac5357f1c5bfb5ea3f27818d8703de', '0.00', '5.0', 1, '0.00', '0.00', '0.00', '5', 1624510383, 1624510383, 1, '签到');
INSERT INTO `dd_wallet_virtual_logs` VALUES (12, 28, 28, 11, '6c84e9ef0064c3251a4070915fdb66c0', '0.00', '5.0', 1, '0.00', '0.00', '0.00', '5', 1624510504, 1624510504, 1, '签到');
INSERT INTO `dd_wallet_virtual_logs` VALUES (13, 30, 30, 11, '09e11d8ea347ac30cdbbfac6b4a86a63', '0.00', '5.0', 1, '0.00', '0.00', '0.00', '5', 1624510615, 1624510615, 1, '签到');
INSERT INTO `dd_wallet_virtual_logs` VALUES (14, 27, 27, 11, 'f89c99033c87ef9ff7ed62929604b165', '0.00', '5.0', 1, '0.00', '0.00', '0.00', '5', 1624515921, 1624515921, 1, '签到');
INSERT INTO `dd_wallet_virtual_logs` VALUES (15, 29, 29, 13, '8c5656f1bdb0bb9989f0a2bb6b1dd945', '7200', '0.00', 1, '0.00', '0.0', '18900', '0.00', 1624519283, 1624519283, 0, '转出');
INSERT INTO `dd_wallet_virtual_logs` VALUES (16, 29, 29, 18, '831272d331599669d52f7f8793885e7d', '0.1', '0.00', 0, '0.00', '0', '18899.9', '0.00', 1624520535, 1624520535, 0, '提现');
INSERT INTO `dd_wallet_virtual_logs` VALUES (17, 29, 29, 18, '5bb00cbbf83d400b60647fc65c1e6896', '0.1', '0.00', 0, '0.00', '0', '18899.8', '0.00', 1624520622, 1624520622, 0, '提现');
INSERT INTO `dd_wallet_virtual_logs` VALUES (18, 29, 29, 18, '9797af7c9efa4545b73cc78d8f27aaf1', '0.1', '0.00', 0, '0.00', '0', '18899.7', '0.00', 1624520683, 1624520683, 0, '提现');
INSERT INTO `dd_wallet_virtual_logs` VALUES (19, 29, 29, 18, '710511c5facfe6591e93d49cea1234d4', '0.1', '0.00', 0, '0.00', '0', '18899.6', '0.00', 1624520732, 1624520732, 0, '提现');
INSERT INTO `dd_wallet_virtual_logs` VALUES (20, 34, 34, 2, '96555e682de390ba5ff37de9f27792ab', '900', '0.00', 1, '0.00', '0.00', '900', '0.00', 1624520999, 1624520999, 1, '预支');
INSERT INTO `dd_wallet_virtual_logs` VALUES (21, 34, 34, 11, 'a70082617e8a84405f440a83890c00f5', '0.00', '5.0', 1, '0.00', '0.00', '900', '5', 1624521031, 1624521031, 1, '签到');
INSERT INTO `dd_wallet_virtual_logs` VALUES (22, 34, 34, 19, '8eee8155269777e8e976c59c22c74855', '0', '3', 0, '0.00', '0.00', '900', '2', 1624521064, 1624521064, 1, '消费');
INSERT INTO `dd_wallet_virtual_logs` VALUES (23, 34, 34, 10, '6251bd1c5e1462a25862e73378e5c29c', '18', '2', 0, '0.00', '0.00', '882', '0.00', 1624521367, 1624521367, 1, '消费');
INSERT INTO `dd_wallet_virtual_logs` VALUES (24, 34, 34, 10, 'abdb9c9631253442a037f6d111f8e8e4', '18', '2', 0, '0.00', '0.00', '864', '0.00', 1624521409, 1624521409, 1, '消费');
INSERT INTO `dd_wallet_virtual_logs` VALUES (25, 34, 34, 10, '8743f1012ce237953f1562cf6b08189f', '18', '2', 0, '0.00', '0.00', '846', '0.00', 1624521497, 1624521497, 1, '消费');
INSERT INTO `dd_wallet_virtual_logs` VALUES (26, 34, 34, 10, 'fed9a4e310e2a642edeea657638509a7', '10', '2', 0, '0.00', '0.00', '836', '0.00', 1624521538, 1624521538, 1, '消费');
INSERT INTO `dd_wallet_virtual_logs` VALUES (27, 44, 44, 11, '727e3f47852195e9505a6f1b8285def3', '0.00', '5.0', 1, '0.00', '0.00', '0.00', '5', 1624523287, 1624523287, 1, '签到');
INSERT INTO `dd_wallet_virtual_logs` VALUES (28, 37, 37, 11, 'a16473ba58f2c1538ca4bd769a35a889', '0.00', '5.0', 1, '0.00', '0.00', '0.00', '5', 1624524587, 1624524587, 1, '签到');
INSERT INTO `dd_wallet_virtual_logs` VALUES (29, 22, 22, 19, 'e6bd85bed83eb66af938773dde8b058e', '0', '0', 0, '0.00', '0.00', '0', '5', 1624789488, 1624789488, 1, '消费');
INSERT INTO `dd_wallet_virtual_logs` VALUES (30, 22, 22, 11, '33a2f90d9fb5ac9940b2fff0b290b9c6', '0.00', '5.0', 1, '0.00', '0.00', '0', '10', 1625003576, 1625003576, 1, '签到');
INSERT INTO `dd_wallet_virtual_logs` VALUES (31, 46, 46, 19, '5c2f3b5be671212188d48212134fb437', '0', '0', 0, '0.00', '0.00', '0', '0', 1625005728, 1625005728, 1, '消费');
INSERT INTO `dd_wallet_virtual_logs` VALUES (32, 46, 46, 19, '0d7fe7212d503d239feced97e0d0dc69', '0', '0', 0, '0.00', '0.00', '0', '0', 1625005740, 1625005740, 1, '消费');
INSERT INTO `dd_wallet_virtual_logs` VALUES (33, 46, 46, 11, '7fef6a9dc59b3105f92ad20a305af8d9', '0.00', '5.0', 1, '0.00', '0.00', '0', '5', 1625005827, 1625005827, 1, '签到');
INSERT INTO `dd_wallet_virtual_logs` VALUES (34, 46, 29, 18, '7fef6a9dc59b3105f92ad20a305af9d9', '0.10', '0.00', 1, '0.00', '0.00', '289.90', '0.00', 1618825896, 1618825896, 1, '提现');
INSERT INTO `dd_wallet_virtual_logs` VALUES (35, 48, 48, 19, 'b638ab4803943bd325b5476858ba7ee0', '0', '0', 0, '0.00', '0.00', '0', '0', 1625017043, 1625017043, 1, '消费');
INSERT INTO `dd_wallet_virtual_logs` VALUES (36, 48, 48, 19, '916c73a4400e138f4dc3973000787cf4', '0', '0', 0, '0.00', '0.00', '0', '0', 1625017086, 1625017086, 1, '消费');
INSERT INTO `dd_wallet_virtual_logs` VALUES (37, 48, 48, 11, '95c9db9c89900ade553fbf69133193c5', '0.00', '5.0', 1, '0.00', '0.00', '0', '5', 1625017132, 1625017132, 1, '签到');
INSERT INTO `dd_wallet_virtual_logs` VALUES (38, 25, 25, 19, 'efcd1d657cfbc079f85853f226d339fe', '0', '0', 0, '0.00', '0.00', '0', '5', 1625019540, 1625019540, 1, '消费');
INSERT INTO `dd_wallet_virtual_logs` VALUES (39, 25, 25, 19, 'f6ef34ccd11467d80e40934bc999ee9b', '0', '0', 0, '0.00', '0.00', '0', '5', 1625019542, 1625019542, 1, '消费');
INSERT INTO `dd_wallet_virtual_logs` VALUES (40, 25, 25, 11, '52fc46f93558ec957997c39de1744e7f', '0.00', '5.0', 1, '0.00', '0.00', '0', '10', 1625019576, 1625019576, 1, '签到');
INSERT INTO `dd_wallet_virtual_logs` VALUES (41, 48, 48, 2, 'cadccf68ed2a6432dfeae0c05bd0f9df', '900', '5', 1, '0.00', '0.00', '900', '0.00', 1625025013, 1625025013, 1, '预支');
INSERT INTO `dd_wallet_virtual_logs` VALUES (42, 48, 48, 13, '890c88494fb10dabcaf25731f13b075c', '900', '0.00', 1, '0.00', '0.0', '1800', '0.00', 1625026205, 1625026205, 0, '转出');
INSERT INTO `dd_wallet_virtual_logs` VALUES (43, 25, 25, 5, '6de2b76bf02e48478d159a30bf58e7ee', '358.50', '0.00', 0, '0.00', '1.5', '358.5', '0.00', 1625037356, 1625037356, 0, '转出');
INSERT INTO `dd_wallet_virtual_logs` VALUES (44, 25, 25, 10, '49a1975f418e01de060b2c5b5eddcee8', '18', '10', 0, '0.00', '0.00', '340.5', '0.00', 1625037654, 1625037654, 1, '消费');
COMMIT;

-- ----------------------------
-- Table structure for ss_user
-- ----------------------------
DROP TABLE IF EXISTS `ss_user`;
CREATE TABLE `ss_user` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `code` int(10) unsigned DEFAULT '0',
  `phone` varchar(255) DEFAULT NULL,
  `roles` varchar(255) DEFAULT NULL COMMENT '0:普通用户 1:准工人 2:工人 3:初级合伙人 4:高级合伙人 5:准高级合伙人 6:合伙公司 7:驻场老师 8:工厂HR 9:驻场经理 10:人事部 11:财务部  12:总经理',
  `username` varchar(255) DEFAULT NULL,
  `birthday` varchar(255) DEFAULT NULL,
  `sex` int(10) unsigned DEFAULT '0',
  `age` int(10) unsigned DEFAULT '0',
  `parent_id` int(10) unsigned DEFAULT '0' COMMENT '上级ID',
  `parent_eid` int(10) unsigned DEFAULT '0' COMMENT '所在公司ID',
  `isAdmin` int(10) unsigned DEFAULT '0',
  `isPrimary` int(10) unsigned DEFAULT '0' COMMENT '初级合伙人',
  `isSetupAdvanced` int(10) unsigned DEFAULT '0' COMMENT '准高级合伙人',
  `isAdvanced` int(10) unsigned DEFAULT '0' COMMENT '高级合伙人',
  `isOriginator` int(10) unsigned DEFAULT '0' COMMENT '创始人',
  `enterprise_id` int(10) unsigned DEFAULT '0' COMMENT '创始人的公司ID',
  `factory_id` varchar(255) DEFAULT '0' COMMENT '驻场老师所在工厂ID',
  `job_id` int(10) unsigned DEFAULT '0',
  `isDeath` int(10) unsigned DEFAULT '0',
  `inJob` int(10) unsigned DEFAULT '0',
  `avatar` varchar(255) DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL,
  `create_time` varchar(255) DEFAULT NULL,
  `login_time` varchar(255) DEFAULT NULL,
  `update_time` varchar(255) DEFAULT NULL,
  `ecode` int(11) DEFAULT '0' COMMENT '战略合伙人邀请码',
  `factory_teacher_ids` varchar(255) DEFAULT NULL,
  `factory_hr_ids` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=202 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of ss_user
-- ----------------------------
BEGIN;
INSERT INTO `ss_user` VALUES (72, 993422, '13800138000', '[0,1,100,200]', '李治明', '1', 0, 0, 73, 106, 2, 1, 0, 1, 0, 0, '0', 0, 0, 0, '/uploads/images/20200225/ce6f173a0fdd8323fe05191d0ebe3cb8.jpg', '508df4cb2f4d8f80519256258cfb975f', '1575356004', '1582757033', '1582757033', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (73, 999999, '13416801001', '[0,1,100,200,300,2,400]', '张国栋', '351878400', 1, 39, 73, 106, 2, 1, 0, 1, 1, 106, '30', 34, 0, 1, '/uploads/images/20200225/81aba86c5789c65ab2e4d9a2fb0eb48e.jpg', '508df4cb2f4d8f80519256258cfb975f', '1575357033', '1583234500', '1583234500', 0, '[30]', '[]');
INSERT INTO `ss_user` VALUES (74, 888888, '13620002358', '[0,1,100,200,300]', '朱益龙', '0', 0, 0, 74, 0, 2, 1, 0, 1, 1, 105, '0', 0, 0, 0, '/resources/avatar.png', '508df4cb2f4d8f80519256258cfb975f', '1575358240', '1582425123', '1582425123', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (76, 123456, '13828855724', '[0,1,100,800,400,500,200,600,2]', '李飞恒', '478108800', 1, 35, 73, 106, 1, 1, 0, 1, 0, 0, '30', 34, 0, 1, '/uploads/images/20200225/1bcddebc7c2b4b56654b9b99fc18a844.jpg', '4297f44b13955235245b2497399d7a93', '1575462669', '1583179541', '1583179541', 789310, '[31,30,32]', '[33]');
INSERT INTO `ss_user` VALUES (77, 768964, '13566668888', '[0,100]', '驻场老师', '2147443200', 0, 22, 0, 0, 0, 1, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '0', '1575569157', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (78, 0, '13318444535', '[0]', NULL, '0', 0, 0, 73, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '0e0ee27a729d3d9021e7424fc49065b8', '1576120488', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (79, 0, '15205184124', '[0]', NULL, '0', 0, 0, 73, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '1ee5a6915615246bbb971c4cba7ada75', '1576305593', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (80, 579145, '17869130706', '[0,1,100,200]', '李星亮', '1', 0, 26, 73, 106, 0, 1, 0, 1, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'f18a339c78eed4d9fed9a03288f727cd', '1576499956', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (81, 257500, '13215237736', '[0,1]', NULL, '0', 0, 0, 80, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '2592492ce1d0116116110e9656ad20cc', '1577248218', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (82, 727990, '15819482414', '[0,7]', NULL, '0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'bfd59291e825b5f2bbf1eb76569f8fe7', '1577519687', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (83, 695018, '17722020496', '[0,1,100,200]', NULL, '1', 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'b70a8436dcb2dd726b94ccb50b7b7a15', '1577520437', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (84, 187440, '13267321811', '[0,1,100,200]', '饶睿', '1', 0, 20, 74, 105, 0, 1, 0, 1, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'f735292e5d7e3a3a2d11d2f1085510ba', '1577521896', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (85, 446163, '18128577802', '[0,1,100,200]', '黄乾海', '1', 0, 0, 80, 106, 0, 1, 0, 1, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '50be88f392bf88fdb900f6e7bfc261cf', '1577522015', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (86, 231810, '18176913956', '[0,1,100,200]', '梁进文', '1', 0, 0, 73, 106, 0, 1, 0, 1, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '7eae15de33ff3bf383388dab3dcf5621', '1577522039', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (87, 583490, '13649864748', '[0,1,100,200]', '周建发', '1', 0, 48, 73, 106, 0, 1, 0, 1, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '0aa2fa7b66dbe2b4e159d9de4d429926', '1577522060', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (88, 0, '15126720802', '[0]', '宋兴会', '2147483647', 0, 23, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '0573fb4ddb6386a04af0211c1df2aa8c', '1577522104', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (89, 749549, '13928175792', '[0,1,100,200]', '冷金龙', '1', 0, 0, 74, 105, 0, 1, 0, 1, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '25e3f2ad3c0cf1eb847fb542636b7100', '1577522217', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (90, 258220, '18924481118', '[0,1,100,200]', '黄啟超', '1', 0, 28, 73, 106, 0, 1, 0, 1, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'cc3c971869837459873dc0118f0f3382', '1577522373', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (91, 0, '13423324413', '[0]', NULL, '0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'ec3059dd69a09c57da4f8433dd7b1524', '1577523108', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (92, 0, '18829957032', '[0]', '熊顺兵', '2147483647', 1, 18, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '0db84e80e4e1a3ec46ad8a3526616191', '1577524779', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (93, 0, '13798772908', '[0]', NULL, '0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '8c65d975dca2228ad95fb40377cbe497', '1577524950', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (94, 953141, '13790265608', '[0,1,100,200]', '李胜', '1', 1, 0, 73, 106, 0, 1, 0, 1, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '7a0a634ac91c34c8c207f4ff2743b1de', '1577525176', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (96, 433256, '18178786393', '[0,1,100]', NULL, '0', 0, 0, 73, 106, 0, 1, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '1e55dbf412cb74d5e2c21fb6452408c7', '1577528094', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (97, 0, '15817512698', '[0]', NULL, '0', 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'f77d3c849cf43fde82515e0381dd69e8', '1577529891', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (98, 516063, '15724025228', '[0,1]', NULL, '0', 0, 0, 87, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '9f06d27acfed78b43b103653d22bd2f2', '1577531152', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (99, 127650, '18002938185', '[0,1,100]', NULL, '0', 0, 0, 87, 106, 0, 1, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '074d8749508d2883837e2a20f8861748', '1577534850', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (100, 733879, '13713256024', '[0,1,100]', '李成高', '2147483647', 1, 20, 87, 106, 0, 1, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '2f5239e0f84c0d4b77b96b7f42a2bf6d', '1577534950', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (101, 829205, '17760130617', '[0,1,100]', '周建明', '2147483647', 1, 29, 87, 106, 0, 1, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '8df47461bf3204bb4acea03401361314', '1577535098', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (102, 681897, '13729992799', '[0,1,100]', NULL, '0', 0, 0, 73, 106, 0, 1, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '4cc32993ca02e01bea78a45f981094a7', '1577609440', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (103, 0, '15187904063', '[0]', NULL, '0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'f5e5846d0643e88109cdf8c23409e8a9', '1577616233', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (104, 401110, '18487807026', '[0,1,100]', NULL, '0', 0, 0, 80, 106, 0, 1, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'e10adc3949ba59abbe56e057f20f883e', '1577619438', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (105, 796489, '18000935265', '[0,1,100]', NULL, '0', 0, 0, 80, 106, 0, 1, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'f1af3e139325a880200074793b622a82', '1577620301', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (106, 616003, '17688884668', '[0,1,100]', NULL, '0', 0, 0, 73, 106, 0, 1, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'd0dcbf0d12a6b1e7fbfa2ce5848f3eff', '1577622669', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (107, 413344, '18897576059', '[0,1,100]', NULL, '0', 0, 0, 73, 106, 0, 1, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'b206e95a4384298962649e58dc7b39d4', '1577626591', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (108, 0, '13650484877', '[0,1]', '刘琴', '0', 0, 0, 74, 105, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '8f102145b473ff4f4182a7ce5ff6c69f', '1577668741', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (109, 0, '13266599756', '[0,1]', NULL, '0', 0, 0, 74, 105, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '438521513932437058524764fd3b4d1d', '1577671747', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (110, 0, '17707567676', '[0]', NULL, '0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '5e8667a439c68f5145dd2fcbecf02209', '1577677854', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (111, 0, '17707561676', '[0,1]', NULL, '0', 0, 0, 74, 105, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '6ebe76c9fb411be97b3b0d48b791a7c9', '1577677978', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (112, 0, '13720315430', '[0]', NULL, '0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'd323658defc10a9d223d74a1d64f70ec', '1577685705', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (113, 0, '13412642015', '[0,1]', '彭国池', '0', 1, 0, 73, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '8ef7aee46732d1dddf3e55103ec1359d', '1577686615', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (114, 0, '13316663636', '[0]', NULL, '0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'a8e69b73cfe723f12fc78cd581b38377', '1577693335', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (115, 0, '18928017333', '[0,1]', NULL, '0', 0, 0, 74, 105, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '82a18c0e93750cc2f33fb0937205c2cc', '1577693521', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (116, 0, '15112894940', '[0]', NULL, '0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '0cc30264fee831692abb4be3e4bda9a9', '1577704518', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (117, 0, '13265971086', '[0,1]', '谭志镜', '2147483647', 1, 26, 73, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '32a4b5c1572b55ff1052cdd2d6e0f30d', '1577704997', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (118, 0, '15377338840', '[0]', NULL, '0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'b236ae3744ebeaf45943743f9b6fba42', '1577705799', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (119, 0, '13308760983', '[0,1]', NULL, '0', 0, 0, 80, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'fcea920f7412b5da7be0cf42b8c93759', '1577713394', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (120, 0, '18091506899', '[0,1]', NULL, '0', 0, 0, 74, 105, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'ad228da7982ae4254bc8c85c8b317fca', '1577748180', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (121, 0, '15220800851', '[0,1]', '吴小福', '0', 0, 0, 94, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'f415a11cb18fe663c625be3f3a057fea', '1577759817', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (122, 0, '15977646986', '[0,1]', NULL, '0', 0, 0, 73, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '5fb43fa709a2e1512a7174867ae740e5', '1577775361', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (123, 0, '15812279568', '[0,1]', '张仕凯', '2147483647', 1, 27, 80, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '13309f7ef0809b6cf15da47d4a8e2b5b', '1577778204', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (124, 0, '13790648369', '[0,1]', '张国东', '0', 1, 0, 73, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'd1775d20b12e430869cc7be5d7d4a27e', '1577780110', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (125, 0, '13428472561', '[0]', NULL, '0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '2f686c04baa9008f93d3d10b1a7b319e', '1577780144', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (126, 0, '13539011855', '[0,1]', '杨祯祥', '0', 1, 0, 73, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'e1c21364530057bc884be07f32491acc', '1577780265', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (127, 0, '13457308705', '[0]', NULL, '0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'b0b12b165d774c81fafcf58f35513456', '1577780281', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (128, 0, '18576381748', '[0,1]', '张三牛', '2147483647', 1, 36, 87, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '4607e782c4d86fd5364d7e4508bb10d9', '1577780315', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (129, 0, '13018621929', '[0,1]', '张兆成', '0', 1, 0, 73, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '0b54452221edab4c13d494ec611a8c8a', '1577780379', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (130, 0, '18689455681', '[0,1]', '吴祝兵', '0', 1, 0, 73, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '41c376edbbcd3410e797116f11da2393', '1577780411', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (131, 0, '18024702029', '[0]', NULL, '0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '75e266f182b4fa3625d4a4f4f779af54', '1577783760', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (132, 459894, '19988323902', '[0,1,100,200]', NULL, '1', 0, 0, 80, 106, 0, 0, 0, 1, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'cb76771ee603d16408299a163548d5a6', '1577791153', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (133, 609545, '15987547698', '[0,1]', NULL, '0', 0, 0, 80, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'a238ba5ff9ceaa74086350fc6be0c70c', '1577794105', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (134, 358607, '13418334716', '[0,1,100]', NULL, '0', 0, 0, 108, 105, 0, 1, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '5513967bbaf53259bae59290b9a81bfb', '1577797631', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (135, 0, '18087617124', '[0]', '张才东', '2147483647', 1, 20, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'a29f9a873259b0518dbec6bb2d18cc2f', '1577798157', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (136, 207027, '18387638611', '[0,1]', NULL, '0', 0, 0, 80, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '83ee37f1ec61473e4978fe7443d6dd78', '1577847050', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (137, 0, '18566571733', '[0]', NULL, '0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '600be132ce0e8db227e6ff54d897c7b5', '1577848639', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (138, 274558, '13887622914', '[0,1]', NULL, '0', 0, 0, 80, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'e10adc3949ba59abbe56e057f20f883e', '1577963389', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (139, 142277, '13639261070', '[0,1]', NULL, '0', 0, 0, 80, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '52ddecab35550096539f470d174c3e0a', '1578020291', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (140, 749583, '13712990490', '[0,1,100]', '周金瑞', '0', 0, 0, 87, 106, 0, 1, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '391aa9e266a8604137ce598f9732846a', '1578037923', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (141, 688050, '15112336739', '[0,1,100]', NULL, '0', 0, 0, 122, 106, 0, 1, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'e4a04f6770efc9ea09b7df1a51016893', '1578105820', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (142, 901835, '13097963869', '[0,1,100]', NULL, '0', 0, 0, 122, 106, 0, 1, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '3d681aef22d032e2ce5729e841dd58ce', '1578106368', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (143, 471157, '16675855018', '[0,1,100]', NULL, '0', 0, 0, 141, 106, 0, 1, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '9f0cb6dbd4f054e262e0059501bcc0ad', '1578116907', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (144, 688325, '13887507697', '[0,1]', NULL, '0', 0, 0, 80, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '9b79c9d319bc08e2bd6647ba0f7ac929', '1578209229', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (145, 113942, '15187187782', '[0,1]', NULL, '0', 0, 0, 80, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '8e374d643bd348a3ccb82551e825042e', '1578209248', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (146, 952392, '15099750995', '[0,1,100]', NULL, '0', 0, 0, 108, 105, 0, 1, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '86330762d38818f5dc051c097fa58a5b', '1578214700', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (147, 905050, '15198636160', '[0,1]', NULL, '0', 0, 0, 100, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'f0635820a05d7983dd29c7225e6399fd', '1578218167', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (148, 0, '19987685585', '[0]', NULL, '0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'd1de3c25199524d757ebcecb30ef1adb', '1578226709', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (149, 0, '19977126305', '[0]', NULL, '0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'ae417dd9151af85740ec241c67a4bc35', '1578227137', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (150, 647965, '17387601039', '[0,1]', NULL, '0', 0, 0, 100, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '5b1bd39e4c04de446efd43891a0a2fe8', '1578235625', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (151, 368424, '18934992099', '[0,1,100]', '农明稳', '2147483647', 1, 26, 153, 106, 0, 1, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '25d55ad283aa400af464c76d713c07ad', '1578294884', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (152, 594901, '15078216305', '[0,1,100]', NULL, '0', 0, 0, 117, 106, 0, 1, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '3e9f7c4f188dac05618d85645e47a7fa', '1578295478', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (153, 810348, '13877623506', '[0,1,100]', '周美仙', '2147483647', 0, 27, 73, 106, 0, 1, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'ed11ee4d1bac397e58eed481963dbd59', '1578296212', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (154, 999130, '18388624672', '[0,1]', '伏帮顺', '2147483647', 1, 20, 100, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '63376d365d6ccac73bac234517e0bb42', '1578313163', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (155, 343126, '18929425243', '[0,1]', NULL, '0', 0, 0, 100, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'b9bf1ebb9aa745e5311e056b26ff83dc', '1578313448', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (156, 933276, '15625502998', '[0,1]', NULL, '0', 0, 0, 100, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'e28be1caffb3e8df36c882c8e0ddaa35', '1578313692', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (157, 178647, '18308760628', '[0,1]', NULL, '0', 0, 0, 80, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '8b008959fa76d38c93fad4e79fe08859', '1578322318', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (158, 409603, '13688737676', '[0,1]', NULL, '0', 0, 0, 80, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'afb6d6f763787f078535788502ad76f1', '1578368299', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (159, 0, '13226728008', '[0]', NULL, '0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '448ea13fa9d144bdf59d045f772b63b2', '1578396364', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (160, 857338, '18291538257', '[0,1]', '张泽隆', '0', 1, 0, 120, 105, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '44b3a8b2298c64fc31e7d5d1550972ef', '1578454331', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (161, 551785, '15377771858', '[0,1]', NULL, '0', 0, 0, 73, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '004c39e3d63b312768056c5763d9eb91', '1578471467', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (162, 624720, '13507762453', '[0,1,100]', NULL, '0', 0, 0, 73, 106, 0, 1, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '0318d57f34de80d0630424d51ed8c8dc', '1578491379', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (163, 514650, '18177614975', '[0,1]', '苏宁宁', '1070467200', 0, 17, 117, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '3bc8006e638ccc38963e7431896e9ddd', '1578549275', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (164, 572891, '13297768258', '[0,1]', '谭金花', '2147483647', 0, 31, 117, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'c770240a25ec78ab0c82b78d312b2148', '1578550508', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (165, 212421, '14769042089', '[0,1]', NULL, '0', 0, 0, 132, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '733d7be2196ff70efaf6913fc8bdcabf', '1578562040', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (166, 0, '15126859809', '[0]', NULL, '0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '68b8f51af97da94d4ffac6d9d1f5e661', '1578629511', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (167, 886587, '13532663869', '[0,1,100]', '熊国红', '0', 1, 0, 94, 106, 0, 1, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '06cf06349d3ea65ce7bad5aa24499fd9', '1578716922', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (168, 647169, '18775632600', '[0,1,100]', '李国龙', '2147483647', 1, 26, 117, 106, 0, 1, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '6da0f41c2ba1d5a44ad22553ef16aad3', '1578720267', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (169, 941243, '13549451421', '[0,1]', NULL, '0', 0, 0, 95, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '39ceeca25a806dffa815f04cf04a1218', '1578843399', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (170, 724283, '15177639141', '[0,1,100]', '方文思', '2147483647', 0, 34, 117, 106, 0, 1, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'f013c20e225122aedd02a8acb2928179', '1578903719', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (171, 0, '18177811724', '[0]', '韦福音', '2147483647', 0, 21, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'a15e74ba5596f9c9919fa506248b0a9e', '1578903875', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (172, 637048, '18825766260', '[0,1,100]', NULL, '0', 0, 0, 95, 106, 0, 1, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'e663cbde72da3337afe080014d3c49fd', '1578921845', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (173, 0, '17787652726', '[0]', NULL, '0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '24d3faf66f25be2df34be3a6d5b38ed9', '1579138229', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (174, 0, '18387606856', '[0]', NULL, '0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'f73a7b216fb732ab1b8c5b73250e13c6', '1579149607', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (175, 388374, '15878478307', '[0,1,100]', NULL, '0', 0, 0, 122, 106, 0, 1, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'c51591667fbae3bb4cc2fe14bec9da33', '1579331892', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (176, 0, '18200618590', '[0]', NULL, '0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'e9f5c5240c0bb39488e6dbfbdb1517e0', '1579411314', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (177, 0, '18508592683', '[0]', NULL, '0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '966afbf8c63ce53b048c46324131ee52', '1579537012', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (178, 623688, '17777615207', '[0,1,100]', NULL, '0', 0, 0, 122, 106, 0, 1, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '41e38763b5ebfcf35226dfb730b805f9', '1579751542', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (179, 0, '13427260911', '[0]', NULL, '0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'ea6f09a52ab147a4ae2beb91bb39ffed', '1579758013', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (180, 0, '17387670479', '[0]', NULL, '0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '4b52c54534caff3b56a5e5f2e9001754', '1579780633', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (181, 0, '17666235746', '[0]', NULL, '0', 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'e5850964febbf93e9045b0999a3ae8eb', '1580394815', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (182, 679462, '17869130307', '[0,1]', NULL, '0', 0, 0, 80, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'e95703529dbe0877d59021c596de6781', '1581056312', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (183, 0, '15154917898', '[0]', NULL, '0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'fcea920f7412b5da7be0cf42b8c93759', '0', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (184, 0, '17507699222', '[0]', NULL, '0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '5778a43873851b9e52e92e638616384d', '0', '1582463003', '1582463003', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (185, 0, '18666853295', '[0]', NULL, '0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '4569d246f7bd36303d44244ddc447a67', '0', '0', '0', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (189, 0, '13800138001', '[0,1]', '李嘉诚', '67795200', 1, 48, 73, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/uploads/images/20200225/07d803c68642ed6a89bcd0dd3fc71445.jpg', '4297f44b13955235245b2497399d7a93', '1582235847', '1583173701', '1583173701', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (192, 768520, '13800138010', '[0,1,100,200,600,400,500,2]', '小喜子', '920217600', 0, 21, 76, 106, 1, 1, 0, 1, 0, 0, '30', 34, 0, 1, '/uploads/images/20200301/d241597b7f00370ce08a55a656d4538c.jpg', '4297f44b13955235245b2497399d7a93', '1582831235', '1583080775', '1583080775', 0, '[30,34]', '[30]');
INSERT INTO `ss_user` VALUES (194, 0, '13800138011', '[0,1,2]', '陈书记', '478454400', 1, 35, 76, 106, 0, 0, 0, 0, 0, 0, '30', 34, 0, 1, '/uploads/images/20200301/a558873e92f308d864bee6c053b8502d.jpg', '4297f44b13955235245b2497399d7a93', '1582975483', '1583179767', '1583179767', 0, '[]', '[]');
INSERT INTO `ss_user` VALUES (195, 0, '13800138012', '[0,1,2]', '徐工', '667756800', 1, 29, 76, 106, 0, 0, 0, 0, 0, 0, '30', 34, 0, 1, '/uploads/images/20200301/297e3c0265434bff9c628305698ee514.jpg', '4297f44b13955235245b2497399d7a93', '1583055375', '1583056943', '1583056943', 0, NULL, NULL);
INSERT INTO `ss_user` VALUES (196, 0, '13800138013', '[0,1,2]', '吴迪', '68227200', 1, 48, 76, 106, 0, 0, 0, 0, 0, 0, '30', 34, 0, 1, '/uploads/images/20200301/00c107f55415161a0e5caaf43fbf007b.jpg', '4297f44b13955235245b2497399d7a93', '1583055766', '1583057447', '1583058243', 0, NULL, NULL);
INSERT INTO `ss_user` VALUES (197, 0, '13800138014', '[0]', '', NULL, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '4297f44b13955235245b2497399d7a93', '1583055892', NULL, '1583055892', 0, NULL, NULL);
INSERT INTO `ss_user` VALUES (198, 745480, '13800138020', '[0,1,100,200]', '维护者', '951926400', 1, 20, 76, 106, 0, 1, 0, 1, 0, 0, '0', 0, 0, 0, '/uploads/images/20200302/c08eb1aaca3de8e817f4fc207d109f56.jpg', '4297f44b13955235245b2497399d7a93', '1583081650', '1583084991', '1583084991', 0, NULL, NULL);
INSERT INTO `ss_user` VALUES (199, 745210, '13800138021', '[0,1,100]', '超级飞侠', '667843200', 1, 29, 198, 106, 0, 1, 0, 0, 0, 0, '0', 0, 0, 0, '/uploads/images/20200302/abe45106a81fc0b80056fb440e9ac719.jpg', '4297f44b13955235245b2497399d7a93', '1583081670', '1583083368', '1583083368', 0, NULL, NULL);
INSERT INTO `ss_user` VALUES (200, 0, '13800138022', '[0,1]', '', NULL, 0, 0, 198, 106, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', '4297f44b13955235245b2497399d7a93', '1583084792', '1583084850', '1583084850', 0, NULL, NULL);
INSERT INTO `ss_user` VALUES (201, 0, '13480085238', '[0]', '', NULL, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0', 0, 0, 0, '/resources/avatar.png', 'fa5adaf4a3be4d5eaa84223220bac8d2', '1583200602', '1583211405', '1583211405', 0, NULL, NULL);
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
